{"ID": "00010001", "file_name": "Phân vùng polyp trên ảnh nội soi bằng phương pháp học có giám sát dựa trên kiến trúc Transformer", "content": "Ung thư đại trực tràng (CRC) là bệnh ác tính thường gặp thứ ba ở nam và thứ hai ở nữ, và là nguyên nhân phổ biến thứ ba gây tử vong do ung thư. CRC có thể được ngăn ngừa bằng cách theo dõi nội soi thường quy và cắt bỏ polyp. Tuy nhiên, quá trình nội soi phát hiện polyp phụ thuộc vào nhiều yếu tố như chất lượng hệ thống trang thiết bị, quy trình nội soi, môi trường làm việc và kinh nghiệm của bác sỹ. Do đó, việc áp dụng công nghệ mới như các kỹ thuật nội soi tăng cường hình ảnh, dây soi với góc mở vi trường rộng hay ứng dụng công nghệ thông tin đặc biệt là xây dựng các thuật toán trí tuệ nhân tạo được kỳ vọng hỗ trợ bác sỹ trong chẩn đoán và điều trị ung thư đại tràng, cải thiện độ chính xác, giảm thiểu việc bỏ sót polyp trong quá trình nội soi. Đồ án hướng tới xây dựng mô hình trí tuệ nhân tạo sử dụng kiến trúc mạng học sâu cho bài toán phân vùng polyp trên ảnh nội soi đại tràng. Để xây dựng một mô hình mạng hiệu quả, trong đồ án tập trung tìm hiểu kiến trúc và cách tích hợp 3 mô-đun: (i) Mô-đun mã hóa sử dụng Mix Transformer (MiT) để trích xuất đặc trưng của ảnh đầu vào. Đây là kiến trúc mạng hiệu quả, đang ngày càng được sử dụng phổ biến để thay thế kiến trúc mạng nơron tích chập truyền thống bởi khả năng trích xuất đặc trưng toàn cục và xử lý vấn đề phụ thuộc xa thông qua cơ chế chú ý (self-attention). (ii) Mô-đun giải mã tích hợp thông tin từ các đặc trưng cho ra bởi mô-đun mã hóa với sự trợ giúp của cơ chế chú ý theo cả chiều sâu và chiều không gian nhằm tạo ra bản đồ đặc trưng toàn cục, bản đồ đặc trưng này có khả năng xấp xỉ được vị trí tương đối và hình dạng của polyp. (iii) Mô-đun tinh chỉnh đặc trưng sử dụng cơ chế chú ý ngược kết hợp với 4 đặc trưng cho ra bởi kiến trúc MiT tại 4 giai đoạn của mạng nhằm tìm ra các chi tiết còn thiếu, tinh chỉnh vùng biên của polyp, bổ sung thông tin cho bản đồ đặc trưng toàn cục nhằm tạo ra kết quả dự đoán cuối cùng đáng tin cậy hơn. Thực nghiệm cho thấy mô hình đề xuất đạt kết quả tốt trên cả khả năng học và khả năng tống quát hóa. Đồng thời, số lượng tham số và độ phức tạp tính toán đều nhỏ hơn các phương pháp phân vùng polyp dựa trên Transformer hiện tại.", "label": "human"}
{"ID": "00020001", "file_name": "Ứng dụng blockchain trong việc thanh toán bằng tiền điện tử", "content": "Trong thời đại phát triển hiện nay thì sự phát triển vượt bậc của Internet ở mọi lĩnh vực đã giúp cho việc trao đổi thông tin trở nên nhanh chóng, dễ dàng hơn. Từ việc mua sắm on thanh toán bằng QRcode, quản lý các công việc bằng phần mềm, gửi email... Bên cạnh đó cũng có những tổn thất từ các cuộc tấn công mạng đến các tổ chức tài chính gây ảnh hưởng lớn đến nền kinh tế cũng như xã hội. Từ những rủi ro đó cần sử dụng những công nghệ mới ví dụ như là nền tảng của đồng tiền số Bitcoin chính là Blockchain, được kì vọng không chỉ nhằm cắt giảm chi phí ngân hàng mà còn đảm bảo tính an toàn và xa hơn nữa thậm chí cách mạng hóa các giải pháp bảo mật. Sau quá trình tìm hiểu, em đã quyết định nghiên cứu và phát triển phương thức thanh toán tiền điện tử dựa trên công nghệ blockchain. Nội dung đồ án tập trung vào việc xây dựng phương thức thanh toán bằng tiền điện tử tích hợp cho các tổ chức có nhu cầu muốn sử dụng. Hệ thống giúp các tổ chức dễ dàng thao tác quản lý theo dõi các giao dịch từ khi bắt đầu tạo giao dịch đến khi thanh toán, quản lý các loại tiền điện tử, quản lý các thông tin về thu chi của chính mình ... Đồ án tốt nghiệp đã sử dụng công nghệ phía Backend như NestJS và bên Frontend như ReactJS, MUI, Antd, ... để có thể tạo ra ứng dụng quản lý tiện lợi và linh hoạt.Tuy nhiên, do thời gian hạn hẹp, mặc dù đã cố gắng hết sức, em thấy rằng đồ án tốt nghiệp khó tránh khỏi những thiếu sót. Em rất mong nhận được sự thông cảm và những lời góp ý, chỉ bảo tận tình từ quý thầy cô và các bạn.", "label": "human"}
{"ID": "00030001", "file_name": "Xây dựng hệ thống  trao đổi phiếu khuyến mại cho các nhãn hàng dựa trên công nghệ Blockchain", "content": "Trong thời đại công nghệ tiến bộ, các dịch vụ mua bán đặt hàng trên mạng ngày càng phát triển. Trong khi thực hiện đặt hàng khách hàng thường có xu hướng sử dụng các phiếu khuyến mại để có thể mua hàng với giá hợp lý nhất. Từ đây sinh ra nhu cầu trao đổi phiếu khuyến mại giữa các nhãn hàng. Tuy nhiên trong quá trình này sẽ gặp phải một số vấn đề đến từ cả người dùng và phía công ty. Một là công ty khó có thể ước tính chính xác chi phí để tạo và phát hành các phiếu khuyến mại này. Hai là các phiếu khuyến mại không thể trao đổi đồng giá giữa các nhãn hàng khác nhau, dẫn đến khó khăn cho người dùng và hạn chế cho doanh nghiệp. Ba là giúp người dùng được hưởng lợi một cách chính xác giá trị của các phiếu khuyến mại mà mình sử dụng.", "label": "human"}
{"ID": "00030002", "file_name": "Xây dựng hệ thống  trao đổi phiếu khuyến mại cho các nhãn hàng dựa trên công nghệ Blockchain", "content": "Có một số cách tiếp cận để giải quyết vấn đề này. Ví dụ như xây dựng một hệ thống, dựa trên quy ước giữa các nhãn hàng với việc trao đổi giá trị của các phiếu khuyến mại thông qua đơn vị tiền mặt. Tuy nhiên, việc này có hạn chế là khó có thể kiểm soát các phiếu khuyến mại, khó thống kê, tính toán giá trị của chúng. Hay một cách khác là thực hiện một dự án trao đổi các phiếu khuyến mại này thông qua nền tảng ảo, dưới sự giúp đỡ của công nghệ chuỗi khối để tạo nên một quy chung minh bạch cho các giao dịch. Tôi đã chọn cách tiếp cận này để giải quyết vấn đề đã được nêu ra. Việc sử dụng nền tảng ảo (website, ứng dụng) để quản lý việc trao đổi phiếu khuyến mại giúp dễ dàng quản lý, thống kê. Ngoài ra, công nghệ chuỗi khối mang lại một môi trường giao dịch đáng tin cậy, các giao dịch sẽ được lưu lại và có thể dễ dàng truy dấu. Với hệ thống trao đổi các phiếu khuyến mại này, người dùng có thể thực hiện trao đổi từ phiếu khuyến mại của hãng này sang một phiếu khuyến mại đồng giá của hãng khác. Phía công ty tham gia có thể tạo các phiếu khuyến mại thông qua một quỹ chung được tạo trên nền tảng công nghệ chuỗi khối, từ đó giúp quản lý tài sản một cách thuận lợi và minh bạch.", "label": "human"}
{"ID": "00040001", "file_name": "Hệ thống giám sát và điều khiển nhiệt độ, độ ẩm để tưới tiêu vườn hoa lan thông qua app android", "content": "Trong bối cảnh các ngành khoa học kỹ thuật, công nghệ đang vô cùng phát triển, có thể áp dụng mô hình công nghệ vào đa dạng ngành nghề cả công nghiệp và nông nghiệp. Đối với nông nghiệp, hiện nay nhiều người dân ngoài việc trồng các loại cây, loại hoa ở ngoài trời thì họ còn áp dụng các mô hình trồng cây ở trong phòng kính, sử dụng các hệ thống hiện đại để giám sát, tưới tiêu giúp tăng năng suất cây trồng. Chính vì vậy tôi đã quyết định chọn đề tài \"Hệ thống giám sát và điều khiển nhiệt độ, độ ẩm để tưới tiêu vườn hoa lan thông qua app android\" nhằm giúp người nông dân kiểm soát cây trồng hiệu quả hơn. Hệ thống của tôi có thể tự động cập nhật các thông số (nhiệt độ, độ ẩm) của vườn hoa lan từ các cảm biến về ứng dụng trên điện thoại, từ đó có thể theo dõi các thông số đó cũng như có thể điều khiển các chức năng của hệ thống thông qua app trên điện thoại như: bật đèn để làm tăng nhiệt độ, bật quạt để làm giảm nhiệt độ, bật bơm để tăng độ ẩm cho đất,... để có thể có nhiệt độ, độ ẩm phù hợp nhất cho vườn hoa. Qua đó đề tài của tôi hướng tới việc áp dụng công nghệ kỹ thuật giúp người nông dân có thể theo dõi tình trạng vườn hoa mọi lúc mọi nơi, cũng như có thể tưới tiêu tự động giúp tiết kiệm thời gian và công sức lao động.", "label": "human"}
{"ID": "00050001", "file_name": "Giải thuật tiến hóa đa quần thể cho bài toán định tuyến trong mạng đa miền", "content": "Từ lâu, giải quyết các bài toán liên quan đến đồ thị luôn là vấn đề quan trọng vì nó có thể giúp ích rất nhiều trong các hệ thống vận tải, tưới tiêu, hệ thống hậu cần,... Xuất phát từ thực tế này, bài toán định tuyến trong mạng đa miền ra đời để giải quyết bài toán định tuyến trong mạng. Dựa trên bối cảnh của mô hình h-PCE phân cấp trong đó PCE-parent thực hiện tính toán đường dẫn liên miền dựa trên thông tin định tuyến nội miền thu thập được từ các PCE con của nó. Tuy nhiên khi số lượng các nút và miền tăng lên thì mô hình này dần thể hiện ra những nhược điểm ở hai vấn đề. Một là khả năng tính toán của PCE-parent, hai là khả năng liên lạc của PCE-parent và PCE con. Do đó, bài toán IDPC-DU bổ sung thêm một điều kiện được gọi là ràng buộc miền duy nhất (DU) để giảm độ trễ của h-PCE đó là ngăn chặn một đường dẫn truy cập trên một miền nhiều hơn một lần. Do sự phức tạp của bài toán IDPC-DU, nên sử dụng một giải thuật meta heuristic một kĩ thuật phù hợp để giải quyết bài toán này. Trong các giải thuật meta-heuristic hiệu nay, nhóm các giải thuật lấy ý tưởng từ trí thông minh bầy đàn đang là xu hướng vì đem lại hiệu quả tốt trong việc tìm kiếm lời giải tối ưu. Một trong số các giải thuật đó là DSA [ 1] đang được đánh giá hiệu quả hơn PSO [ 6]. Thêm vào đó, để giải quyết nhu cầu trong thực tế rằng luôn có rất nhiều bài toán định tuyến trong mạng đa miền trong hệ thống mạng nên việc tối ưu hóa khi thực hiện nhiều nhiệm vụ cùng một lúc là vấn đề nhất định phải giải. Xuất phát từ vấn đề đó, đồ án này sẽ giới thiệu giải thuật tiến hóa đa quần thể Multi-Population Duck Swarm Algorithm (viết tắt là MP-DSA), để giải quyết đồng thời nhiều bài toán định tuyến trong mạng đa miền trong một thời điểm. Những đóng góp của đồ án này có thể tóm tắt như sau: Áp dụng giải thuật bầy vịt cho bài toán IDPC-NDU đơn nhiệm. Đề xuất giải thuật tiến hóa đa quần thể MP-DSA cho bài toán IDPC-NDU Thực nghiệm và so sánh kết quả Từ các đóng góp đó, đồ án này sẽ có bố cục gồm bốn chương như sau: Chương 1: Trình bày tổng quan bài toán định tuyến trong mạng đa miền cùng các nghiên cứu liên quan. Chương 2: Cơ sở lý thuyết bao gồm giải thuật bầy vịt và mô hình tiến hóa đa", "label": "human"}
{"ID": "00060001", "file_name": "Website mạng xã hội video", "content": "Mạng xã hội hiện nay đang là một phần không thể thiếu trong nhu cầu giải trí của mọi người. Không chỉ sử dụng xem để giải trí, mà nó còn giống như một phương tiện truyền thông lan tỏa những thông điệp nhanh nhất. Minh chứng cho việc đó chính là thời kỳ COVID 19. Khi mà tất cả mọi người đều phải cách ly, mạng xã hội là công cụ mang thông tin đến cho tất cả mọi người. Ngoài ra mạng xã hội còn gắn kết mọi người với nhau. Nắm bắt xu hướng hiện tại, tôi hướng đến tạo ra một mạng xã hội video đem lại các trải nghiệm tốt nhất đến mọi người. Với mạng xã hội video, mọi người có thể lan truyền thông tin bằng cách quay video và đăng tải, chia sẻ đến cho mọi người. Video liên tục được cập nhật mới nhất, người dùng sẽ không cảm thấy nhàm chán khi sử dụng. Hơn nữa, người dùng có thể chia sẻ video, like và bình luận video. Đặc biệt, dự án mạng xã hội video cung cấp tính năng nhắn tin với bạn bè, người dùng có thể kết bạn và nhắn tin đến bạn bè của mình cho dù cách bao xa hoặc thời gian nào cũng có thể nhận tin nhắn ngay lập tức. Đối với mạng xã hội video, việc xảy ra các video không phù hợp lứa tuổi, các video bạo lưc, không lành mạnh xuất hiện là không thể tránh khỏi. Để giảm thiểu việc đó xảy ra, hệ thống cung cấp tính năng báo cáo video, người dùng khi xem video cảm thấy video có nội dung không phù hợp sẽ báo cáo video và gửi đến người quản lý hệ thống. Người quản lý hệ thống sẽ nắm bắt được tình hình và có xử lý phù hợp đối với người đã đăng tải video đó. Cuối cùng, để làm ra được hệ thống mạng xã hội video, đưa ra được giao diện dễ sử dụng, trải nghiệm tốt đến người dùng, tôi đã phát triển hệ thống trên web với các công nghê sử dụng như Reactjs, Laravel để xây dựng trang web, Mysql để lưu trữ thông tin. Hiện tại trang web đã được triển khai tại  Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00070001", "file_name": "Xây dựng website quản lý thu chi cá nhân", "content": "Quản lý thu chi cá nhân là một vấn đề quan trọng mà ai cũng cần hiểu và thực hiện để nâng cao mức sống và giảm thiểu áp lực tài chính. Việc sử dụng phần mềm quản lý thu chi là một giải pháp bổ ích để theo dõi, ghi chép và tối ưu tài chính cá nhân. Với mục tiêu đó, em đã chọn đề tài \"Xây dựng website quản lý thu chi cá nhân\" để tạo ra một sản phẩm giúp người dùng quản lý thu chi, cân đối ngân sách và chi tiêu. Điều này giúp người dùng tránh được những vấn đề xấu liên quan đến tài chính. Trong đồ án này, em đã thực hiện triển khai phần mềm theo các bước phát triển, bao gồm lập kế hoạch, phân tích yêu cầu, thiết kế hệ thống, triển khai và kiểm thử. Phần mềm được xây dựng trên nền tảng web và sử dụng hệ quản trị cơ sở dữ liệu MySQL. Phần mềm đã đáp ứng được các yêu cầu chức năng cơ bản của hệ thống. Nó cho phép người dùng tạo bằng cách nhập hoặc trích chọn thông tin từ ảnh các giao dịch ngân hàng, theo dõi, quản lý và giám sát các khoản thu chi qua các biểu đồ trực quan, xây dựng các ngân sách cho các nhóm tiêu dùng khác nhau và chia sẻ các loại thu chi với người thân hoặc bạn bè.", "label": "human"}
{"ID": "00080001", "file_name": "Xây Dựng Website Bán Cây Cảnh Bonsai", "content": "Sau một thời gian nghiên cứu và phát triển đề tài \"website bán cây cảnh bonsai\"thì em nhận thấy: Thị trường cây cảnh càng lúc càng phát triển nhưng người dùng chưa thể tìm được mặt hàng ưng ý thông qua mạng phát triển hiện này. Vì vậy em phát triển trang web bán cây cảnh bonsai để đáp ứng nhu cầu của phần lớn những người yêu thích cây cảnh nhưng chưa tìm được hướng tiếp cận, vì vậy website của em phát triển dựa trên những cây cảnh thường xuyên xuất hiện trong các dịp lễ như Đào, quất, mai, táo phục vụ nhu cầu của đại đa số mọi người, phù hợp với nhiều tầng lớp xã hội. Website em xây dựng bao gồm 1 số chức năng: Xem và tìm kiếm cây, mua hàng và cập nhật tình trạng, quản lý tài khoản, quản lý hồ sơ cây cảnh, cập nhật ảnh cho quản trị viên, cập nhật shipper, tổng hợp chi tiết sản phẩm, tổng hợp theo từng loại cây, công nợ khách hàng, thu nhập của quán trong từng thời điểm. Qua đồ án này em hiểu thêm vè các công cụ lập trình em sử dụng cũng như các công nghệ làm web như vuejs và java spring boot. Em hi vọng với kết quả này, đề tài sẽ tiếp tục phát triển để phục vụ cộng đồng,", "label": "human"}
{"ID": "00090001", "file_name": "Nghiên cứu xây dựng hệ thống backend cho nền tảng NFT Marketplace", "content": "Sau khi Bitcoin được giới thiệu vào năm 2009 tới nay, công nghệ chuỗi khối (blockchain) đã được biết đến rộng rãi và trở thành xu hướng trên toàn cầu. Trong đó, thị trường tiền mã hóa trên blockchain được ghi nhận vào tháng 6 năm 2023 đạt giá trị lên tới 1.2 nghìn tỷ đô la và giá trị của toàn bộ NFT (Non-fungible token) một dạng tài sản số được xây dựng trên blockchain đạt giá trị hơn 7 tỷ đô la . Điều đó đặt ra vấn đề người dùng cần một nơi để mua bán, trao đổi các tài sản số này, đây là nhu cầu cấp thiết của những người đã, đang và sẽ sở hữu các dạng tài sản số. Vì vậy, trong ĐATN này, em đã khảo sát và nghiên cứu các giải pháp đã có trong nước cũng như trên thế giới. Từ đó, em tiến hành phân tích và xác định các yêu cầu nghiệp vụ của một hệ thống sử dụng công nghệ blockchain để xây dựng nên một chợ giao dịch tài sản số. Đồ án sẽ trình bày việc phân tích, thiết kế và xây dựng các chức năng của hệ thống. Thông qua việc triển khai và đánh giá thử nghiệm, hệ thống đã cho thấy giá trị ứng dụng của mình để phục vụ làm nơi trao đổi, mua bán các tài sản số của người dùng một cách an toàn, minh bạch.", "label": "human"}
{"ID": "00100001", "file_name": "Phát triển hệ thống bán giày trực tuyến", "content": "Trong những năm gần đây, kinh tế đã phát triển nhanh chóng và cạnh tranh gay gắt, đồng thời, khoa học và công nghệ đã đạt được sự phát triển vượt bậc. Công nghệ thông tin và thương mại điện tử hiện đang phát triển mạnh và hiện diện ở hầu hết các lĩnh vực của cuộc sống. Thương mại điện tử mang lại nhiều lợi ích cho cả doanh nghiệp và người tiêu dùng, giúp tiết kiệm thời gian và chi phí. Bán hàng trực tuyến ngày càng phổ biến và thuận tiện hơn, không chỉ đối với người tiêu dùng mà còn là hình thức kinh doanh phổ biến và được tất cả các doanh nghiệp tư nhân lựa chọn. Ngoài ra, sự bùng nổ của các sàn thương mại điện tử như Shopee, Lazada đã thúc đẩy xu hướng chuyển dịch từ kinh doanh truyền thống sang hình thức kinh doanh thương mại điện tử. Để khai thác tiềm năng của thương mại điện tử, em cùng với gợi ý của PGS.TS. Trịnh Văn Loan đã đưa ra giải pháp \"Phát triển hệ thống bán hàng giày trực tuyến\" là đề tài tốt nghiệp của mình. Với sản phẩm chủ lực là giày, đề tài này hứa hẹn mang lại sự tiện lợi và thuận tiện cho việc mua bán. Em mong muốn xây dựng một nền tảng kết nối giữa người bán và người mua, không chỉ giới hạn trong lĩnh vực giày mà còn mở rộng ra các sản phẩm khác như đồ điện tử, quần áo, và các sản phẩm làm đẹp.", "label": "human"}
{"ID": "00110001", "file_name": "Xây dựng trang web quản lý bán hàng", "content": "Trong bối cảnh ngành bán lẻ đang phát triển vô cùng mạnh mẽ cùng với sự hỗ trợ của công nghệ hiện đại, các phần mềm quản lý bán hàng đã trở thành công cụ không thể thiếu đối với những chủ kinh doanh, kể cả họ kinh doanh on hay off. Phần mềm quản lý bán hàng có ưu điểm là dễ sử dụng hơn phương pháp quản lý thủ công truyền thống giúp tiết kiệm thời gian, công sức tổng hợp sổ sách, tra cứu excel với những danh sách dài những con số. Chính vì vậy, em đã quyết định lựa chọn đề tài \" Xây dựng trang web quản lý bán hàng \" nhằm giúp chủ cửa hàng quản lý việc kinh doanh trở nên hiệu quả và chính xác hơn nhằm tiết kiệm thời gian, chi phí, kiểm soát được tình trạng của cửa hàng và tránh được sai sót trong quá trình bán hàng. Phần mềm cung cấp các tính năng chính như: (i) Quản lý đơn hàng, (ii) Quản lý sản phẩm, (iii) Quản lý kho hàng, (iv) Quản lý nhà cung cấp, (v) Quản lý thông báo, (vi) Xem báo cáo. Qua những tính năng trên, phần mềm sẽ hỗ trợ người dùng quản lý chi tiết tình hình kinh doanh của cửa hàng một cách nhanh chóng và tiết kiệm. Để có thể thực hiện được điều này, Đồ án là sự kết hợp giữa framework Laravel và Livewire giúp trang web thân thiện hơn với người sử dụng, cùng với đó là xây dựng hệ thống cơ sở dữ liệu để lưu trữ và truy xuất thông tin một cách hiệu quả.", "label": "human"}
{"ID": "00120001", "file_name": "Xây dựng hệ thống quản lý quán tạp hoá", "content": "Trong thời đại hiện nay, việc quản lý và vận hành quán tạp hoá đang trở nên ngày càng phức tạp hơn. Các chủ cửa hàng phải đối mặt với nhiều thách thức, bao gồm việc quản lý hàng hóa, theo dõi kho hàng, quản lý doanh thu và chi phí. Để giải quyết vấn đề này, đã có một số hướng tiếp cận được đưa ra, bao gồm sử dụng các phần mềm quản lý tạp hoá, áp dụng các phương pháp quản lý kho hiện đại, tối ưu hóa quy trình kinh doanh và sử dụng các giải pháp thanh toán trực tuyến. Trong phạm vi đồ án, tôi quyết định lựa chọn hướng giải quyết xây dựng một hệ thống quản lý quán tạp hoá với các chức năng cơ bản gồm quản lý nhân viên, quản lý kho hàng, quản lý sản phẩm và bán hàng. Tôi lựa chọn các chức năng này vì chúng là những vấn đề thiết yếu và phù hợp với khả năng triển khai nhanh và chi phí thấp. Về tổng quan giải pháp, cần tìm hiểu về nhu cầu của khách hàng cũng như thực tế đang gặp phải của cửa hàng tạp hoá, từ đó đưa ra thiết kế các tính năng và chức năng cụ thể của hệ thống quản lý. Đồng thời, cần xây dựng một cơ sở dữ liệu để quản lý thông tin về sản phẩm, kho hàng, nhân viên và khách hàng. Sau khi hoàn tất thiết kế và xây dựng hệ thống, cần thường xuyên nâng cấp, sửa lỗi để đảm bảo chất lượng hệ thống. Kết quả đạt được của đồ án là việc xây dựng thành công một hệ thống quản lý quán tạp hoá với các chức năng cơ bản gồm quản lý nhân viên, quản lý kho hàng, quản lý sản phẩm và bán hàng. Đây là một giải pháp thiết thực giúp cải thiện hiệu quả kinh doanh và nâng cao trải nghiệm mua sắm của khách hàng trong quán tạp hoá.", "label": "human"}
{"ID": "00130001", "file_name": "Hỏi đáp dịch vụ hành chính công", "content": "Đề tài đồ án của tôi tập trung vào nghiên cứu và giải quyết bài toán hỏi đáp trong lĩnh vực hành chính công. Hiện nay, việc cung cấp thông tin và hỗ trợ dịch vụ cho công dân trong hành chính công gặp phải nhiều khó khăn, mất thời gian và không hiệu quả. Việc tìm kiếm thông tin và thực hiện các thủ tục hành chính cần được cải thiện để nâng cao trải nghiệm người dùng. Để giải quyết vấn đề này, tôi đã lựa chọn hướng tiếp cận sử dụng các mô hình truy xuất thông tin dựa trên nền tảng xử lý ngôn ngữ tự nhiên. Hướng tiếp cận này cho phép xây dựng các mô hình thông minh có khả năng tự động tìm kiếm và cung cấp thông tin chính xác từ các tài liệu văn bản pháp luật. Trong đề tài, tôi đã tiến hành xây dựng hệ thống hỏi đáp dịch vụ công bằng cách kết hợp nhiều mô hình truy xuất thông tin, trong đó có các mô hình dựa trên thuật ngữ và mô hình ngữ nghĩa dựa trên BERT - một mô hình ngôn ngữ tiên tiến với khả năng biểu diễn ngôn ngữ tự nhiên hiệu quả. Cụ thể ở đây là sử dụng SimCSE cùng với các mô hình xếp hạng kết hợp với mô hình BM25+ truyền thống. Trong đồ án này, tôi cũng xây dựng bộ dữ liệu phục vụ riêng cho quá trình hoàn thiện đồ án. Kết quả nghiên cứu của tôi cho thấy hệ thống đạt được hiệu suất tốt trong việc trả lời câu hỏi và truy xuất thông tin hành chính công. Đây là đóng góp chính của đề tài, cải thiện trải nghiệm người dùng và giúp nâng cao hiệu quả hoạt động của hệ thống hành chính công. Với thành công đạt được trong việc áp dụng mô hình truy xuất thông tin trong lĩnh vực hành chính công, đề tài hy vọng góp phần thúc đẩy sự phát triển và ứng dụng của trí tuệ nhân tạo trong lĩnh vực này, đồng thời cung cấp một giải pháp hiệu quả và tiện lợi cho việc truy cập và sử dụng dịch vụ hành chính công.", "label": "human"}
{"ID": "00140001", "file_name": "Xây dựng hệ thống quản lý sân golf sử dụng ReactJs và NodeJs", "content": "Chuyển đổi số hiện nay đang từng bước thay đổi thế giới kinh doanh nó không chỉ thay đổi cách doanh nghiệp được nhìn nhận mà còn thay đổi cả cách họ hoạt động. Với mỗi một doanh nghiệp, quá trình chuyển đổi số sẽ diễn ra với lộ trình khác nhau. Cơ bản, đó là quá trình áp dụng các công nghệ mới như điện toán đám mây (Cloud Computing), dữ liệu lớn (Big data), Internet vạn vật (IOT), …Từ đó, dẫn đến những thay đổi cơ bản đối với cách doanh nghiệp hoạt động và cách họ cung cấp giá trị cho khách hàng. Hướng tới mục tiêu tối ưu hóa bộ máy quản lý doanh nghiệp, đem lại lợi nhuận và đưa tới nhiều cơ hội phát triển mới cho công ty. Hơn nữa, các sàn thương mại điện tử như Shopee, Lazada, Tiki đã tạo nên xu hướng chuyển dịch từ kinh doanh truyền thống sang hình thức kinh doanh thương mại điện tử. Lấy ý tưởng từ những hình thức thương mại điện tử, xu hướng chuyển đổi số, cùng với thực trạng sử dụng mô hình thủ công 100% hiện tại ở các sân golf, tôi cùng với sự gợi ý của ThS. Nguyễn Duy Hiệp đã đưa ra giải pháp xây dựng hệ thống quản lý sân golf để giải quyết các vấn đề tồn đọng hiện tại.", "label": "human"}
{"ID": "00140002", "file_name": "Xây dựng hệ thống quản lý sân golf sử dụng ReactJs và NodeJs", "content": "Hệ thống quản lý sân golf là hệ thống thương mại điện tử và giúp quản lý hệ thống sân golf, giúp những người chơi golf có thể dễ dàng tìm kiếm các địa điểm chơi golf, đồng thời có thể đặt sân một cách đơn giản qua một vài thao tác trên ứng dụng điện thoại thông minh thay vì phải gọi điện hay đến trực tiếp sân golf.", "label": "human"}
{"ID": "00140003", "file_name": "Xây dựng hệ thống quản lý sân golf sử dụng ReactJs và NodeJs", "content": "Với đồ án này, tôi mong muốn có thể tạo ra một nền tảng có thể kết nối giữa những người chơi golf và các sân golf, hơn thế nữa không chỉ là bộ môn golf, có thể mở rộng ra hệ thống các sân bóng cỏ nhân tạo, sân cầu lông, v.v.", "label": "human"}
{"ID": "00150001", "file_name": "Nhận diện khuôn mặt từ một ảnh mẫu đơn dùng mô hình CNN kết hợp kỹ thuật ảnh 3D", "content": "Đồ án \"Nhận diện khuôn mặt từ một ảnh mẫu đơn dùng mô hình CNN (Convolutional Neural Networks) kết hợp kỹ thuật ảnh 3D\" khám phá việc áp dụng mạng học sâu (Deep Learning), đặc biệt là mạng CNN vào bài toán nhận diện khuôn mặt từ một ảnh mẫu đơn (Single Sample Per Person - SSPP). Bằng cách sử dụng phương pháp học sâu, đồ án này giới thiệu một cách tiếp cận mới cho bài toán SSPP, kết hợp với kỹ thuật tái tạo khuôn mặt 3D từ ảnh 2D để nâng cao khả năng nhận diện khuôn mặt. Mô hình CNN được huấn luyện để trích xuất đặc trưng khuôn mặt từ ảnh đầu vào, trong khi các phương pháp tái tạo khuôn mặt 3D được sử dụng để tạo ra một tập dữ liệu mẫu mở rộng, giúp cải thiện độ chính xác của việc nhận diện khuôn mặt từ một ảnh mẫu đơn. Kết quả thử nghiệm cho thấy phương pháp này cung cấp một phương pháp hiệu quả cho bài toán nhận diện khuôn mặt từ một ảnh đơn mẫu, đồng thời mở ra hướng nghiên cứu mới trong việc kết hợp các mô hình học sâu với kỹ thuật ảnh 3D để giải quyết các vấn đề phức tạp trong lĩnh vực nhận diện khuôn mặt. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00160001", "file_name": "Hệ thống triển lãm và giao dịch tranh nghệ thuật NFT trên mạng Sui Network", "content": "Hiện nay, công nghệ chuỗi khối (Blockchain) đang phát triển mạnh mẽ, đem lại giải pháp cho nhiều bài toán thực tế cũng như định hướng phát triển công nghệ tương lai. Công nghệ blockchain có tiềm năng giải quyết nhiều thách thức hiện diện trong ngành nghệ thuật truyền thống như giải quyết vấn đề xác định nguồn gốc, gia tăng sự phổ biến và tiếp cận của cộng đồng. Ngoài ra có thể đảm bảo sự công bằng trong việc trả tiền cho các nhà sáng tạo nghệ thuật. Đối với các tài sản có nguồn gốc kỹ thuật số, công nghệ blockchain sẽ ghi lại thời điểm tạo ra tác phẩm, tạo ra ở nền tảng nào, được di chuyển đi đâu và về đâu, tất cả đều được dữ liệu ghi lại trên chuỗi. Điều thú vị đối với loại tài sản này là người sở hữu có thể kể những câu chuyện về vòng đời của tác phẩm đó, hay quá trình để tạo ra nó. Trong đồ án này, tôi đã nghiên cứu và phát triển một hệ thống triển lãm và giao dịch tranh nghệ thuật dưới dạng NFT trên mạng Sui Network. Hệ thống này giải quyết bài toán truy vết, xác định nguồn gốc, đảm bảo tính phi tập trung, giao dịch minh bạch. Ngoài ra người dùng và tác giả có thể giao dịch xuyên biên giới một cách nhanh chóng và thuận tiện, không qua trung gian nhờ ưu điểm của công nghệ blockchain và tiền mã hoá. Đồ án đã hoàn thành mục tiêu xây dựng hệ thống với đầy đủ tính năng nêu trên, đã được triển khai trên nền tảng web mà người dùng có thể dễ dàng truy cập và sử dụng. Với hệ thống này, người dùng có thêm một công cụ để bắt đầu hành trình của mình vào thế giới nghệ thuật số.", "label": "human"}
{"ID": "00170001", "file_name": "Xây dựng phần mềm quản lý bán hàng đa kênh", "content": "Phần mềm quản lý bán hàng là một hệ thống được sử dụng để giảm chi phí hoạt động đồng thời thúc đẩy hoạt động kinh doanh. Lợi ích của phần mềm quản lý bán hàng bao gồm giao nhiệm vụ cho nhân viên, quản lý luồng công việc, và theo dõi tiến độ công việc,. . . cùng điểm qua những lợi ích tuyệt vời từ việc sử dụng phần mềm quản lý bán hàng. Trong phạm vi đồ án, tác giả đề xuất xây dựng một phần mềm quản lý bán hàng đa kênh dựa trên cơ sở là những phần mềm đã có, từ đó nâng cấp bằng những công nghệ mới giúp cải thiện hiệu năng của phần mềm nhằm nâng cao tính bảo mật dữ liệu và khả năng mở rộng của toàn bộ hệ thống. Nội dung đồ án gồm những phần sau: Chương 1: Giới thiệu đề tài Đặt vấn đề về tầm quan trọng của phần mềm, từ đó đưa ra mục tiêu và hướng tiếp cận cho đồ án Chương 2: Khảo sát và phân tích yêu cầu Đưa ra các khảo sát về thực trạng của phần mềm và phân tích các chức năng cần có Chương 3: Công nghệ sử dụng Các công nghệ nền tảng để xây dựng phần mềm Chương 4: Thực nghiệm và đánh giá Quá trình thực nghiệm, đánh giá và nhận xét kết quả thu được Chương 5: Các giải pháp và đóng góp nổi bật Các công nghệ, giải pháp giúp tối ưu, cải thiện hiệu năng phần mềm Chương 6: Kết luận và hướng phát triển Tổng kết đóng góp của đồ án, khó khăn trong quá trình thực hiện và đưa ra hướng phát triển trong tương lai.", "label": "human"}
{"ID": "00180001", "file_name": "Website chia sẻ và học hỏi kiến thức", "content": "Hiện nay khi xã hội ngày càng phát triển, tri thức càng được coi trọng, bên cạnh đó nhu cầu được học hỏi và chia sẻ kiến thức ngày càng rộng mở. Nhưng không phải ai cũng có nhiều thời gian để đi học điều mình muốn hoặc không đủ khả năng chia sẻ kiến thức của mình cho tất cả mọi người, Chính vì vậy chúng ta cần một hệ thống để mọi người dễ dàng, thuận tiện chia sẻ và học hỏi tri thức với nhau. Thực tế hiện nay đã có nhiều các website, diễn đàn dạy học trực tuyến để mọi người học hỏi tri thức. Tuy nhiên đa số các website đó đều cần trả phí, dù miễn phí thì tính đa dạng lĩnh vực chưa cao, đồng thời người dùng chưa thể tự chia sẻ kiến thức của mình. Để giải quyết vấn đề đó em lựa chọn đề tài đồ án của mình là xây dựng website “Chia sẻ và học hỏi kiến thức”. Hệ thống sẽ là nơi cho tất cả mọi người giao lưu, chia sẻ tri thức trong mọi lĩnh vực cuộc sống bằng các bài giảng do tự mình tạo ra, đồng thời học hỏi những khóa học của mọi người để trau dồi kiến thức của bản thân.", "label": "human"}
{"ID": "00190001", "file_name": "Xây dựng website bán sách trực tuyến \"Laos Book Shop\" CHITPASONG SINGKHAOPHET chitpasong.s170274@sis.hust.edu.vn Ngành Khoa học máy tính Giảng viên hướng dẫn: THS. Lê Tấn Hùng Chữ kí GVHD Khoa: Khoa học máy tính Trường: Công nghệ thông tin và Truyền ", "content": "Sự ra đời của công nghệ thông tin làm phong phú bộ mặt xã hội, đời sống con người được nâng cao rõ rệt, đóng góp to lớn cho sự phát triển của nhân loại. Với xu thế toàn cầu hoá nền kinh tế thế giới, đặc biệt là nhu cầu trao đổi hàng hoá của con người ngày càng tăng cả về số lượng và chất lượng, nhu cầu sử dụng Internet ngày càng nhiều và các hình thức kinh doanh trên mạng ngày càng đa dạng và phong phú rất được nhiều người sử dụng và ưa chuộng. Sách là một nguồn kiến thức vô tận, chính vì vậy ai cũng luôn mong muốn sở hữu cho mình những nguồn thông tin có giá trị một cách nhanh chóng với mức giá tốt nhất. Đối với một cửa hàng hay shop, việc quảng bá và giới thiệu đến khách hàng các sản phẩm mới, đáp ứng được nhu cầu của khách hàng là rất cần thiết. Vấn đề đặt ra là thông tin trên các website bán sách phải đường xuyên cập nhật, chính xác để rút ngắn được khoảng cách giữa người mua và người bán, đưa thông tin về các sản phẩm mới nhanh chóng đến cho khách hàng. Nếu khách hàng muốn tìm một cuốn sách hay, nhanh chóng tiện lợi phù hợp với sở thích, cách đơn giản nhất là truy cập vào các website bán sách, chúng ta có thể đọc qua nội dung tóm tắt của sách, các thông tin liên quan như: tác giả, năm xuất bản,... hơn thế nữa là có thể đặt sách và thanh toán trực tuyến. Những thông tin về sách và về hiệu sách sẽ được khách hàng biết đến nhiều hơn, nhờ đó mà thương hiệu sẽ được quảng bá rộng rãi. Đồng thời dễ dàng cho người quản trị trong việc quản lý sách, cập nhật các loại sách mới, quản lý khách hàng. Là sinh viên được trang bị những kiến thức của ngành công nghệ thông tin với những kiến thức đã tiếp thu và vận dụng lý thuyết đó vào công việc thực tế nên em đã chọn đề tài “Xây dựng website bán sách trực tuyến” để thực hiện đồ án tốt nghiệp của mình với mục đích nghiên cứu và xây dựng một trang web bán sách, giúp người dùng có thể dễ dàng mua sắm mà không cần phải đi lại. Nội dung báo cáo được trình bày gồm những phần chính như sau: Chương 1: Giới thiệu đề tài Nội dung chương 1 sẽ tập trung vào giới thiệu bài toán, tìm hiểu yêu cầu và đưa ra định hướng giải pháp công nghệ cho bài toán. Chương 2: Khảo sát và phân tích yêu cầu Nội dung chương 2 sẽ đưa vào các khảo sát nhu cầu Khách hàng sẽ tiến hành các phân tích ban đầu, tập trung vào phân tích và chức năng của hệ thống.", "label": "human"}
{"ID": "00200001", "file_name": "Xây dựng trang web bán nội thất trực tuyến", "content": "Hiện tại con người đang sống trong thời đại công nghệ thông tin đang bùng nổ rất mạnh mẽ. Chúng ta có thể bắt gặp rất nhiều thiết bị phục vụ cho việc tìm kiếm tra cứu thông tin trên mạng Internet ở khắp mọi nơi: máy tính, điện thoại thông minh. Công nghệ thông tin không chỉ dừng ở mục đích phục vụ cho khoa học-kỹ thuật mà còn có các ứng dụng thực tế vào cuộc sống hằng ngày của con người. Trong lĩnh vực kinh tế nói riêng, các công ty, doanh nghiệp, cửa hàng đã áp dụng những lợi ích đó để quản lý, quảng bá và mua bán các sản phẩm một cách có hiệu quả hơn, điển hình đó là việc các trang web thương mại điện tử trở nên ngày càng phổ biến. Và một trong các sản phẩm có thế áp dụng lợi thế của công nghệ thông tin đó chính là nội thất nhà cửa. Trước đây, khi chưa có các trang web thương mại điện tử, các công ty, cửa hàng nội thất phải thực hiện rất nhiều bước để thu hút khách hàng cũng như quản lý cửa hàng: dán tờ rơi, áp phích quảng cáo, xây dựng các đại lý tại nhiều địa điểm,..Nhưng hiện tại, mọi thứ trở nên thuận tiện hơn khi có sự xuất hiện của trang web mua bán trực tuyến. Khách hàng có nhu cầu mua sắm nội thất chỉ cần có thiết bị kết nối mạng đã có thể tra cứu thông tin chi tiết về các sản phẩm: hình dạng, kích thước, giá bán,..mà không cần trực tiếp đi đến cửa hàng. Chủ cửa hàng cũng không cần mở quá nhiều các đại lý, phòng trưng bày nội thất để quảng bá sản phẩm. Từ đó, thời gian từ việc lựa chọn sản phẩm đến lúc ra quyết định mua của khách hàng, việc quản lý cửa hàng của người chủ được rút ngắn. Đó là lý do em chọn thực hiện đề tài \"Xây dựng trang web bán nội thất trực tuyến\". Giải pháp em lựa chọn là sử dụng các công nghệ lập trình đã có sẵn xây dựng một trang web có các đầy đủ chức năng để khách hàng có thể tra cứu thông tin sản phẩm nội thất, đặt mua trực tuyến sản phẩm; chủ cửa hàng có thể quảng bá sản phẩm đến khách hàng, quản lý thông tin các sản phẩm của cửa hàng, quản lý doanh thu. Kết quả đạt được là một trang web bán nội thất trực tuyến với các chức năng của khách hàng: tìm kiếm, xem thông tin sản phẩm, mua hàng trực tuyến,..chức năng của chủ cửa hàng: quản lý thông tin sản phẩm được đưa ra, quản lý quá trình mua bán sản phẩm trên trang web.", "label": "human"}
{"ID": "00210001", "file_name": "Xây dựng trình soạn thảo mã nguồn online cho phép chia sẻ, hướng dẫn và sửa lỗi lập trình thời gian thực", "content": "Trong thời đại số hóa và công nghệ hiện nay, chuyển đổi số trong giáo dục đã trở thành một xu hướng không thể phủ nhận. Bằng cách tích hợp công nghệ vào quá trình giảng dạy và học tập, chúng ta đã có được một môi trường học tập linh hoạt, phong phú và tương tác. Trong bối cảnh này, việc học lập trình thông qua giảng dạy trực tuyến đang trở thành một phương pháp phổ biến. Các nền tảng lập trình và các công cụ gọi điện trực tuyến đóng vai trò quan trọng trong việc giản dạy và học lập trình trực tuyến. Hiện nay, có nhiều nền tảng lập trình như Replit, Visual Studio Code... các nền tảng gọi điện như Microsoft Team, Zoom, Google Meet... đang được sử dụng rộng rãi. Tuy nhiên, để đáp ứng nhu cầu người dùng và tổ chức, việc làm chủ công nghệ và phát triển thêm tính năng mới phù hợp với từng loại hình giảng dạy là điều vô cùng quan trọng. Trong đồ án tốt nghiệp này, chúng tôi thiết kế và phát triển một trình soạn thảo mã nguồn trực tuyến, cho phép người dùng chỉnh sửa, chia sẻ mã nguồn với người khác theo thời gian thực, đồng thời hỗ trợ giao tiếp giữa các người dùng. Bên cạnh đó, người dùng có thể tải xuống mã nguồn hoặc chạy đoạn mã trực tiếp để xem kết quả, cũng như quản lý danh sách phòng code của mình. Hệ thống này được phát triển bằng Java, Spring boot cho phía server, cùng với ReactJs cho phía client. Chúng tôi cũng sử dụng các công nghệ như WebRTC, WebSocket để hỗ trợ việc chỉnh sửa mã nguồn, gọi điện theo thời gian thực. Hiện tại, hệ thống đã được triển khai trên internet ở địa chỉ  ailyopt.ai/ . Điều này cho phép người dùng truy cập và sử dụng các tính năng của trình soạn thảo mã nguồn trực tuyến mà chúng tôi đã thiết kế và phát triển. Bên cạnh việc chỉnh sửa và chia sẻ code theo thời gian thực, người dùng cũng có thể tải xuống mã nguồn và chạy nó để kiểm tra kết quả. Địa chỉ trên đây là nơi người dùng có thể trải nghiệm trực tiếp hệ thống của chúng tôi và quản lý danh sách phòng code cá nhân. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00220001", "file_name": "Hệ thống hỗ trợ cá nhân, tổ chức doanh nghiệp lựa chọn nhà cung cấp dịch vụ đám mây", "content": "Hiện nay, xã hội đang trong quá trình bùng nổ của chuyển đổi số. Điện toán đám mây ra đời là một trong những điểm đột phá của lịch sử ngành điện toán. Là nhân tố hỗ trợ cá nhân, tổ chức doanh nghiệp hoàn thiện quá trình này một cách nhanh chóng và hiệu quả hơn. Vì vậy, nhu cầu sử dụng, tìm kiếm dịch vụ đám mây tăng cao. Một trong những khó khăn của việc tìm kiếm dịch vụ là làm sao để lựa chọn được dịch vụ phù hợp. Và bản chất nhu cầu người dùng khi đưa ra quyết định lựa chọn là thường tự đặt ra nhiều yêu cầu, nhiều câu hỏi. Câu trả lời của những câu hỏi đó trở thành những tiêu chí để ra quyết định. Dự án “hỗ trợ cá nhân, tổ chức doanh nghiệp lựa chọn nhà cung cấp dịch vụ đám mây phù hợp” sẽ hướng đến việc tạo ra những chức năng có thể hỗ trợ người dùng lựa chọn. Đưa ra được dịch vụ gợi ý phù hợp từ những yêu cầu, tiêu chí được lựa chọn trước. Tìm kiếm, so sánh dễ dàng các thông tin nhà cung cấp, dịch vụ đám mây... Để thực hiện được, giải pháp đưa ra là tổng hợp dữ liệu nhiều thông tin, áp dụng khung tiêu chí Service Measurement Index (SMI), thực hiện nghiên cứu phương pháp Analytic Hierarchy Process (AHP). Từ đó thực hiện tính toán, xây dựng các chức năng hỗ trợ người dùng tìm kiếm, lựa chọn dịch vụ phù hợp. Hệ thống đã được đóng gói và triển khai trên môi trường internet. Link url: . Và đang được người dùng sử dụng. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00230001", "file_name": "Phân tích sắc thái bình luận trên trang thương mại điện tử", "content": "Ngày nay, vấn đề mua bán hàng on đang được nổi lên rất nhiều, nhất là trong đợt dịch vừa rồi chính vì thế mà các trang thương mại điện tử đang được phát triển rất nhiều như tiki, lazada, sendo,... Nhưng hiện nay trên các trang thương mại điện tử sản phẩm vẫn đang được đánh giá qua việc đánh sao cho sản phẩm kèm với những câu bình luận. Chính vì thế mà người dùng muốn có đánh giá tổng quát nhất về sản phẩm thì phải đọc hết bình luận. Nhưng đánh giá đó của người dùng chỉ mang tính cảm tính, không có độ chính xác cao. Xuất phát từ vấn đề trên, nhiệm vụ của đồ án tốt nghiệp (ĐATN) này là phát triển mô hình phân tích sắc thái bình luận và hệ thống thu thập và quản lý các sản phẩm trên các trang thương mại điện tử. Mô hình phân tích sắc thái bình luận sẽ được tích hợp trong hệ thống giúp người dùng có thể tìm kiếm một sản phẩm có đánh giá chính xác nhất và đáng mua nhất. Để làm được điều đó, trước tiên ĐATN tiếp cận bài toán phân tích sắc thái bình luận theo hướng End to End thành các nhãn: Positive, Negative, Neutral với độ chính xác ít nhất là 70%. Trong quá trình làm ĐATN, tác giả đã thực nghiệm các mô hình học sâu phoBERT và mô hình học máy SVM. Trong đó mô hình phoBERT đạt kết quả cao là 0.94 F1-score với bộ dữ liệu VLSP 2016 Dataset cùng với dữ liệu được thu thập từ các trang thương mại điện tử như tiki, thế giới di động. Đồng thời, ĐATN phát triển hệ thống website thu thập và quản lý sản phẩm từ các trang thương mại điện tử và website giúp người dùng tìm kiếm được sản phẩm có đánh giá chính xác nhất sử dụng công nghệ ReactJS, NodeJS, Firebase.", "label": "human"}
{"ID": "00240001", "file_name": "Ứng dụng phát hiện người và hành động lấy đồ trong cửa hàng tiện lợi", "content": "Trong ngành kinh doanh bán lẻ, ứng dụng của ngành công nghệ thông tin đang trở nên đa dạng và phổ biến hơn. Một trong số đó là việc áp dụng camera giám sát để hỗ trợ người quản lý, nhân viên cửa hàng theo dõi sản phẩm cũng như cửa hàng. Nhờ đó, người quản lý, nhân viên cửa hàng dễ dang kiểm soát sản phẩm, phòng chống trộm cắp. Các hệ thống camera giám sát hiện nay không hoạt động hoàn toàn độc lập, luôn cần có sự điều khiển và quan sát của con người. Trong khi đó, các cửa hàng tiện lợi vừa và nhỏ mặc dù có khả năng lắp đặt hệ thống camera giám sát nhưng không có đủ kinh phí để duy trì việc theo dõi liên tục. Vì thế, trong đồ án này, tôi sẽ phát triển một bài toán giúp phát hiện người và hành động lấy đồ trong cửa hàng nhằm mục đích hỗ trợ người quản lý, nhân viên cửa hàng theo dõi, quản lý sản phẩm cũng như nhận cảnh báo khi phát hiện hành vì lấy trộm đồ trong cửa hàng tiện lợi. Mục tiêu của tôi là tạo ra một giải pháp và xây dựng một bài toán đảm bảo độ chính xác và đặc biệt có thể triển khai trên nền tảng hệ thống camera giám sát có sẵn hiện nay. Để tiến hành thực nghiệm, bài toán sẽ được triển khai trên hệ thống camera thông minh mà chúng tôi đã xây dựng. Hệ thống này có khả năng tích hợp nhiều bài toán thị giác máy tính khác nhau và được triển khai trên nhiều nền tảng như ứng dụng web, ứng dụng dành cho máy tính, ứng dụng dàng cho thiết bị di động. Bài toán về cơ bản đã giải quyết được các vấn đề đã đặt ra. Mô hình phát hiện và nhận diện khách hàng đã đạt độ chính xác 82%, mô hình phát hiện hành động lấy đồ nhận diện chính xác 17 lần trong 20 lần thử nghiệm trong điều kiện không bị che khuất. Ứng dụng cung cấp tính năng theo dõi các dòng camera trực tiếp, gửi thông báo cho người dùng trong thời gian thực về cảnh báo trộm cắp và hết đồ trên kệ hàng. Với những kết quả đạt được như vậy, ứng dụng cho thấy được tiềm năng của mình trong việc giám sát và đảm bảo an toàn cho cửa hàng tiện lợi.", "label": "human"}
{"ID": "00250001", "file_name": "Xây dựng ứng dụng chấm công kết hợp sử dụng nhận dạng khuôn mặt trên thiết bị di động", "content": "Trong giai đoạn phát triển hiện nay, các công ty lớn nhỏ liên tục phát triển và mở rộng quy mô về nhân sự thì việc quản lý thông tin nhân sự, quản lý thời gian làm việc của nhân viên là một vấn đề không nhỏ mà các công ty cần phải giải quyết. Đồng bộ dữ liệu chấm công là một phần quan trọng trong công tác quản lý thời gian làm việc của nhân sự. Nó bao gồm việc tự động tổng hợp và xử lý bảng công sau khi nhân sự chấm công bằng hình thức nhận diện khuôn mặt hoặc sau khi cập nhập nghỉ phép, đơn xin về sớm, đi muộn, v.v. Dựa vào bảng công và các báo cáo đơn từ giúp các nhà quản lý nắm được chi tiết thời gian làm việc của nhân sự, đồng thời tiết kiệm thời gian cho việc tổng kết công hàng tháng. Quản lý thông tin nhân sự là một phần quan trọng trong công tác quản trị nhân lực doanh nghiệp. Nó bao gồm việc lưu trữ tập trung toàn bộ dữ liệu liên quan đến hồ sơ nhân sự, hợp đồng lao động, thông tin bảo hiểm, thông tin lương thưởng, v.v để hỗ trợ cho việc quy chuẩn và khai thác thông tin về công tác quản trị nhân lực toàn diện và thống nhất. Quản lý thông tin nhân sự còn giúp cho các nhà quản lý có thể đánh giá và phân công công việc cho nhân viên phù hợp. Đồ án triển khai xây dựng ứng dụng thiết bị di động có giao diện đơn giản, dễ sử dụng bao gồm các chức năng chính: ghi nhận chấm công thông qua việc nhận dạng gương mặt, tính lương dựa trên bảng công, xử lý các yêu cầu nghỉ phép, tăng ca của nhân viên, quản lý các thông tin của nhân viên, quản lý hợp đồng giữa cá nhân với doanh nghiệp.", "label": "human"}
{"ID": "00260001", "file_name": "Thiết kế và xây dựng ứng dụng web tìm kiếm công việc cho sinh viên", "content": "Hiện nay công nghệ thông tin đang ngày càng phát triển và phổ biến trong hầu hết mọi mặt của đời sống từ y tế, giao thông đến thương mại, ... Đi cùng xu thế trên, lĩnh vực giáo dục cũng đang có những thay đổi khi áp dụng công nghệ thông tin. Trong đồ án này, tôi đã thiết kế và xây dựng một ứng dụng Web với mục đích giúp cho sinh viên có thể tìm kiếm công việc của doanh nghiệp một cách phù hợp. Hệ thống được phát triển dựa trên công nghệ Java Spring Boot  cho phần server và ReactJS  cho phần client. Hệ thống bao gồm các tình năng liên quan đến tìm kiếm và ứng tuyển công việc dành cho sinh viên, đối với doanh nghiệp có thể quản lý công việc đăng tải, quản lý ứng viên khi đã ứng tuyển công việc.", "label": "human"}
{"ID": "00270001", "file_name": "Xây dựng website bán thuốc online", "content": "Ngày nay, thói quen mua sắm qua mạng đã dần trở nên phổ biến hơn, lĩnh vực y tế cũng không ngoại lệ. Hàng loạt các website bán thuốc on của các thương hiệu lớn như Long Châu, Pharmacity,... xuất hiện trên các nền tảng on. Các hiệu thuốc lớn lấn át các tiệm thuốc nhỏ cả về ở mặt bán hàng truyền thống và bán hàng online. Đối với vấn đề trên, em đã nghĩ ra ý tưởng tạo một website nơi để các nhà thuốc vừa và nhỏ có thể đăng bán các sảm phẩm đang có trong cửa hàng của mình. Website sẽ giải quyết vấn đề, các nhà thuốc vừa và nhỏ không cần tự tạo và quản lý cho mình 1 website riêng lẻ. Nó sẽ tập trung người dùng vào 1 website bán thuốc, ở đó họ có thể so sánh giá cả và tìm cho mình thông tin hiệu thuốc gần nhất. Để thực hiện điều đó, em sử dụng PHP để xây dựng những API của trang web, mySQL để lưu trữ và quản lý database, về phía front-end em sử dụng Reactjs để xây dựng giao diện. Mục tiêu đồ án của em là tạo ra website hướng đến các hiệu thuốc và người cần mua thuốc. Các nhà thuốc sẽ có quyền quản lý các sản phẩm, các đơn hàng. Về phía người dùng, họ có thể xem thông tin và chỉnh sửa tài khoản của mình, xem danh sách các sản phẩm, tạo các đơn hàng.", "label": "human"}
{"ID": "00280001", "file_name": "Nghiên cứu ứng dụng mạng đồ thị giải bài toán tự động trích xuất thông tin chữ viết từ hình ảnh", "content": "Trong lĩnh vực thị giác máy tính, những tác vụ như định vị chữ viết và nhận diện chữ viết đã trở nên tốt với những mô hình mạng nơ-ron học sâu. Trong ứng dụng của OCR (Optical Character Recognition - nhận diện kí tự quang học), một lớp bài toán trích xuất thông tin trong tài liệu có nhiều ứng dụng trong thực tế, chẳng hạn như hóa đơn, đơn thuốc, etc. Đối với lớp bài toán này, có những hướng tiếp cận khác nhau như phương pháp sử dụng tập luật, phương pháp sử dụng những mô hình ngôn ngữ tương tự bài toán phân loại văn bản. Tuy nhiên, những phương pháp trên không có tính tổng quát đối với nhiều định dạng của tài liệu. Vì vậy, em đề xuất một giải pháp hoàn chỉnh cho bài toán trích xuất thông tin từ ảnh văn bản, cụ thể là đơn thuốc, nhận đầu vào là hình ảnh định dạng bất kỳ, trả về thông tin về các trường chuẩn đoán bệnh, tên thuốc, số lượng, cách dùng, ngày tháng. Giải pháp của em bao gồm 3 khối chính: khối tiền xử lý gồm mô hình BERT, khối mạng nơ-ron đồ thị GraphSAGE và khối hậu xử lý gồm các lớp mạng phân loại. Em sử dụng hàm mất mát tiêu điểm để huấn luyện mô hình. Ngoài ra, để tăng độ chính xác của phần nhận diện chữ viết, em đề xuất một thuật toán tiền xử lý tài liệu, giúp tài liệu có thể được nắn chỉnh thẳng, sử dụng bài toán tìm bao lồi và tìm hình chữ nhật có diện tích nhỏ nhất bao quanh bao lồi. Đóng góp chính của đồ án tốt nghiệp gồm 3 phần: mô hình trích xuất thông tin trong tài liệu, phương pháp tiền xử lý dữ liệu nghiêng và trang web trích xuất thông tin từ đơn thuốc tiếng Việt. Để đánh giá hiệu quả của mô hình đề xuất, em so sánh mô hình đề xuất trên 3 bộ dữ liệu liên quan đến bài toán trích xuất thông tin trong tài liệu như là bộ dữ liệu SROIE, bộ dữ liệu FUNSD và bộ dữ liệu đơn thuốc bệnh viện của Việt Nam. Kết quả cho thấy, mô hình đề xuất có hiệu suất vượt trội mô hình PICK  3/3 bộ dữ liệu.", "label": "human"}
{"ID": "00290001", "file_name": "Hệ thống cộng đồng chia sẻ bài dịch văn bản tiếng Nhật", "content": "Thời gian gần đây, số lượng người học tiếng Nhật tại Việt Nam đang tăng lên hàng năm, đặc biệt theo kết quả khảo sát của Trung tâm giao lưu văn hóa Nhật Bản tại Việt Nam, trong 3 năm từ 2015-2018 số lượng người học tăng khoảng 110.000 người, tăng nhiều nhất trên thế giới. Chỉ sau 20 năm số cơ sở đào tạo tiếng Nhật tăng hơn 26 lần và số người học tăng lên hơn 17 lần . Vì vậy cùng với nhu cầu học và ôn thi tiếng Nhật, nhu cầu tìm kiếm và chia sẻ tài liệu tiếng Nhật ngày một tăng lên. Trong số đó không thể thiếu là các tài liệu dịch qua từ tiếng Nhật qua tiếng Việt ví dụ như: tài liệu dịch các bài báo Nhật, tài liệu dịch các bài đọc và sách ôn thi,. . . . Các tài liệu này đóng góp phần lớn vào việc làm giảm sự khó khăn trong việc học một ngôn ngữ mới, giúp định hướng tư duy người học và làm giảm đa số thời gian khi bắt đầu quá trình học và ôn thi. Tuy nhiên, là một sinh viên chuyên ngành Việt Nhật, trong quá trình học và ôn thi chứng chỉ tiếng Nhật, bản thân em hiểu rõ và sâu sắc khó khăn trong việc thiếu tài liệu dịch và việc bị “lạc” trong tràn lan các tài liệu dịch khác trên internet, không biết được đâu là tài liệu chính xác. Hơn nữa, đa phần các tài liệu dịch hiện nay đều do các cá nhân tự đăng trên các mạng xã hội như Facebook, Zalo,. . . hay rải rác trên các website nên việc tìm tài liệu dịch đối với một người mới học sẽ trở nên cực kỳ khó khăn vì không quen thuộc với việc tìm tài liệu. Vì vậy, nhận thực được thực trạng chia sẻ tài liệu rải rác như hiện nay, em mong muốn phát huy kiến thức về CNTT của mình để đưa đề tài Xây dựng hệ thống cộng đồng chia sẻ bài dịch tiếng Nhật vào làm ĐATN và hy vọng sẽ đóng góp được một phần giúp cải thiện được thực tế nêu trên. Sử dụng hệ thống, người dùng có thể trích dẫn các bài viết, bài báo mà bản thân đang khó khăn trong việc hiểu nội dung lên để nhờ những người dùng khác có kinh nghiệm hơn chia sẻ ý tưởng/ý hiểu của mình, giúp định hình cách đọc hiểu tài liệu cho người hỏi và cải thiện tư duy của những người chia sẻ. Hệ thống được xây dựng với mức độ phân quyền chặt chẽ giúp quản lí các tác nhân và chất lượng bài dịch/bài viết một cách đảm bảo. Hệ thống có tính ứng dụng thực tế cao, mang tính năng đa ngôn ngữ, hướng tới xây dựng một cộng đồng học và chia sẻ chất lượng cho những người đã, đang và sẽ học tiếng Nhật. Hệ thống được xây dựng dựa trên bộ công cụ lập trình mã nguồn mở dựa trên Javascript là MERN Stack bao gồm ReactJS , ExpressJS , NodeJS  và CSDL MongoDB , được đóng gói sử dụng Docker  và triển khai trên nền ii", "label": "human"}
{"ID": "00300001", "file_name": "HỆ THỐNG QUẢN LÝ GỬI XE CHO CÁC TOÀ NHÀ", "content": "Trong thời kỳ hiện đại hoá của đất nước, với tốc độ phát triển hiện tại, việc xuất hiện rất nhanh các khu đô thị cũng như là các chung cư, trung tâm mua sắm là điều tất yếu. Do đó để đáp ứng nhu cầu cũng như là chuyển đổi hệ thống số, em đã nghĩ đến ý tưởng phát triển hệ thống quản lý bãi gửi xe: quản lý vé xe theo ngày và quản lý vé xe tháng. Bài toán quản lý các vé xe dựa trên các thử cứng có sẵn và giúp đảm bảo tính an toàn và bảo mật với bãi xe và khách hàng của khu đô thị, chung cư, .... Với các công nghệ xây dựng website phổ biến dễ dàng nâng cấp cũng như là bảo trì mỗi khi xảy ra sự cố. Trong phạm vi của đồ án, em cũng đã cố gắng để tìm tòi, tham khảo để đưa ra các tính năng mới nhằm hỗ trợ và tăng tốc độ sử dụng của sản phẩm. Tuy nhiên, với trình độ hiện tại, em mong rằng mình có thể bổ sung thêm kiến thức và kỹ năng để phát triển sản phẩm trong tương lai.", "label": "human"}
{"ID": "00310001", "file_name": "Xây dựng hệ thống phát hiện và chú giải đột biến gen của bệnh nhân ung thư", "content": "Ung thư là nguyên nhân gây gây tử vong xếp thứ hai trên thế giới dù là bệnh không lây nhiễm. Ở Việt Nam, phần lớn các bệnh nhân ung thư được phát hiện ở giai đoạn muộn, không có nhiều cơ hội chữa trị dẫn tới tử vong. Do đó, việc tầm soát, sớm phát hiện ung thư là chìa khóa giúp cho việc điều trị ung thư có hiệu quả cao, giảm gánh nặng đối với xã hội. Với sự phát triển của khoa học kỹ thuật, các công cụ giải trình tự bộ và phát hiện biến thể gen ra đời. Cùng với đó, nguồn dữ liệu khổng lồ về ung thư do các tổ chức uy tín trên thế giới phát triển công khai đã hỗ trợ các bác sĩ chuẩn đoán, tìm kiếm thuốc điều trị chính xác bệnh ung thư, tăng cơ hội khỏi bệnh. Ở Việt Nam, việc phát hiện và hỗ trợ bác sĩ tìm kiếm thông tin liên quan đến bệnh ung thư ngày càng trở nên tương đối phổ biến trong các cơ sở y tế trên cả nước. Tuy nhiên, các trang thiết bị phát hiện đột biến thường có chi phí cao, độ chính xác của các phương pháp phát hiện đột biến và công cụ hỗ trợ các bác sĩ tìm kiếm thông tin thuốc điều trị liên quan là những rào cản có thể nhắc tới. Vì vậy, mục tiêu của đồ án là nghiên cứu, ứng dụng và xây dựng hệ thống phát hiện và chú thích biến thể gen liên quan tới 50 gen gây bệnh ung thư từ dữ liệu giải trình tự gen cung cấp bởi Đại học Y Hà Nội. Dựa trên nền tảng lý thuyết, các kỹ thuật, công cụ phát hiện đột biến với độ chính xác cao và tập dữ liệu ung thư uy tín, đã được kiểm chứng và công bố trên các trang web của COSMIC và NCBI. Hệ thống là công cụ hỗ trợ các bác sỹ chuẩn đoán và tìm thuốc chính xác trong điều trị bệnh ung thư.", "label": "human"}
{"ID": "00320001", "file_name": "Xây dựng công cụ kiểm thử và quản lý lỗi an toàn bảo mật của phần mềm Web", "content": "Lỗ hổng bảo mật là các điểm yếu hoặc sai sót trong hệ thống, ứng dụng. Các lỗ hổng bảo mật có thể gây ra những hậu quả nghiêm trọng, bao gồm mất dữ liệu, tiết lộ thông tin cá nhân, mất quyền kiểm soát và bị lợi dụng để tấn công vào hệ thống khác. Việc xác định, khắc phục và ngăn chặn các lỗ hổng bảo mật là rất quan trọng để đảm bảo an toàn và bảo mật cho phần mềm và dữ liệu của người dùng. Với vai trò là một nhân viên kiểm thử, em nhận thấy rằng việc kiểm thử và quản lý lỗ hổng bảo mật rất quan trọng. Hiện nay có nhiều công cụ hỗ trợ kiểm thử an toàn bảo mật web như Acunetix, Burp Suite, Nessus, Metasploit.... Mặc dù những công cụ này rất mạnh mẽ trong việc kiểm thử lỗ hổng nhưng lại không hề có chức năng trong việc quản lý lỗ hổng. Em tin rằng việc phát triển chức năng quản lý lỗ hổng sẽ giúp ích hơn trong quá trình kiểm tra lại lỗ hổng, sửa chữa lỗ hổng, giảm thiểu thời gian làm việc cũng như công việc nhưng vẫn đảm bảo được chất lượng. Hơn hết là nâng cao chất lượng cho phần mềm trước khi được triển khai thành sản phẩm thực tế. Đồ án tốt nghiệp của em được xây dựng với mục đích, tạo ra một công cụ hỗ trợ kiểm thử và quản lý lỗ hổng. Công cụ sẽ cho phép người dùng kiểm thử một ứng dụng web dưới dạng dự án và lưu trữ lại toàn bộ tin về lỗ hổng bảo mật tìm thấy được trong ứng dụng đó. Đảm bảo được rằng ứng dụng không mắc phải lỗ hổng bảo mật, đồng thời hỗ trợ trong việc xử lý, khắc phục những lỗ hổng bảo mật đã được tìm thấy. Đồ án tốt nghiệp được chia thành 7 chương. Chương 1 giới thiệu chung về đề tài của đồ án. Chương 2 khảo sát và phân tích bài toán của đề tài. Chương 3 giới thiệu chung về những công nghệ đề giải quyết bài toán đó. Chương 4 xây dựng thiết kế công cụ. Chương 5 triển khai và thực nghiệm công cụ. Chương 6 giải pháp và đóng góp nổi bật của em trong đồ án tốt nghiệp. Chương cuối cùng - chương 7 kết luận về đồ án tốt nghiệp những điều em đã học được từ việc làm đồ án và hướng phát triển cho đề tài.", "label": "human"}
{"ID": "00330001", "file_name": "Nghiên cứu và đánh giá ảnh hưởng của dữ liệu nhân tạo trong bài toán nhận diện chữ viết tay tiếng Việt", "content": "Một trong những phát minh vĩ đại nhất của con người đó chính là sự sáng tạo ra con chữ. Nhờ có con chữ, mà kiến thức thông tin mới có thể dễ dàng được lưu trữ, truyền bá, tạo tiền đề vững chắc cho sự phát triển của toàn bộ xã hội loài người. Tới kỉ nguyên ngày nay, vai trò của con chữ vẫn luôn quan trọng như vậy, chỉ khác là hình thức truyền bá con chữ càng ngày càng phát triển: từ việc lưu truyền qua những tấm da thú cho đến sự phát minh của giấy tạo đà cho sự phát triển của toàn bộ nhân loại. Trong kỉ nguyên của khoa học và công nghệ hiện đại ngày nay, máy tính là nơi hiệu quả nhất để có thể truyền bá, lưu trữ thông tin. Tuy nhiên phần lớn thông tin vẫn đang còn được lưu trữ trong không gian vật lý dưới dạng những quyển sách, quyển vở và để số hoá chúng sẽ mất rất nhiều công sức nếu như chỉ sử dụng thuần sức người. Do đó, để khắc phục điều này, bào toán OCR sử dụng học sâu là một bài toán rất quan trọng và cần được quan tâm. Tuy nhiên, bài toán này lại thuộc lớp bài toán học có giám sát, nghĩa là để cho nó hoạt động tốt cần một nguồn dữ liệu khổng lồ có nhãn, vẫn cần rất nhiều sức người để giải quyết. Để giảm thiểu công sức cho việc gán nhãn, người ta nảy sinh ra phương pháp tạo ra những hình ảnh mới từ những hình ảnh đã được gán nhãn sẵn. Đây là một cách làm rất phổ biến cho những bài toán thị giác máy tính nói riêng và những bài toán học sâu nói chung. Tuy nhiên, tuỳ bài toán con mà chúng ta lại cần những cách sinh ra dữ liệu nhân tạo phù hợp. Bài toán nhận dạng chữ viết tay tiếng Việt cũng không phải ngoại lệ, ta cần phải xác định những phương pháp tối ưu để tạo ra hoặc sử dụng những dữ liệu nhân tạo này một cách hợp lý thì mới có thể tạo ra được mô hình tốt nhất từ dữ liệu sẵn có mà không cần phải đi thu thập thêm dữ liệu mới. Đóng góp chính của đồ án này chính là nghiên cứu và đánh giá ảnh hưởng của dữ liệu nhân tạo trong bài toán nhận diện chữ viêt tay tiếng Việt.", "label": "human"}
{"ID": "00340001", "file_name": "Hệ thống website quyên góp hỗ trợ trẻ em mồ côi", "content": "Hiện nay trẻ em mồ côi vẫn luôn là vấn đề được xã hội quan tâm. Nhờ sự phát triển của công nghệ thông tin và truyền thông, đã có rất nhiều quỹ từ thiện, lời kêu gọi quyên góp với mục đích cứu giúp hỗ trợ các em nhỏ mồ côi. Nhưng lại phát sinh và tồn đọng các vấn đề liên quan đến hoạt động sao kê tiền từ thiện, mất đi lòng tin của những nhà hảo tâm. Các website về từ thiện hiện nay vẫn chưa giải quyết một cách trọn vẹn, và tổng quan có các hạn chế như sau (i) chưa có thống kê cụ thể tiền thu chi hoặc sơ sài và không cập nhật (ii) không chú trọng hoặc không có website quản lý tiền từ thiện, các trung tâm từ thiện đang kết nối (iii) Sơ sài trong việc cập nhật, hiển thị các bài viết về trẻ em mồ côi hoặc hoạt động từ thiện. Từ các hạn chế trên em đã lựa chọn hướng tiếp cận tạo ra một hệ thống website quyên góp hỗ trợ trẻ em mồ côi, với 3 người dùng chính là (i) nhà hảo tâm (ii) quản trị viên hệ thống (iii) đại diện trung tâm. Với những giải pháp như (i) kêu gọi quyên góp tiền từ thiện và phân phát cho các trung tâm liên kết một cách minh bạch cụ thể (ii) xây dựng hệ thống quản lý việc thu và chi tiền cho các trung tâm, các trung tâm gửi yêu cầu từ thiện và cần báo cáo chi tiêu một cách minh bạch (iii) quản lý các bài viết theo chuẩn SEO(iv) Công khai sao kê, hóa đơn, báo cáo thu chi cho người dùng. Nội dung của quyển đồ án bao gồm giới thiệu chung về đề tài, khảo sát và phân yêu cầu, giới thiệu về công nghệ sử dụng, thiết kế và triển khai, các giải pháp và đóng góp nổi bật, kết luận và hướng phát triển. Qua quá trình phát triển đồ án, em đã xây dựng được trang web Happy Children với những tính năng cơ bản, khắc phục được nhược điểm của các trang web từ thiện hiện nay. Trang web được triển khai với tên miền chính thức là:  Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00350001", "file_name": "Xây dựng cơ sở tri thức ngữ nghĩa và chatbot về du lịch Hà Nội", "content": "Đồ án ”Xây dựng cơ sở tri thức ngữ nghĩa và chatbot về du lịch Hà Nội” tập trung nghiên cứu và thực hiện xây dựng cơ sở tri thức ngữ nghĩa về du lịch lễ hội ở Hà Nội, từ đó phát triển hệ thống tra cứu và hỏi đáp sử dụng kho tri thức đã phát triển ở trên. Trong quá trình hoàn thành đồ án, tôi đã thực hiện các công việc: thu thập dữ liêu, xây dựng cơ sở tri thức về du lịch Hà Nội, xây dựng chatbot, xây dựng website tra cứu thông tin. Tôi đã sử dụng Python Selenium để crawl dữ liệu, Protégé để lưu trữ cơ sở tri thức và dịch vụ xử lý ngôn ngữ tự nhiên LUIS để huấn luyện chatbot. Hệ thống sau khi hoàn thành hoạt động tương đối ổn định, đáp ứng được các yêu cầu đề ra, thể hiện được ưu điểm của web ngữ nghĩa như khả năng suy diễn và tính linh hoạt trong sử dụng dữ liệu.", "label": "human"}
{"ID": "00360001", "file_name": "Phân cấp các khái niệm (taxonomy) trong một miền lĩnh vực sử dụng học máy", "content": "Trong thời đại ngày nay, nhờ có sự phổ biến của Internet mà hàng ngày luôn có một lượng lớn thông tin được tạo ra và đòi hỏi được xử lý. Muốn xử lý được khối lượng thông tin đó thì quá trình xử lý tự động bởi máy tính là rất cần thiết. Để làm được điều này, việc quan trọng đầu tiên cần là làm sao để máy tính có thể hiểu được thông tin hoặc tri thức. Hiện nay có nhiều phương pháp khác nhau để biểu diễn tri thức như dựa trên luật và quy tắc logic, sử dụng phương pháp học máy (cây quyết định, SVM). Trong đó học máy hiện đang là cách tiếp cận phổ biến và hiệu quả nhất. Lợi ích của việc sử dụng học máy là tự động hóa quy trình học và biểu diễn, có khả năng học các mối quan hệ phức tạp và xử lý được khối lượng dữ liệu lớn. Đề tài \"Phân cấp các khái niệm (taxonomy) trong một miền lĩnh vực sử dụng học máy\" góp phần giải quyết bài toán biểu diễn tri thức. Mục tiêu của đề tài là nghiên cứu và triển khai phương pháp tạo ra cấu trúc cây phân cấp, xây dựng phân loại các khái niệm trong một miền lĩnh vực cụ thể. Từ kết quả phân loại này, tri thức của miền lĩnh vực có thể được sử dụng trong việc xây dựng Ontology của miền lĩnh vực. Trọng tâm của đề tài tập trung vào việc tìm hiểu, nghiên cứu và triển khai thuật toán phân loại khái niệm tự động dựa trên việc sử dụng mô đun nhúng từ ngữ cục bộ, mô đun trích xuất đặc trưng của mẫu dữ liệu, mô đun xây dựng cây phân cấp và sử dụng dữ liệu văn bản giàu thông tin trên một miền lĩnh vực xác định được trích xuất từ Internet, các trang chứa dữ liệu các bài báo nghiên cứu thuộc cùng một lĩnh vực. Sau đó đưa ra những kết luận đánh giá và định hướng phát triển nghiên cứu trong tương lai của bài toán. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00370001", "file_name": "Phát triển ứng dụng meeting dựa trên video conferencing sử dụng công nghệ WebRTC", "content": "Mặc dù đại dịch Covid đã qua đi, nhưng các hoạt động xã hội như học tập, làm việc, và trò chuyện từ xa vẫn phát triển mạnh mẽ. Cuộc gọi video đã trở thành một phần không thể thiếu trong cuộc sống, giúp các buổi học, cuộc họp và trò chuyện có thể diễn ra trực tuyến. Mặc dù công nghệ cuộc gọi video đã tồn tại từ lâu, nhưng nó vẫn đang được cải tiến và hoàn thiện hàng ngày. Hiện nay, đã có nhiều hệ thống lớn được phát triển và sử dụng rộng rãi như Microsoft Teams, Zoom, Google Meet cũng như các ứng dụng trong mạng xã hội như Zalo, Facebook,... Nhu cầu sở hữu và phát triển công nghệ, cũng như thiết kế và cải tiến các tính năng mới là điều được ưa chuộng và đòi hỏi của nhiều tổ chức và doanh nghiệp. Trong đồ án này, chúng tôi đã thiết kế và xây dựng một ứng dụng meeting sử dụng công nghệ WebRTC. Ứng dụng được phát triển dựa trên công nghệ NodeJs cho phần server và ReactJS kết hợp với Cordova cho phần client. Ứng dụng bao gồm các tính năng quản lý các cuộc hội thoại, thực hiện nhắn tin, gọi video, bên cạnh đó người dùng có thể tìm kiếm và kết bạn với nhau.", "label": "human"}
{"ID": "00380001", "file_name": "Hệ thống đèn giao thông thông minh ứng dụng phương pháp học tăng cường", "content": "Giao thông là thứ mà tất cả chúng ta tham gia và tương tác mỗi ngày. Điều đó dẫn đến sự quan trọng của việc tối ưu hoá hệ thống giao thông. Tuy nhiên, trong thực tế tại Việt Nam nói riêng và trên toàn thế giới nói riêng, ta có thể thấy hệ thống giao thông vẫn tồn tại một số khuyết điểm có thể được cải thiện. Trong đó, trong phạm vi đồ án này, em chọn một vấn đề liên quan đến hệ thống đèn giao thông. Mỗi chúng ta tham gia giao thông đôi khi đều có thể rơi vào tình huống đứng chờ đèn đỏ một thời gian vô cùng lâu, trong đó đôi khi có những trường hợp mà ta có thể thấy các làn xe khác đang rất thoáng và đèn giao thông nên thay đổi để phù hợp hơn với tình trạng hiện tại. Sự không tối ưu này dẫn đến việc lãng phí thời gian của người tham gia giao thông, đồng thời cũng có những tác động tiêu cực đến cảm xúc cũng như sức khoẻ của họ trong những điều kiện thời tiết cực đoan. Hiện tại, hệ thống đèn giao thông đang hoạt động theo cơ chế thay đổi tuần tự theo các mức thời gian định trước. Ví dụ ở một cụm đèn sẽ có 30 giây đèn xanh, 30 giây đèn đỏ. Do đó ta có thể thấy rằng nó hoàn toàn không phản ảnh được lưu lượng giao thông thực tế tại chính thời điểm đó, từ đó dẫn tới sự không tối ưu. Giải pháp mà em để xuất trong phạm vi đồ án tốt nghiệp này là sử dụng một mô hình học tăng cường, cùng với việc giả định có thông tin các cảm biến trên lòng đường để tính toán lưu lượng giao thông, từ đó đưa ra một quyết định thay đổi đèn hợp lý tuỳ thuộc vào tình hình giao thông trong thời gian thực. Hướng tiếp cận này khắc phục được điểm yếu chính của giải pháp hiện tại, đó là mang tính chất thời gian thực (real-time) và các lựa chọn đều được tối ưu cho một hàm mục tiêu cụ thể (ở đây là giảm thiểu tổng thời gian dừng lại của toàn bộ phương tiện tham gia trong môi trường). Sau quá trình thực hiện, em đã xây dựng một môi trường mô phỏng tương đối hoàn thiện, thể hiện tốt một số tính chất quan trọng trong môi trường thực tế, và huấn luyện được một mô hình học tăng cường có khả năng tối ưu hoá hệ thống đèn giao thông. Mô hình này cũng đạt hiệu năng gấp 2 lần so với hệ thống không tối ưu trước đó. Với kết quả này, em hi vọng đồ án của mình sẽ phần nào góp phần xây dựng những giải pháp tối ưu hoá trong thực tế. Từ đó mọi người có thể tham gia giao thông một cách nhanh chóng, an toàn, thoải mái hơn.", "label": "human"}
{"ID": "00390001", "file_name": "Hệ thống quản lý thông tin và chấm công", "content": "Trong giai đoạn bùng nổ về khởi nghiệp trên thị trường hiện nay, nhu cầu nhân sự của những startup này là vô cùng lớn. Nhu cầu về nhân sự vô cùng lớn này đã đặt ra vấn đề lớn cho việc quản lý công việc, thông tin nhân sự cũng như quản lý lịch làm việc của nhân viên. Quản lý thông tin nhân viên là một đề tài quan trọng trong lĩnh vực quản lý nhân sự. Nó bao gồm việc lưu trữ, quản lý và sử dụng thông tin của nhân viên để hỗ trợ quản lý công việc và đánh giá hiệu suất của nhân viên. Thông tin nhân viên bao gồm thông tin cá nhân, thông tin về kinh nghiệm làm việc, kỹ năng và trình độ học vấn. Quản lý thông tin nhân viên giúp cho các nhà quản lý có thể đánh giá và phân công công việc cho nhân viên phù hợp, tăng hiệu quả và sức mạnh cũng như duy trì và phát triển cho startup. Quản lý công là một đề tài rất quan trọng trong hoạt động kinh doanh của một doanh nghiệp. Nó giúp các nhà quản lý đánh giá và theo dõi năng suất công việc của nhân viên, đồng thời xác định các chế độ nghỉ phép và nghỉ lễ. Quản lý công còn giúp cho công ty cập nhật và quản lý thông tin lương, phụ cấp và các chi phí liên quan đến nhân viên. Tất cả những thông tin này sẽ giúp doanh nghiệp quản lý tài chính một cách hiệu quả hơn. Đồ án này triển khai và thực thi việc tạo lập một trang web quản trị, có giao diện đơn giản, có trang web quản lý các thông tin của nhân viên, bảng công, các loại đơn liên quan đến tính công, giúp quản lý cũng như nhân viên có thể dễ dàng thao tác và thực hiện.", "label": "human"}
{"ID": "00400001", "file_name": "Xây dựng module phân loại dữ liệu, gợi ý, tìm kiếm và bảo mật trong hệ thống học và thi online worksheetzone", "content": "Ngày nay với sự phát triển của cuộc cách mạng 4.0, việc chuyển dịch các hoạt động từ trực tiếp sang trực tuyến là nhu cầu hết sức thiết thực để có thể mở rộng quy mô cũng như lan tỏa thêm sức ảnh hưởng mà các hoạt động này mang lại và việc học và thi cũng không nằm ngoài những hoạt động đó. Cùng thời điểm bùng nổ về sự tiến bộ vượt bậc của khoa học kỹ thuật, dịch bệnh Covid 19 đã có những ảnh hưởng không hề nhỏ trong quá trình chuyển dịch các hoạt động giáo dục qua hình thức trực tuyến. Việc xây dựng hệ thống học và thi trực tuyến nhằm đơn giản hóa việc học của học sinh trong thời gian giãn cách xã hội là một giải pháp tốt nhằm giải quyết vấn đề này. Trong đó, việc phân loại dữ liệu trong ngân hàng đề thi, cùng với đó là gợi ý tìm kiếm những đề thi có liên quan tới người sử dụng nhằm giúp giảm thiểu thời gian tìm kiếm những đề thi theo nhu cầu là một mô đun rất cần thiết. Bên cạnh đó, việc bảo mật cho hệ thống học và thi trực tuyến cũng là một vấn đề cần được chú trọng. Từ tình hình thực tế, hướng tiếp cận của em là nghiên cứu một hệ thống phân loại dữ liệu, xây dựng thuật toán gợi ý, tìm kiếm các đề thi cùng với đó là tích hợp một thư viện đảm bảo các giải pháp bảo mật cơ bản nhất cho hệ thống học và thi trực tuyến. Qua quá trình nghiên cứu và phát triển, hệ thống đã đáp ứng được những yêu cầu cơ bản nhất về mặt bảo mật như phòng chống các lỗi bảo mật cơ bản nhất với một hệ thống website như chống giẳ mạo người dùng, mã hóa những dữ liệu cần thiết, đóng dấu bản quyền với chữ ký ảnh cùng với đó là một hệ thống phân loại dữ liệu, gợi ý tìm kiếm những đề thi liên quan đến dữ liệu tới từ người sử dụng.", "label": "human"}
{"ID": "00410001", "file_name": "Thiết kế và xây dựng trang web thuê và cho thuê homestay", "content": "Trong những năm gần đây, khi kinh tế ngày càng phát triển thì con người càng có nhu cầu nâng cao chất lượng cuộc sống của bản thân, chính vì lẽ đó mà nhu cầu du lịch cũng ngày càng tăng cao. Có thể thấy không ít những website cho phép chúng ta có thể tìm kiếm và đặt được những căn phòng nghỉ dưỡng có chất lượng và dịch vụ tốt của khách sạn chỉ bằng những thao tác đơn giản. Nhưng với xu thế giới trẻ hiện nay, khách sạn không còn là mô hình duy nhất được lựa chọn mà thay vào đó là các kiểu homestay, nhà nghỉ du lịch kiểu gia đình... Các nền tảng tiêu biểu trên thế giới có thể kể đến như Booking hay Airbnb. Tuy nhiên chúng đều hướng đến lượng người dùng toàn cầu, không có dành riêng cho người dùng Việt Nam. Ngoài ra, việc trải nghiệm du lịch tự túc không giống như việc đi theo tour du lịch, mà cần phải tìm hiểu kỹ, tham khảo ý kiến của những người đi trước về nơi ở, địa điểm để tạo ra một lịch trình du lịch lý tưởng. Việc này đối với những người du lịch tự túc hiện nay là tương đối khó khăn. Nhận thấy vấn đề này, đồ án này tập trung phát triển một hệ thống nhằm kết nối giữa chủ nhà, chủ homestay và khách lưu trú giúp họ có thể liên hệ với nhau khi có nhu cầu về nhà trọ, nơi nghỉ dưỡng. Một mặt, hệ thống giúp cá nhân những người có nhu cầu dễ dàng tiếp cận các thông tin của những địa điểm tham quan hay tìm cho mình một lịch trình du lịch phù hợp mỗi khi đến một địa điểm bất kỳ. Mặt khác, hệ thống giúp các chủ nhà có thể quảng bá thông tin nơi ở của mình rộng rãi tới các cá nhân. Để đạt được điều này, hướng tiếp cận của đồ án là đưa ra một hệ thống mà người dùng có thể dễ dàng tìm kiếm thông tin về nơi nghỉ ngơi phù hợp với tiêu chí của bản thân. Bên cạnh đó, đồ án cũng cung cấp một hệ thống quản lý dành cho quản trị viên và chủ nhà khi muốn đăng tải, quản lý thông tin về nơi nghỉ của mình. Điểm đặc biệt của đồ án này là việc người dùng có thể chia sẻ lịch trình du lịch cá nhân của mình cho người khác cùng tham khảo khi họ đã từng lưu trú ở địa điểm du lịch đó, từ đó giúp nâng cao chất lượng mỗi chuyến du lịch của mọi người.", "label": "human"}
{"ID": "00420001", "file_name": "Xây dựng hệ thống quản lý mạng không dây công cộng", "content": "Hiện nay việc lắp đặt và sử dụng mạng không dây (mạng wifi) ở các địa điểm công cộng đã trở nên cực kì phổ biến, từ đó những người cung cấp dịch vụ mạng không dây công cộng cũng phát sinh nhu cầu chủ động quản lý và cấu hình thông số mạng. Các hãng cung cấp thiết bị phần cứng đã xây dựng cho riêng mình những hệ thống quản lý để đáp ứng nhu cầu của khách hàng. Tuy nhiên, tính năng và độ thân thiện của các hệ thống này vẫn còn đang ở mức hạn chế, gây nhiều khó khăn cho người sử dụng. Đồ án thực hiện việc tìm hiểu, phân tích, thiết kế và xây dựng một hệ thống thông tin hỗ trợ các nghiệp vụ liên quan đến quản lý và cấu hình mạng không dây. Hệ thống được triển khai thành một trang web - phương pháp được sử dụng rất rộng rãi hiện nay, nhằm tạo ra một điểm truy cập dịch vụ tập trung cho những người cung cấp dịch vụ wifi hoặc những người quản lý mạng wifi công cộng có thể dễ dàng theo dõi hoạt động, cấu hình các thông số kỹ thuật và tạo ra các Captive Page cung cấp giao diện truy cập đến khách hàng một cách nhanh chóng và thuận tiện. Việc xây dựng hệ thống áp dụng kiến trúc Micro-frontends, Micro-services vàsử dụng các công nghệ hiện đại: Framework VueJS, Single-Spa, Django, Post greSQL,. . . Đóng góp quan trọng nhất của ĐATN này là khắc phục được những nhược điểm của các hệ thống quản lý thiết bị hiện có; tích hợp thêm chức năng tùy biến tạo giao diện truy cập wifi cho khách hàng; triển khai thành công kiến trúc Micro-frontends khi xây dựng sản phẩm - mô hình kiến trúc còn khá mới mẻ, chưa được áp dụng quá nhiều nhưng có tiềm năng rất lớn được phổ biến rộng rãi trong tương lai gần. Kết quả thực hiện đồ án là đã tạo ra một website đáp ứng được các yêu cầu cơ bản và nâng cao của người dùng trong việc quản lý mạng không dây công cộng, hệ thống hướng đến việc scale-up (mở rộng) để phục vụ cho những doanh nghiệp, địa điểm lớn với tần suất truy cập mạng Internet lên đến hàng trăm nghìn request mỗi ngày.", "label": "human"}
{"ID": "00430001", "file_name": "Website phân tích chứng khoán", "content": "(i) Giới thiệu vấn đề (a) Mục đích Sản phẩm của đồ án này xây dựng là một website giúp người dùng phân tích chứng khoán trên thị trường, đồng thời theo dõi và hỗ trợ người dùng đưa ra quyết định đến hành động mua, bán của mình với các mã chứng khoán. Kèm theo đó website cũng cung cấp cho người dùng kiến thức để có thể hiểu và tiếp cận đúng vào thị trường chứng khoán tại Việt Nam thông qua video, hội thảo, bài viết, nghiên cứu ... (b) Thực trạng Đã có khá nhiều website phân tích chứng khoán trên thị trường và đã làm rất tốt, nhưng chưa có nhiều website đưa ra những bài học và hướng dẫn cho người dùng, nhất là đối tượng chưa có nhiều kinh nghiệm với thị trường chứng khoán. Cho nên đồ án lần này với mục tiêu đối tượng chính là cung cấp cho người dùng những kiến thức cơ bản lẫn nâng cao về thị trường chứng khoán. (ii) Hướng tiếp cận Xây dựng hệ thống website cho người dùng cuối tiếp cận đến những bài học, bài viết, khoá học và giúp họ theo dõi, phân tích số liệu tăng giảm của các mã chứng khoán trên thị trường cũng với những thông tin cần thiết. (iii) Tổng quan giải pháp (a) Về phía backend Sử dụng Nodejs với framework express để xử lý các yêu cầu qua RESTful API. Cơ sở dữ liệu sử dụng MySQL. Lấy dữ liệu chứng khoán thời gian thực qua dữ liệu trả phí do Công ty SSI (Công ty cổ phần chứng khoán SSI) cung cấp (b) Website cho người dùng cuối Sử dụng framework Reactjs (c) Website quản trị Sử dụng framework Reactjs (iv) Đóng góp chính Xây dựng và hoàn thiện backend, lấy và lưu dữ liệu chứng khoán từ bên thứ ba. Xây dựng website quản trị thông tin và quản lý người dùng. Xây dựng website iii", "label": "human"}
{"ID": "00440001", "file_name": "Xây dựng ứng dụng giao đồ ăn", "content": "Công việc kinh doanh buôn bán đã xuất hiện từ rất lâu đời; trải qua mỗi giai đoạn, nó mang một hình thức đặc thù riêng. Trước kia, khi các công cụ hỗ trợ chưa phát triển mạnh, thì việc trao đổi mua bán chỉ diễn ra dưới hình thức mua bán trực tiếp. Từ khi khoa học công nghệ phát triển, nó đã tạo ra các loại hình thức mua bán mới, điển hình là mua bán trực tuyến. Hình thức mua bán trực tuyến đó chính là mô hình thương mại điện tử hiện nay. Nó hỗ trợ đắc lực cho người kinh doanh tiếp xúc được với nhiều khách hàng, còn với khách hàng thì công việc mua bán được diễn ra nhanh chóng, thuận lợi, tiết kiệm thời gian. Với những lợi ích kể trên, thương mại điện tử trở thành một lĩnh vực rất được quan tâm và ngày càng quan trọng cho sự phát triển kinh tế. Sự bùng nổ thương mại điện tử cũng đã đi sâu vào lĩnh vực thức ăn, đồ uống. Hầu hết các giao dịch thương mại điện tử trong lĩnh vực thức ăn, đồ uống được thực hiện thông qua các thiết bị di động như điện thoại và máy tính bảng. Vì vậy, ĐATN này hướng tới xây dựng ứng dụng giao đồ ăn với mong muốn giúp khách hàng có thể trao đổi mua bán một cách dễ dàng, thuận tiện trong thời buổi các dịch bệnh có thể bùng lên như COVID-19.", "label": "human"}
{"ID": "00450001", "file_name": "Hệ thống đăng tin rao bán ô tô", "content": "Những năm gần đây nhu cầu mua sắm xe ô tô của người Việt trở nên rầm rộ hơn bao giờ hết, một phần vì do cơ chế mở cửa của nhà nước, một phần vì nhu cầu phục vụ của phương tiện này ngày càng lớn, có người mua xe để phục vụ đi lại, người mua xe phục vụ ngành vận tải, làm ăn, có người thì lại mua ô tô chỉ để thể hiện sự giàu có. . . . Thị trường mua bán ô tô trong nước đang được đánh giá là cực kì nhộn nhịp với nhiều phân khúc xe. Tuy nhiên không phải ai cũng có đủ điều kiện kinh tế để mua sắm xe mới và việc lựa chọn một chiếc xe cũ được cho là mang lại rất nhiều lợi ích. Trên mạng tin giao bán xe cũ nhận được rất nhiều sự quan tâm của khách hàng điều này dẫn đến nhu cầu đăng tin và tìm tin xe cũ sẽ ra tăng. Nắm bắt được hiện trạng đó em đã nghĩ ra ý tưởng thực hiện một website đăng tin bán xe cũ với hy vọng nó sẽ nhận được sự đón nhận từ người dùng. Việc xây dựng website được em tham khảo từ những website đã có sẵn trên mạng từ đó phát huy được điểm mạnh cũng như hạn chế của các trang web trước đó cũng như khắc phục nhược điểm còn tồn tại. Em mong đây sẽ là dự án có tính thực tế và thành công khi đưa vào sử dụng. Để xây dựng lên “website hệ thống đăng tin rao bán xe ô tô” em sử dụng ngôn ngữ C với công nghệ ASP.NET MVC cho xử lý phía backend và html/css, javascript, bootstrap cho phía giao diện website. Đây đều là những nền tảng xây dựng website cơ bản và phổ biến hiện nay.", "label": "human"}
{"ID": "00460001", "file_name": "Xây dựng web quản lý thông tin Đảng  viên Chi bộ xã Ngọc Lũ(H. Bình Lục,T. Hà Nam)", "content": "Bác Hồ nói: “Đảng mạnh là do mỗi một chi bộ mạnh. Chi bộ mạnh là do mỗi cá nhân đảng viên ra sức học tập, công tác làm trọn 10 nhiệm vụ đã ghi trong Điều lệ Đảng”. Do vậy, công tác quản lý đảng viên là một nhiệm vụ quan trọng của công tác tổ chức xây dựng đảng, góp phần nâng cao năng lực lãnh đạo, sức chiến đấu của tổ chức đảng. Tuy nhiên, nếu quản lý đảng viên thiếu chặt chẽ sẽ làm cho các nguyên tắc của Đảng thực hiện không nghiêm, năng lực lãnh đạo, sức chiến đấu của tổ chức đảng bị giảm sút, thậm chí còn mất vai trò lãnh đạo và sức chiến đấu của Đảng, làm giảm lòng tin của nhân dân đối với sự lãnh đạo của Đảng. Đặc biệt tại một số chi bộ thì công cụ để quản lý thông tin đảng viên hiệu quả lại càng khó khăn,bất cập,mặc dù đã được áp dụng nhiều với những phương pháp khác nhau nhưng hiệu quả chưa được như mong muốn.", "label": "human"}
{"ID": "00460002", "file_name": "Xây dựng web quản lý thông tin Đảng  viên Chi bộ xã Ngọc Lũ(H. Bình Lục,T. Hà Nam)", "content": "Là Đảng viên ĐCSVN trực thuộc Chi bộ xã Ngọc Lũ, huyện Bình Lục, tỉnh Hà Nam.Nhận thấy được những hạn chế đó, em quyết định xây dựng “Xây dựng web quản lý thông tin Đảng viên Chi bộ xã Ngọc Lũ(H. Bình Lục,T. Hà Nam)”. Để giải quyết được các vấn đề quản lý thông tin đảng viên, phần mềm của em sẽ cung cấp các chức năng để người dùng quản lý các thông tin về đảng viên trong chi bộ như thông tin cá nhân, chức vụ đảng, gửi và xem thông báo, . . .", "label": "human"}
{"ID": "00460003", "file_name": "Xây dựng web quản lý thông tin Đảng  viên Chi bộ xã Ngọc Lũ(H. Bình Lục,T. Hà Nam)", "content": "Hệ thống sẽ bao gồm các chức năng cần thiết như cho phép quản lý về thông tin cá nhân của đảng viên, quản lý thông tin về chức vụ của từng đảng viên trong chi bộ, quản lý tài khoản, quản lý thông báo,quản lý tin nhắn,.. . . Hệ thống này sẽ làm nền tảng cho em phát triển và hoàn thiện hơn trong tương lai góp phần nhỏ để thay đổi dần phương pháp quản lý cho Chi bộ Đảng tại quê hương em.", "label": "human"}
{"ID": "00470001", "file_name": "Web Chat Application", "content": "Hiện nay nhu cầu giao tiếp, chia sẻ thông tin trực tuyến thông qua các ứng dụng chat ngày càng tăng. Các ứng dụng chat cho phép mọi người chia sẻ nhiều loại dữ liệu thông qua internet. Điều này mang lại rất nhiều sự tiện lợi khi so với các kiểu giao tiếp truyền thống như gọi điện, nhắn tin. Chính vì vậy, đồ án hướng xây dựng một ứng dụng chat cho phép người dùng giao lưu kết bạn, tạo mối quan hệ và trao đổi nhiều loại thông tin như chữ, ảnh hay các loại tệp khác và cho phép người dùng có thể thực hiện các cuộc gọi video. Ứng dụng sẽ được triển khai trên nền tảng web, sử dụng WebSocket để nhắn tin trao đổi thời gian thực và sử dụng WebRTC để thực hiện các cuộc gọi video trực tuyến. Việc sử dụng nền tảng web mang lại sự dễ dàng tiếp cận với người dùng. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00480001", "file_name": "Xây dựng website bán hàng", "content": "Đồ án có mục tiêu là xây dựng một wesite bán quần áo cho phép người dùng dễ dàng truy cập, xem thông tin, tiến hành đặt mua và thanh toán trực tiếp trên website. Đồ án tập trung vào việc xây dựng giao diện người dùng thân thiện, giúp người dùng dễ dàng tìm kiếm và chọn mua các sản phẩm quần áo theo sở thích và nhu cầu của mình. Đồng thời hệ thống tích hợp tính năng đánh giá, cho phép người dùng đánh giá các sản phẩm mà họ đã mua. Điều này sẽ giúp người dùng có cái nhìn tổng quan về chất lượng và độ tin cậy của các sản phẩm trên website. Đánh giá từ người dùng sẽ giúp tăng tính minh bạch và đáng tin cậy trong quyết định mua hàng của các khách hàng khác. Website được phát triển dựa trên công nghệ Laravel là một Framwork của PHP. Code được triển khai theo mô hình cấu trúc MVC giúp hoạt động của dự án được chia thành các tầng - lớp để dễ dàng bảo trì - mở rộng. MVC chia code thành 3 phần: model triển khai các mô hình dữ liệu, truy caapj dữ liệu, view biểu diễn dữ liệu người dùng, controller nhận các yêu cầu browser gửi đến và trả về http response. Website đã đạt được những kết quả nhất định so với mục tiêu đặt ra. Xây dựng website bắt mắt giới thiệu các mẫu sản phẩm mới, dễ dàng tìm kiếm và xem chi tiết thông tin sản phẩm. Tích hợp thanh toán tực tuyến MoMo. UI, UX thân thiện người dùng, tương thích với nhiều trình duyệt web, máy tính hiện có.", "label": "human"}
{"ID": "00490001", "file_name": "Xây dựng nền tảng dữ liệu khách hàng - Phân hệ phân tích dữ liệu và ứng dụng", "content": "Hiện nay, với lượng truy cập lớn từ khách hàng, các nền tảng thương mại điện tử tích lũy được nhiều thông tin hữu ích về hành vi và tương tác của khách hàng. Để tận dụng được thông tin này, doanh nghiệp cần có một công cụ để xử lý, lưu trữ và phân loại dữ liệu khách hàng theo nhu cầu sử dụng. Việc nắm bắt được tâm lý, sở thích, nhu cầu của khách hàng sẽ giúp doanh nghiệp quảng cáo sản phẩm một cách hiệu quả hơn và phân phối sản phẩm đến đúng nhóm khách hàng cần thiết. Nhóm của chúng em đã đối mặt với thách thức nghiên cứu, triển khai và sử dụng các công nghệ tiên tiến để xây dựng nền tảng dữ liệu khách hàng (CDP). Hệ thống quan trọng này khai thác sức mạnh của công cụ theo dõi hành vi người dùng, Snowplow, và tích hợp các công nghệ dữ liệu lớn như Kafka, Elasticsearch, Hadoop và Spark. Đóng góp cá nhân của em vào dự án quan trọng này đã là việc xây dựng \"Phân hệ phân tích dữ liệu và ứng dụng\". Mục đích chính của nó là xây dựng hệ thống xử lý dữ liệu hành vi, trích xuất ra các thông tin phù hợp, từ đó thực hiện phân nhóm theo các phân khúc khách hàng theo mục đích doanh nghiệp. Nhờ vào khả năng tạo và lấy thông tin các phân khúc khách hàng theo nhu cầu, chúng em sẽ giúp doanh nghiệp có thể phân phối quảng cáo và sản phẩm đến đúng nhóm khách hàng cần thiết. Tóm lại, nền tảng dữ liệu khách hàng (CDP) và \"Phân hệ phân tích dữ liệu và ứng dụng\" đã tích hợp hình thành một tổ hợp mạnh mẽ giúp các doanh nghiệp có cái nhìn sâu sắc về khách hàng. Từ đó tạo ra các phân khúc khách hàng dựa trên mục đích sử dụng, giúp đảm bảo sự hiệu quả trong chiến lược tiếp thị của doanh nghiệp.", "label": "human"}
{"ID": "00500001", "file_name": "Ứng dụng dự đoán năng lượng điện gió", "content": "Năng lượng gió được coi là nguồn năng lượng xanh, sạch, dồi dào và phong phú nhất hiện nay, nó có mặt ở mọi nơi, cả ban ngày lẫn ban đêm. Nó được sử dụng từ hàng trăm năm nay. Con người đã sử dụng năng lượng gió để di chuyển thuyền buồm hay khinh khí cầu, ngoài ra năng lượng gió còn được sử dụng để tạo công cơ học nhờ vào các cối xay gió. Ý tưởng dùng năng lượng gió để sản xuất điện hình thành ngay sau khi phát minh ra điện và máy phát điện. Tuy vậy năng lượng gió không thể sản xuất được 1 cách nhất quán dẫn đến khả năng thay đổi cao. Sự biến đổi như vậy có thể gây ra những thách thức lớn đối với việc kết hợp năng lượng gió vào hệ thống lưới điện. Để duy trì sự cân bằng giữa sản xuất và tiêu thụ điện, sự biến động của năng lượng gió đòi hỏi phải thay thế điện từ các nguồn khác mà có thể không có sẵn trong thời gian ngắn.", "label": "human"}
{"ID": "00500002", "file_name": "Ứng dụng dự đoán năng lượng điện gió", "content": "Nắm bắt được điều đó, đồ án tốt nghiệp này hướng tới việc có thể ước lượng chính xác được nguồn cung cấp năng lượng gió trong 1 trang trại ở các quy mô thời gian khác nhau.", "label": "human"}
{"ID": "00510001", "file_name": "Ứng dụng quản lí đồ án trên nền tảng Android", "content": "Bộ não của con người không thể nhớ được được hết các công việc cần làm. Đấy là điều mà ai cũng từng mắc phải thế nhưng từ khi các phần mềm, ứng dụng quản lí công việc ra đời đã giúp người dùng tối ưu được hiệu suất làm việc, quản lí thời gian hiệu quả, hoàn thành công việc đúng thời hạn. Các ứng dụng này mang đến nhiều lợi ích thiết thực chính vì vậy em quyết định lựa chọn đề tài \"Quản lí đồ án trên nền tảng Android\" dựa trên các ứng dụng quản lí công việc phục vụ cho học tập. Ứng dụng quản lí đồ án được xây dựng nhằm mục đích giúp cho sinh viên, giảng viên có thể quản lí đồ án một cách hiệu quả, có thể lên danh sách các công việc cần thực hiện trong suốt quá trình làm đồ án, thông báo cho sinh viên biết các công việc sắp đến hạn để sinh viên có cách xử lí. Ngoài ra ứng dụng cũng có các tính năng tương tự tính năng của \"eHust\" như: sinh viên có thể xem các tin tức, thông báo đến từ trường, xem danh sách, thông tin chi tiết của các bạn trong lớp cũng như một bạn bất kì thông qua mã số sinh viên hay tên đầy đủ; xem lịch học, lịch gặp giáo viên hướng dẫn đồ án, tạo công việc; giảng viên cũng có thể tạo công việc cho sinh viên thực hiện, nhận được thông báo khi sinh viên cập nhật công việc, thống kê được số lượng đồ án đang hướng dẫn, tạo lịch gặp với sinh viên sau khi đã có sự thống nhất về thời gian với sinh viên đó; admin có thể phân công sinh viên cho giảng viên.", "label": "human"}
{"ID": "00520001", "file_name": "Hệ thống thu thập, phân tích và thống nhất dữ liệu người dùng", "content": "Trong thế giới hiện đại ngày nay chúng ta luôn tràn ngập trong 1 số lượng lớn các thông tin từ rất nhiều người khác nhau như tivi, máy tính, sách báo, truyền thông, người thân, bạn bè, .... John Naisbitt- nhà tương lai học đã từng nhận định rằng: Chúng ta chết đuối trong thông tin, nhưng chết đói về tri thức. Nhờ các phương tiện truyền thông, sự phát triển của công nghệ, hàng ngày chúng ta cập nhật rất nhiều thông tin khác nhau (thậm chí bị bão hòa thông tin) nhưng thường lại là thông tin bề nổi, mà thiếu sự hiểu sâu và bản chất vấn đề. Vì vậy mỗi người cần xác định đâu là thông tin hữu ích với mình và nên tiếp cận nó từ đâu. Và đối với các doanh nghiệp các marketer cũng vậy họ cùng cần biết đâu là thông tin hữu dụng với mình và đố là thông tin và người dùng. Mặc dù nghe có vẻ hiển nhiên, nhưng việc thấu hiểu khách hàng của bạn là ai,họ ở đâu, họ muốn gì và cách họ sử dụng sản phẩm của bạn là cực kì có giá trị khi nói đến việc mở rộng quy mô kinh doanh. Những thông tin chi tiết này có thể khó thu thập, nhưng cho phép bạn phân khúc khách hàng và cải thiện hiệu quả công ty một cách dễ dàng. Theo dõi siêu dữ liệu khách hàng giúp bạn xác định các cơ hội để cải thiện hiệu quả bán hàng, mở rộng doanh thu và tăng tỷ lệ giữ chân khách hàng. Với mong muốn giúp các doanh nghiệp hiểu rõ người dùng của họ hơn, đồ án tốt nghiệp của em tập trung vào việc xây dụng 1 hệ thống thu thập các dữ liệu của người dùng khi họ truy cập vào website của doanh nghiệp bằng trình duyệt. Các dữ liệu của người dùng sau khi được thu thập sẽ được biểu diễn bằng các biểu đồ, sơ đồ, bảng biểu trực quan dễ tương tác đem lại cho các doanh nghiệp 1 cách nhìn mới mẻ về người dùng của họ. Sau đó các doanh nghiệp có thể tiến hành thống nhất các dữ liệu đó và dữ liệu của chính hệ thống của mình để tạo ra 1 dữ liệu hoàn chỉnh thống nhất về từng người dùng. Sau khi đã có được cái nhìn sâu sắc về thông tin địa lý, hành vi, sở thích, thói quen của khách hàng các doanh nghiệp có thể tiến hành nâng cấp website tạo trải nghiệm tốt hơn cho người dùng. Không những vậy họ còn có thể tiến hành các chiến dịch marketing, quảng cáo nhằm vào 1 đối tượng khách hàng nhất định. Vì nắm rõ thông tin người dùng nên các chiến dịch đó sẽ đạt kết quả cao hơn và người dùng cũng cảm thấy vui vẻ khi nhận được các thông tin về sản phẩm mình yêu thích.", "label": "human"}
{"ID": "00530001", "file_name": "Xây dựng ứng dụng di động Wild Explorer hỗ trợ học sinh, sinh viên học tập và khám phá về các loài vật trong tự nhiên", "content": "Học tập và khám phá là một hành trình đầy thú vị đối với tất cả mọi người. Hiện nay với sự phát triển của thời đại công nghệ 4.0, nguồn kiến thức không chỉ gói gọn trong sách vở mà có thể dễ dàng để tiếp cận và trao đổi thông qua Internet. Nội dung đồ án tập trung vào việc xây dựng một ứng dụng di động cho phép học sinh tìm hiểu và khám phá các loài động thực vật trong tự nhiên. Qua tham khảo, các ứng dụng hiện nay đã đáp ứng được là nguồn cung cấp thông tin nhưng còn thiếu tính tương tác với người dùng. Về tính tương tác ví dụ như: Hệ thống Chatbot cho phép tương tác giữa người dùng và ứng dụng, Hệ thống phân loại ảnh khi người dùng vào một bức ảnh và nhận được kết quả là lớp tương ứng. Sản phẩm cuối cùng của đồ án là một ứng dụng di động cung cấp các chức năng chính như: cung cấp thông tin về các loài động thực vật, cung cấp các bài học và bài trắc nghiệm về các chủ đề tương ứng, cho phép sự tương tác giữa người dùng và hệ thống Chatbot, tích hợp mô hình phân loại ảnh.", "label": "human"}
{"ID": "00540001", "file_name": "Phân tích dữ liệu người dùng báo điện tử", "content": "Trong thời đại công nghệ thông tin và truyền thông phát triển mạnh mẽ, báo điện tử cũng đang phát triển vượt bậc. Với dịch vụ Internet tạo nên một mạng thông tin báo chí điện tử sôi động có sức thu hút hàng triệu lượt người truy cập hàng ngày, báo điện tử đã trở thành một kênh quảng cáo có quy mô khổng lồ. Để quảng cáo hiệu quả trên nền tảng báo điện tử cần có thông tin về người dùng. Nhật ký truy cập của người dùng là một nguồn dữ liệu quan trọng trong việc cung cấp thông tin đó. Nguồn dữ liệu này có kích thước lớn, đòi hỏi các nhà phân phối quảng cáo phải có một nền tảng lưu trữ và tính toán trên dữ liệu lớn cũng như biểu diễn dữ liệu tính toán được một cách trực quan. Để giải quyết vấn đề này, em đề xuất xây dựng một hệ thống lưu trữ-phân tích trực quan hóa dữ liệu sử dụng các công nghệ Hadoop, Spark, Google Data Studio. Hệ thống này có ưu điểm dễ dàng mở rộng quy mô, tạo ra báo cáo phân tích đẹp với nhiều tính năng nâng cao mà không cần bỏ quá nhiều công sức để xây dựng giao diện. Đồ án hướng tới tạo ra một mô hình hệ thống giải quyết bài toán phân tích dữ liệu người dùng nói riêng và phân tích dữ liệu lớn nói chung trong các doanh nghiệp.", "label": "human"}
{"ID": "00550001", "file_name": "Xây dựng ứng dụng điều khiển đa năng", "content": "Kể từ khi được phát minh vào những năm 50 và bắt đầu phát triển phổ biến từ những năm 70, các thiết bị điều khiển từ xa ngày nay đang hiện diện khắp nơi trong lĩnh vực điện điện tử nói riêng và trong đời sống sinh hoạt của con người nói chung, phổ biến nhất là những chiếc điều khiển tín hiệu hồng ngoại cho TV hay điều hòa nhiệt độ. Cùng với sự phát triển của các loại thiết bị công nghệ cũng như số lượng lớn các hãng sản xuất, việc mỗi nhà sở hữu nhiều chiếc điều khiển khác nhau cho nhiều loại thiết bị là tương đối phổ biến. Việc ghi nhớ, tìm kiếm hay đơn giản là thay pin cho các tiện ích này có thể trở nên bất tiện. Để cải thiện vấn đề này, các ý tưởng và giải pháp công nghệ đã được đưa ra, trong đó nổi bật nhất là cách tích hợp việc điều khiển hồng ngoại vào ứng dụng di động. Trong phạm vi đồ án này, tôi quyết định thực hiện xây dựng một Ứng dụng điều khiển đa năng cùng một thiết bị phần cứng thu phát hồng ngoại, với các chức năng cơ bản gồm gửi tín hiệu hồng ngoại theo khuôn dạng bản tin biết trước, học tập và lưu trữ các bản tin mới (của các loại điều khiển chưa biết), phân loại tín hiệu và thiết bị, cùng các ứng dụng tính năng như cài đặt phần cứng và hẹn giờ. Về tổng quan giải pháp, cần tìm hiểu về các loại thiết bị gia dụng khác nhau và phương thức điều khiển từ xa của chúng, từ đó đưa ra thiết kế các tính năng và chức năng cụ thể như gửi nhận tín hiệu hồng ngoại. Đồng thời cần xây dựng một cơ sở dữ liệu để lưu trữ các tín hiệu gia dụng phổ biến, tiện lợi cho người dùng sử dụng sẵn. Sau khi hoàn thành thiết kế xây dựng, các chức năng tiện ích như lập lịch, xây dựng kịch bản thông minh có thể được thêm vào ứng dụng. Kết quả đạt được của đồ án là đã xây dựng thành công một Ứng dụng và thiết bị thu phát cơ bản với các chức năng phát tín hiệu hồng ngoại, thu và học tập tín hiệu từ điều khiển sẵn có, có thể cài đặt thông qua ứng dụng di động và hẹn giờ đơn giản. Đây là một giải pháp giúp cải thiện chất lượng sinh hoạt trong gia đình.", "label": "human"}
{"ID": "00560001", "file_name": "Xây dựng và phát triển ứng dụng thương mại điện tử dựa trên nền tảng Magento", "content": "Hiện nay thị trường thương mại điện tử đang rất phát triển và đang trở thành một phần không thể thiếu trong cuộc sống của mọi người. Các nền tảng thương mại điện tử lớn như Amazon, Alibaba, eBay, v.v. và các nền tảng thương mại điện tử tại Việt Nam như Tiki, Shopee, Lazada đều đang tăng trưởng với tốc độ nhanh chóng. Một trong những xu hướng đang thịnh hành hiện nay trong thương mại điện tử là mua sắm trên thiết bị di động. Hơn nữa, Magento là một nền tảng được sử dụng để xây dựng các sàn thương mại điện tử, được sử dụng rộng rãi bởi các doanh nghiệp lớn trên toàn thế giới. Với tính năng tuỳ biến cao, tính năng quản lý đa cửa hàng và cộng đồng lớn thì Magento là một trong những nền tảng được ưa chuộng và tin dùng nhất hiện nay. Nhận thấy xu hướng đang thịnh hành hiện nay, em đã quyết định lựa chọn đề tài “Xây dựng và phát triển ứng dụng thương mại điện tử dựa trên nền tảng Magento” để làm đồ án tốt nghiệp. Công việc của em khi làm đề tài này là xây dựng và phát triển một ứng dụng di động được tích hợp với hệ thống Magento với đầy đủ các tính năng của một ứng dụng thương mại điện tử. Bên cạnh đó, là tích hợp thêm một số tính năng mới như là tích hợp cổng thanh toán trực tuyến, tích hợp hệ thống live chat và tính năng thống kê doanh thu cũng như số lượng sản phẩm đã bán được hay tồn kho. Kết quả của đồ án là một ứng dụng có thể chạy được trên cả Android và iOS, đã được publish lên google play. Ứng dụng đã đáp ứng đầy đủ các tính năng chính của một ứng dụng thương mại điện tử và đã tích hợp được cổng thanh toán trực tuyến, live chat và tính năng thống kê. Bên cạnh đó, ứng dụng cũng đáp ứng được một số yêu cầu phi chức năng về hiệu năng, tính dễ dùng và dễ bảo trì.", "label": "human"}
{"ID": "00570001", "file_name": "Hệ thống tuyển dụng điều dưỡng", "content": "Nhật Bản hiện nay là một trong những quốc gia có độ tuổi trung bình cao nhất trên thế giới và đang trong tình trạng già hóa dân số. Nhiều người cao tuổi ở Nhật Bản gặp khó khăn do tuổi cao sức yếu nên không thể tự chăm sóc bản thân trong sinh hoạt hàng ngày và cần phải có sự trợ giúp của những người khác, công việc trợ giúp người già như vậy được gọi là Hộ Lý hay Điều Dưỡng. Không chỉ ở Nhật Bản mà ở Việt Nam, theo thống kê, hiện nay tỷ lệ điều dưỡng trung bình trên 10.000 dân ở nước ta là 11,4%. So sánh với tỷ lệ trên thế giới thì con số này của Việt Nam là thấp hơn rất nhiều. Do đó, để đảm bảo đáp ứng một cách tốt nhất nhu cầu chăm sóc y tế cho người dân thì cần phải có thêm gấp 2-3 lần số lượng điều dưỡng viên so với hiện nay. Tuy nhiên, hiện nay có rất ít những trang chuyên tuyển dụng điều dưỡng viên, đa số đều là những trang web của các công ty mở ra để giới thiệu công việc cũng như tuyển người cho công ty mình. Trước thực trạng trên, em quyết định tạo một hệ thống tuyển dụng điều dưỡng , hệ thống sẽ là cầu nối giữa điều dưỡng viên và các bên có nhu cầu tuyển dụng điều dưỡng. Để xây dựng được hệ thống này, em đã khảo sát hiện trạng, so sánh các trang web tuyển dụng hiện nay, từ đó đưa ra các yêu cầu về chức năng và phi chức năng phù hợp, cần thiết để xây dựng một quy trình tuyển dụng điều dưỡng có thể đáp ứng được nhu cầu tuyển dụng của các nhà tuyển dụng, mong muốn tìm được việc làm phù hợp của các ứng viên. Bằng những kiến thức được học ở trường cùng với việc tự tìm hiểu thông tin trên Internet, em đã sử dụng mô hình MVC, Laravel Framework và hệ quản trị cơ sở dữ liệu MySQL để xây dựng hệ thống với đủ các yêu cầu đặt ra trước đó, sau đó đưa vào thực nghiệm và đánh giá.", "label": "human"}
{"ID": "00580001", "file_name": "Xây dựng hệ thống kết nối người mua và nhà sản xuất ngành nội thất DECORXINH", "content": "Một vài năm trở lại đây, decor (trang trí) nội thất nhà ở không còn quá xa lạ với mọi người, nhất là với giới trẻ bởi đây là xu hướng giúp ngôi nhà trở nên ấn tượng và đẹp mắt mà không phải bỏ ra quá nhiều chi phí. Việc này thúc đẩy ngành nội thất phát triển, cùng với sự bùng nổ của thương mại điện tử sau 2 năm đại dịch, nhu cầu mua sắm đồ nội thất online tăng cao. Chính mô hình thương mại điện tử đã đưa ngành đồ gỗ nội thất của Việt Nam vươn xa hơn. Tuy nhiên, hiện nay các sàn thương mại điện tử vẫn còn gặp 2 vấn đề về khâu vận chuyển (chi phí cao do chung sàn với các mặt hàng kích thước nhỏ) và về mẫu mã, kích thước cố định một vài mẫu, không đa dạng, tùy biến, trong khi phần lớn khách hàng nhu cầu đặt đồ nội thất phù hợp với ngôi nhà của mình. Vì vậy, em xây dựng Hệ thống kết nối người mua và nhà sản xuất DECORXINH, với mục tiêu kì vọng đây sẽ là trang thương mại điện tử dành riêng cho ngành nội thất. Hệ thống đã hoàn thành như một trang đăng thông tin để bên mua và bên bán có thể thấy được thông tin liên hệ của nhau, quảng bá tiếp cận nhu cầu về nội thất, chưa phát triển tính năng đặt hàng. Do thời gian làm Đồ án có hạn nên em chưa phát triển tính năng đặt hàng, trong tương lai em sẽ tiếp tục phát triển để hệ thống có thể đi vào thực tiễn.", "label": "human"}
{"ID": "00590001", "file_name": "Kiểm thử hướng ngữ cảnh áp dụng trong phát triển phần mềm linh hoạt sử dụng công cụ biểu đồ tư duy Xmind Zen", "content": "Hiện nay, các phương pháp phát triển phần mềm linh hoạt được sử dụng rộng rãi trong ngành phát triển phần mềm để đưa sản phẩm đến khách hàng một cách nhanh nhất. Một trong những giai đoạn quan trọng trong phát triển phần mềm là kiểm thử cũng được quan tâm. Vì vậy, việc xây dựng một phương pháp kiểm thử để tìm kiếm và đưa ra các lỗi phần mềm sao cho nhanh nhất là một điều cần thiết. Điều này giúp Agile cải thiện chất lượng sản phẩm sớm hơn và việc tìm kiếm và sửa lỗi cũng diễn ra nhanh hơn và giảm thiểu được nguy cơ tìm thấy lỗi ở giai đoạn cuối của quá trình phát triển phần mềm. Việc xây dựng phương pháp kiểm thử hướng ngữ cảnh trong phát triển phần mềm linh hoạt được đặt ra. Kiểm thử hướng ngữ cảnh là sự kết hợp giữa các kỹ năng, kỹ thuật và khả năng phán đoán phù hợp với bối cảnh, nó là một cách tiếp cận chứ không phải là một kỹ năng. Còn trong phát triển phần mềm linh hoạt giảm thiểu lãng phí, hạn chế tài liệu và đưa sản phẩm đến tay người dùng sớm. Vì vậy việc sử dụng công cụ biểu đồ tư duy Xmind Zen giúp phác thảo những yêu cầu người dùng và quản lý các công việc trong mỗi giai đoạn trong Agile. Cùng với đó, việc xây dựng ví dụ thử nghiệm phương pháp kiểm thử này, đưa ra các đánh giá về ưu điểm và nhược điểm của phương pháp.", "label": "human"}
{"ID": "00600001", "file_name": "Hệ thống quản lý và nghe nhạc trực tuyến", "content": "Hiện nay, ứng dụng công nghệ thông tin đang là vấn đề nóng của toàn thế giới. Không chỉ trong hoạt động khoa học kỹ thuật, lao động sản xuất mà đặc biệt trong lĩnh vực đào tạo giáo dục công nghệ thông tin cũng đã trở thành công cụ trợ giúp đắc lực. Mạng Royal Pingdom cho biết, với 24,3 triệu người sử dụng Internet trong số 89,6 triệu dân, Việt Nam đứng thứ 20 trong danh sách các nước trên thế giới có số người sử dụng Internet cao nhất. Trong đó có 76 phần trăm vào mạng để nghe nhạc trực tuyến. Nắm bắt được những cơ hội cung cấp các sản phẩm giải trí, em đã cho ra đời hệ thống nghe nhạc trực tuyến với mục đích đem lại cho người yêu âm nhạc những tác phẩm hay phù hợp với mọi đối tượng khách hàng. Những yếu tố thuận lợi bên trong và bên ngoài, cùng với tiềm năng phát triển thị trường giải trí trên website ở Việt Nam chính là cơ sở để tin rằng hệ thống sẽ trở thành website âm nhạc hàng đầu việt nam trong 5 năm tới.", "label": "human"}
{"ID": "00610001", "file_name": "Hệ thống quản lý dạy học và nhân sự cho Lớp học Cầu Vồng", "content": "Lớp học Cầu vồng là một tổ chức từ thiện phi lợi nhuận được thành lập nhằm tạo điều kiện giúp đỡ, động viên những mảnh đời kém may mắn về cả vật chất lẫn tình thương. Bên cạnh đó Lớp học tìm kiếm những bạn Tình nguyện viên hỗ trợ dạy học, giúp đỡ các em nhỏ có thêm cơ hội mở rộng cánh cửa tương lai. Hiện nay, Lớp học Cầu Vồng đang tổ chức các lớp học tình thương, giảng dạy trực tiếp cho các em tại các tỉnh thành như Hà Nội, Đà Nẵng và Lào Cai cùng nhiều lớp học trực tuyến khác. Với số lượng gần 200 tình nguyện viên đang tham gia giảng dạy cho nhiều trẻ em có hoàn cảnh khó khăn, việc quản lý lớp học và các buổi học cho các lớp cũng trở nên phức tạp bởi vì cách thức quản lý hiện nay của Lớp học Cầu Vồng chủ yếu là sử dụng các dịch vụ của Google hoặc liên lạc thông qua các trang mạng xã hội như Facebook, Zalo,. . . hoặc các phương tiện cá nhân, chưa có một hệ thống riêng đặc trưng phục vụ việc quản lý và liên lạc. Chính vì vậy, với mong muốn đóng góp một phần công sức giúp đỡ Lớp học Cầu Vồng có thể dễ dàng hơn trong việc quản lý dạy học và nhân sự, cũng là đóng góp một phần giúp cho tổ chức ngày càng thêm lớn mạnh, em đã có mong muốn phát triển một hệ thống quản lý dạy học và nhân sự dành riêng cho Lớp học Cầu Vồng, trước hết hướng tới đối tượng là người quản trị viên, các tình nguyện viên tham gia tổ chức, những đối tượng có hứng thú với Lớp học Cầu Vồng và có mong muốn trở thành Tình nguyện viên của tổ chức trên nền tảng Web. Hệ thống sẽ có các chức năng quản lý nhân sự, quản lý lớp và các bài học dựa theo đặc thù và các quy trình nghiệp vụ mà tổ chức đã quy định. Bên cạnh đó cải thiện và tự động hóa một số quy trình nghiệp vụ, giúp người sử dụng giảm bớt khối lượng công việc, tiết kiệm thời gian hơn để thực hiện các nghiệp vụ quản lý khác.", "label": "human"}
{"ID": "00620001", "file_name": "Quản lý công việc trong dự án", "content": "Dự án là một trong những thành phần quan trọng và thiết yếu nhất cho sự hình thành và phát triển của bất kỳ doanh nghiệp nào. Trước đây, việc quản lý dự án bị phụ thuộc nhiều vào các công cụ truyền thống như giấy tờ,sổ sách. Danh sách công việc và chi phí tính toán thường được kiểm soát bởi những phần mềm như Microsoft Excel1, Microsoft Project2, ... Ngày nay, làn sóng chuyển đổi số cho doanh nghiệp đang trở thành một xu hướng toàn cầu, việc sử dụng các ứng dụng web và mobile thay thế cho các phần mềm cần cài đặt trực tiếp dần trở nên phổ biến. Do đó, các công cụ quản lý dự án on dần trở nên nhiều hơn, thân thuộc hơn với người sử dụng. Hiện nay, trên thị trường đã có nhiều phần mềm giúp các doanh nghiệp có thể lập kế hoạch dự án, báo cáo kết quả thực hiện dự án như Zoho3, Wrike4, Asana5, . . . Các công cụ trên đã giúp người sử dụng trong việc quản lý tiến độ dự án. Tuy nhiên, vấn đề lập kế hoạch dự án tốt cần phụ thuộc vào kinh nghiệm ước lượng, khả năng tính toán của nhà quản lý để có thể cân bằng chi phí – thời gian sao cho hợp lý. Đồng thời, vấn đề quản lý, báo cáo, phân tích kết quả thực hiện của từng giai đoạn trong dự án và quản lý các cột mốc trong dự án thì mới chỉ có một số ít phần mềm chú trọng và đưa ra giải pháp xử lý. Cuối cùng, tối ưu hoá chi phí trong quá trình thoả hiệp thời gian – chi phí cũng là một tính năng mà các phần mềm trên chưa có hoặc chưa có giải pháp hợp lý. Hiểu được những hạn chế của những phần mềm quản lý dự án hiện nay ,ĐATN đã xây dựng phần mềm “Quản lý công việc trong dự án”.Phần mềm giúp người sử dụng tạo dự án, lập kế hoạch dự án, tạo các công việc, giai đoạn và cột mốc trong dự án, quản lý tiến độ, báo cáo tiến độ và kết quả theo dự án hoặc theo các giai đoạn trong dự án, đánh giá điểm số thành viên trong dự án và quản lý yêu cầu thay đổi phát sinh trong dự án. Phần mềm được tích hợp vào hệ thống “Không gian làm việc số” DXClan.com của công ty Cổ phần Công nghệ An toàn thông tin và Truyền thông Việt Nam VNIST. Các đóng góp chính trong ĐATN là (i) xây dựng và cài đặt chức năng tìm kiếm công việc hoặc dự án theo các đặc điểm của dự án hoặc công việc tương ứng; (ii) xây dựng chức năng quản lý các giai đoạn trong dự án; (iii) xây dựng báo cáo 1 truy cập lần cuối 02/01/2023 2 truy cập lần cuối 31/11/2022 3 truy cập lần cuối 11/07/2022 4 truy cập lần cuối 11/07/2022 5 truy cập lần cuối 12/07/2022 iii", "label": "human"}
{"ID": "00630001", "file_name": "Tìm hiểu và xây dựng game RPG sử dụng Unity engine", "content": "Các hình thức giải trí vẫn luôn là một phần không thể thiếu trong cuộc sống con người, đặc biệt là trong cuộc sống hiện đại nơi mà không gian hoạt động ngoài trời bị bó buộc lại để nhường chỗ cho các tòa nhà chọc trời. Từ đó kéo theo nhu cầu giải trí thuận tiện, không mất công đi lại ngày càng tăng. Ngành công nghiệp game vì vậy cũng bùng nổ theo do phù hợp với nhu cầu cùng với khả năng kết nối người chơi từ mọi lứa tuổi ở mọi nơi trên thế giới. Theo đó, các công cụ hỗ trợ cho việc phát triển game cũng ngày càng trở nên phổ biến, một trong số đó là các game engine và khi nhắc đến game engine không thể không nhắc đến Unity engine. Unity engine cung cấp cho các nhà phát triển game một môi trường làm việc thuận lợi cùng với thư viện asset khổng lồ và một cộng đồng thân thiện đã giúp cho việc phát triển một tựa game giờ đã không còn quá khó khăn với những người muốn theo đuổi công việc này. Vì vậy trong đồ án này, em sẽ sử dụng Unity engine để xây dựng lên một game thuộc thể loại nhập vai hành động (RPG) với góc nhìn từ trên xuống. Đồ án sẽ giúp người đọc có thêm thông tin về Unity engine cũng như các vấn đề và hướng giải quyết khi họ muốn phát triển một game RPG sử dụng engine này.", "label": "human"}
{"ID": "00640001", "file_name": "Xây dựng website xem phim trực tuyến bằng Laravel", "content": "Ngày nay nhu cầu giải trí của con người ngày càng cao, một trong số đó là xem phim. Khi mà TV dần ít được mọi người sử dụng, nhiều người ngại ra rạp xem phim không chỉ vì tốn kém chi phí, thời gian đi lại mà bởi vì họ thích sự riêng tư cho nên nhiều người đã lựa chọn xem phim trực tuyến. Phim trực tuyến giúp mọi người có thể xem bất cứ thể loại nào họ thích ở mọi lúc mọi nơi chỉ với thiết bị kết nối internet. Xuất phát từ nhu cầu thực tiễn đó, em đã khảo sát, phân tích, thiết kế và xây dựng một website xem phim trực tuyến bằng Frameworl Laravel. Dự án này giúp cho mọi người có thể xem đa dạng các thể loại phim, với chất lượng cao và đặc biệt là miễn phí. Và kết quả đạt được sau cùng là em đã hoàn thành được website xem phim không chỉ có giao diện bắt mắt mà còn tương đối đầy đủ tính năng và có tốc độ xử lý nhanh.", "label": "human"}
{"ID": "00650001", "file_name": "Học tự giám sát cho bài toán khoanh vùng đối tượng", "content": "Khoanh vùng đối tượng bất thường từ ảnh chụp là một yêu cầu quan trọng trong lĩnh vực y tế. Tuy nhiên, lượng dữ liệu y tế đã gán nhãn để huấn luyện các mô hình học sâu thường tương đối nhỏ, do dữ liệu liên quan đến thông tin cá nhân của bệnh nhân, hay việc gán nhãn yêu cầu chuyên gia có trình độ cao. Các mô hình trước đây yêu cầu một lượng lớn dữ liệu đã gán nhãn, gây tốn kém thời gian và công sức cho việc tạo dữ liệu. Trong những năm gần đây, mô hình Vision Transformer, với khả năng biểu diễn các đặc trưng ẩn và mối liên hệ giữa chúng, dần chứng minh được tính hữu ích của mình trong các tác vụ liên quan đến thị giác máy tính. Masked Autoencoder là một phương pháp ứng dụng Vision Transformer, giúp mô hình học tự học được các đặc trưng từ ảnh mà không cần sự can thiệp của con người. Ở đồ án này, em đã huấn luyện Masked Autoencoder để nhận diện được các đặc trưng từ ảnh nội soi trực tràng, từ đó tinh chỉnh mô hình trên tác vụ khoanh vùng polyp. Kết quả của đồ án đã chứng minh được tác dụng của phương pháp, đóng góp được một quy trình để huấn luyện mô hình với ít dữ liệu đã gán nhãn, góp phần giảm công sức cần bỏ ra để chuẩn bị dữ liệu. Từ khóa :Phân vùng ngữ nghĩa, Phân vùng polyp .", "label": "human"}
{"ID": "00660001", "file_name": "Hệ thống website quản lý nhà hàng Pizza", "content": "(i) Ngày nay, dưới sự phát triển vượt bậc của ngành Công nghệ thông tin nói chung và ngành Thương mại điện tử nói riêng, Internet đang ngày càng trở nên phổ biến và gần như không thể thiếu trong cuộc sống thường nhật. Công nghệ thông tin đang được phát triển và ứng dụng một cách vô cùng mạnh mẽ trong mọi ngóc ngách của cuộc sống, từ những lĩnh vực như quản lý, sản xuất, buôn bán, dịch vụ, hoặc các lĩnh vực khác. (ii) Quản lý dịch vụ nhà hàng nói chung là một trong những lĩnh vực được Công nghệ thông tin hỗ trợ rất nhiều. Việc phát triển và duy trì kinh doanh của một nhà hàng được phụ thuộc và rất nhiều yếu tố, bao gồm: Chất lượng món ăn, giải quyết các vấn đề tài chính, nhân sự, các chiến lược,. . . . Quan trọng hơn hết, đó chính là việc bán hàng. (iii) Để đáp ứng được nhu cầu về quản lý nêu trên, giải pháp tốt nhất chính là xây dựng một website có thể đáp ứng đầy đủ các yêu cầu về quản lý ở mọi cấp độ. (iv) Do đó, em đã quyết định lựa chọn đề tài “ Hệ thống website quản lý nhà hàng Pizza “ để tiến hành xây dựng và phát triển. Hệ thống sẽ được dựa trên công việc kinh doanh của nhà hàng, giúp nhà hàng thực hiện việc bán hàng đơn giản hơn, giảm thiểu những sai sót không đáng có. (v) Đồ án đưa vào chi tiết việc xây dựng một website có đầy đủ các chức năng cơ bản hỗ trợ việc bán hàng, cả on cả tại chỗ. Website sử dụng hệ thống bảo mật tài khoản của Google, với các chức năng phục vụ việc đăng nhập, đăng ký, quên mật khẩu. Hệ thống sẽ chia người dùng làm 3 đối tượng chính: Khách hàng, nhân viên và quản lý. Khách hàng có thể đặt hàng on, thực hiện các thao tác với giỏ hàng, đơn hàng. Nhân viên có thể đặt hàng tại chỗ, xác nhận các đơn hàng, quản lý chỗ ngồi. Đối với cấp độ quản lý, người quản lý có thể quản lý món ăn, người dùng.", "label": "human"}
{"ID": "00670001", "file_name": "DEducation - Nền tảng cập nhật và lưu trữ học bạ dựa trên công nghệ Blockchain", "content": "Hệ thống xác nhận dựa trên giấy tờ của ngày nay đã cho thấy một số những thiếu sót, chẳng hạn như văn bằng có thể dễ dàng bịa đặt. Vấn đề bằng cấp giả luôn được cảnh báo trên khắp thế giới, thậm chí với sự phát triển của Internet ngày nay, những tài liệu như vậy đang được quảng cáo công khai và khai thác trong lực lượng lao động. Nếu người sử dụng lao động nghi ngờ trình độ của người lao động, họ không thể tự xác minh bằng cấp của người lao động. Điều này chỉ có thể được thực hiện bằng cách yêu cầu cơ quan cấp hồ sơ và thông thường phải mất vài ngày mới có kết quả. Ngoài ra, việc sử dụng chứng thư giấy còn đặt ra trách nhiệm bảo quản cẩn thận cho người cầm chứng. Trong đồ án này, chúng ta tập trung vào việc tạo ra các tài liệu kỹ thuật số để thay thế các tài liệu giấy thông thường hiện tại nhằm loại bỏ bằng cấp giả và thông tin đăng nhập kỹ thuật số sẽ được cấp bằng cách sử dụng công nghệ Blockchain. Sinh viên sẽ nhận được chứng chỉ kỹ thuật số cho mỗi khóa học họ đã hoàn thành tại trường đại học và bằng tốt nghiệp kỹ thuật số được trao cho sinh viên khi họ hoàn thành chương trình của mình. Các tài liệu kĩ thuật số sẽ được đưa vào chuỗi khối - một nơi an toàn và không thể sửa đổi. Ngoài ra, việc thay thế văn bằng trên giấy bằng phiên bản kỹ thuật số cũng cho phép xác minh liên tục. Điều này sẽ giúp sinh viên và nhà tuyển dụng có thể chứng minh tính xác thực của các giấy tờ mà không cần gặp cán bộ của trường, gây tốn kém thời gian và công sức của cả hai bên. DEducation cung cấp cho chủ sở hữu khả năng sở hữu và chia sẻ tài liệu kỹ thuật số của họ một cách dễ dàng. Ngoài ra, hệ thống cũng cho phép sinh viên quyết định cách họ muốn chia sẻ bảng điểm học tập của mình với nhà tuyển dụng. Bảng điểm bao gồm thông tin về các khóa học đã hoàn thành của sinh viên với chứng chỉ kỹ thuật số đính kèm và cả bằng đại học kỹ thuật số của họ. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00680001", "file_name": "Xây Dựng Website Quản Lý Và Chia Sẻ Công Thức Món Ăn", "content": "Ngày nay, khi mọi người cần tìm hoặc muốn chia sẻ công thức nấu ăn, họ có xu hướng sử dụng Google hoặc các nền tảng truyền thông khác, nhưng kết quả quá đa dạng và khó theo dõi vì ước tính hoặc bước không rõ ràng.Để đáp ứng nhu cầu đó Website quản lý và chia sẻ công thức món ăn là một ứng dụng web giúp mọi người tìm thấy công thức nấu ăn yêu thích của họ theo vùng miền và thể loại món ăn với các bước cụ thể, độ khó, ước tính thời gian và thành phần để nấu một món ăn ngon và giúp họ quản lý công thức món ăn yêu thích của riêng họ ở một nơi.", "label": "human"}
{"ID": "00690001", "file_name": "Xây dựng trang web quản lý đặt phòng giữa chủ nhà và môi giới", "content": "Trong năm 2020 và năm 2021, khi đại dịch COVID-19 hoành hành khắp thế giới, công nghệ đã liên tục được phát triển và sử dụng triệt để, hỗ trợ nâng đỡ cho nền kinh tế bị ảnh hưởng nặng nề. Trong nửa đầu năm 2022, nền kinh tế Việt Nam đã phục hồi với tín hiệu rất tích cực, đặc biệt là trong ngành dịch vụ, du lịch. Sự giúp ích của công nghệ không thể không kể tới những ứng dụng đặt phòng khách sạn, căn hộ như Booking, Airbnb, Agoda, . . . Việc tăng trưởng ngành du lịch cũng dẫn tới sự xuất hiện của những người tư vấn đặt phòng, hay còn gọi là môi giới, họ có khả năng hướng dẫn và chăm sóc khách hàng tốt hơn so với ứng dụng với những chức năng cố định, và hầu hết, họ tương tác với các chủ nhà cho thuê bằng những phương tiện thủ công như email, tin nhắn, cuộc gọi, . . . Vì vậy, em xin chọn xây dựng trang web Quản lý đặt phòng cho đại lý với hy vọng có thể tự động hóa một phần công việc giữa môi giới – chủ nhà. Việc xây dụng dự án trên nền tảng web khiến dự án này có thể được sử dụng trên nhiều nền tảng, trên cả máy tính và các loại điện thoại thông minh. Để đảm bảo hiệu quả cao nhưng vẫn giữ được mã nguồn đơn giản, em đã chọn Framework Laravel để xây dựng trang web này. Trong khuôn khổ đồ án, em đã xây dựng được những chức năng cơ bản trong nghiệp vụ đặt phòng khách sạn/căn hộ cũng như tìm hiểu được cách tạo nên một trang web hoàn chỉnh.", "label": "human"}
{"ID": "00700001", "file_name": "Nghiên cứu và xây dựng ứng dụng hỗ trợ điều khiển camera bằn", "content": "Cùng với sự phát triển của khoa học và kỹ thuật, việc ứng dụng thị giác máy tính vào camera để hỗ trợ con người ngày càng phổ biến. Những chiếc camera có chức năng thông minh có thể giúp con người rất nhiều việc như tự động quản lý an ninh, hỗ trợ giám sát giao thông công cộng. Để giúp quản lý camera, một hệ thống giúp con người điều khiển chức năng của các camera này là cần thiết. Trên thế giới cũng đã có những dịch vụ hỗ trợ người dùng có thể thao tác với máy tính và điện thoại để điều khiển các chức năng của camera. Tuy nhiên trong thực tế, không phải mọi lúc có thể sở hữu và sử dụng máy tính hoặc điện thoại. Hơn nữa, đôi khi camera được đặt ở những nơi quá cao hoặc quá hẹp, sẽ khó thao tác bằng bàn phím hay chuột khi muốn điều khiển camera. Đối với người ít tiếp xúc với công nghệ, việc sử dụng máy tính hoặc điện thoại cũng gặp những khó khăn nhất định. Để giải quyết vấn đề trên, tôi đề xuất giải pháp sử dụng mô hình thị giác máy tính giúp camera có nhận diện được chỉ tay của con người, từ đó sử dụng cử chỉ tay để điều khiển các chức năng camera. Kết thúc đồ án, tôi đã xây dựng được một ứng dụng có thể điều khiển các chức năng của camera bằng chỉ tay. Không những có thể điều khiển trên máy tính thông thường, người dùng còn có thể điều khiển bằng cử chỉ tay thông qua một thiết bị tiêu tốn ít tài nguyên Jetson Nano.", "label": "human"}
{"ID": "00710001", "file_name": "Nghiên cứu và đề xuất mô hình học liên kết hướng người dùng", "content": "Cách mạng công nghiệp lần thứ tư đem lại nhiều thay đổi lớn đối với nhân loại, đó là sự phổ biến của Internet kết nối vạn vật (IoT), dữ liệu lớn (BigData) và trí tuệ nhân tạo (AI). Các thiết bị di động với khả năng tính toán tương đối tốt ngày một phổ biến. Dữ liệu gia tăng với tốc độ hàm mũ, được lưu trữ, số hóa và trở thành tài nguyên phát triển các mô hình học máy, học sâu của trí tuệ nhân tạo. Việc huấn luyện các mô hình học sâu thông thường cần yêu cầu tập hợp dữ liệu lại trên cùng một thiết bị. Tuy nhiên, bên cạnh các nguồn dữ liệu mở, dữ liệu mang tính cá nhân, bảo mật chiếm đa số. Học liên kết (federated learning) ra đời như một giải pháp xây dựng mô hình học sâu từ nhiều thiết bị riêng biệt với bộ dữ liệu độc lập để đảm bảo hiệu quả tốt trên tập dữ liệu kiểm thử. Học liên kết hướng người dùng (personalized federated learning) là một ngữ cảnh khác khi mà mỗi thiết bị tham gia có một tập dữ liệu kiểm thử riêng bên cạnh việc có một tập dữ liệu huấn luyện riêng. Mục tiêu khi này là xây dựng cho mỗi thiết bị một mô hình riêng đạt hiệu quả cao trên bộ dữ liệu kiểm thử của chính nó. Trong những nghiên cứu gần đây về bài toán này, có một nghiên cứu mới nổi là Personalized Federated Learning through Local Memorization đem lại hiệu quả tốt dựa trên kỹ thuật tương đối đơn giản đó là sử dụng kết hợp mô hình huấn luyện chung giữa các thiết bị với thuật toán Kláng giềng gần nhất ( KNN)khi thực hiện dự đoán. Trong đồ án này, em đề xuất phương pháp huấn luyện sử dụng học đối lập (contrastive learning) khi huấn luyện mô hình nhằm cải thiện hiệu quả của phương pháp KNN, qua đó nâng cao hiệu quả của phương pháp trên.", "label": "human"}
{"ID": "00720001", "file_name": "Ứng dụng công nghệ Thực tế tăng cường xây dựng hệ thống bán hàng nội thất", "content": "Trong khoảng 10 năm trở lại đây, cùng với sự phát triển về kinh tế và xã hội. Hàng loạt các toà nhà cao tầng và các căn hộ kiểu mới mọc lên trên toàn quốc. Cùng với xu hướng dần dần chuyển từ những món đồ nội thất bền bỉ bằng gỗ tự nhiên sang những món đồ nội thất bằng các nguyên liệu công nghiệp có kiểu dáng đơn giản, hiện tại, các mẫu sản phẩm được cập nhật định kì, thay đổi về công năng và thiết kế. Chính những lý do đó dẫn tới chu kì thay thế những món đồ nội thất ngày một rút ngắn. Vì vậy, nhu cầu về đồ nội thất ngày một nhiều, chưa kể đến đây cũng là một trong những loại hàng thiết yếu trong mỗi gia đình, cơ quan. Tuy nhiên, để có thể yên tâm mua sắm những sản phẩm nội thất, người mua hàng thường có thói quen ghé qua trực tiếp cửa hàng hoặc nhờ một đơn vị sản xuất đến nhà để đo đạc rồi mới thiết kế và thi công sản phẩm. Nhưng, đôi khi sau khi có sản phẩm và đặt vào không gian thực tế, người tiêu dùng có thể sẽ không cảm thấy phù hợp do không tương thích với ánh sáng và các đồ vật khác trong nhà. Chính vì vậy, việc ứng dụng công nghệ thực tế tăng cường giúp người mua hàng có thể xem trực tiếp được không gian thực tế sau khi đặt các món đồ nội thất sẽ như thế nào. Hiện tại đã có một số ứng dụng của các hệ thống chuyên kinh doanh đồ nội thất trên thế giới (điển hình là IKEA) đã phát triển tính năng xem thực tế tăng cường cho các sản phẩm đồ nội thất, gia dụng. Tuy nhiên, các ứng dụng này chỉ khả dụng tại một số quốc gia. Chính vì vậy, hiện tại ở Việt Nam chưa có bất kì hệ thống nào tương tự có thể sử dụng được. Để xây dựng nên hệ thống này, ta cần tạo ra 3 thành phần chính. Đầu tiên là một server để sử dụng các thao tác: lưu trữ dữ liệu, kết nối với hệ quản trị cơ sở dữ liệu, thực hiện các truy vấn từ client. Tiếp theo, ta cần một ứng dụng di động trên nền tảng Android và iOS phục vụ việc người dùng mua sắm và quan sát thực tế tăng cường. Cuối cùng, ta cần một trang web phục vụ quản trị viên và người bán hàng, với mục đích quản lý người dùng, sản phẩm và đơn hàng. Kết quả sau khi thực hiện: hệ thống đã được xây dựng với đầy đủ 3 thành phần đã nêu bên trên, đã có thể hoạt động ổn định. Chỉ cần chỉnh sửa thêm một ít về giao diện, bổ xung chi tiết về nội dung là có thể đưa vào sử dụng thực tế.", "label": "human"}
{"ID": "00730001", "file_name": "Nền tảng dữ liệu chứng khoán Việt Nam Phân hệ quản lý và lập lịch trình tính toán chỉ báo", "content": "Thị trường chứng khoán Việt Nam trong những năm trở lại đây chứng kiến một giai đoạn phát triển nhanh chóng với xu hướng đầu tư cá nhân tăng mạnh; từ đó đặt ra yêu cầu từ về những nền tảng ứng dụng theo dõi dữ liệu biến động của thị trường chứng khoán. Hiện nay ở Việt Nam có thể dễ dàng tiếp cận với các ứng dụng như vậy với máy tính và điện thoại thông minh. Những ứng dụng này cung cấp những chức năng cần thiết để người dùng theo dõi thị trường với giao diện dễ sử dụng, bảng biểu, sơ đồ dữ liệu được cập nhật theo thời gian thực. Bên cạnh những ưu điểm nêu trên, các nền tảng này vẫn còn những hạn chế về dữ liệu của các chỉ báo chứng khoán. Chúng chủ yếu cung cấp những chỉ báo cơ bản, người dùng không thể thêm mới hay tùy biến những chỉ báo theo công thức của riêng mình. Trước thực tế này, nhóm chúng tôi đã quyết định thực hiện xây dựng \"Nền tảng dữ liệu thị trường chứng khoán Việt Nam\" với chức năng cập nhật dữ liệu giao dịch thị trường, tính toán chỉ báo chứng khoán, cung cấp giao diện website để người dùng có thể tạo mới và chỉnh sửa các chỉ báo theo nhu cầu cá nhân của người sử dụng. Trong khuôn khổ ĐATN này, mục tiêu của tôi là xây dựng \"Phân hệ quản lý và lập lịch trình tính toán chỉ báo\", đóng vai trò xử lý và tính toán dữ liệu chỉ báo của thị trường chứng khoán. Sau quá trình nghiên cứu, tìm hiểu và triển khai, tôi đã xây dựng được phân hệ gồm các trình tính toán được quản lý và lập lịch tự động với ngôn ngữ lập trình Python  và công nghệ lập lịch Apache Airflow , từ đó đóng góp vào hoàn thiện sản phẩm nền tảng dữ liệu của cả nhóm.", "label": "human"}
{"ID": "00740001", "file_name": "Phần mềm nhắn tin, gọi điện video trực tuyến", "content": "Được truyền cảm hứng từ các ứng dụng nhắn tin trực tuyến hiện đang có như Messenger, Zalo, Telegram cùng với việc công ty em đang làm mong muốn có một ứng dụng nhắn tin dành riêng cho tập đoàn, em muốn tạo một ứng dụng nhắn tin cho cá nhân mình và những đồng nghiệp trong công ty cùng sử dụng. Do đó em đánh giá ứng dụng này sẽ mang đến nhiều lợi ích thiết thực, chính vì vậy em quyết định lựa chọn đề tài \"Phần mềm nhắn tin, gọi điện video trực tuyến\" xây dựng trên nền tảng iOS. Phần mềm nhắn tin, gọi điện video trực tuyến được xây dựng với mục tiêu là phần mềm mã nguồn mở, nhằm mục đích giúp cho các doanh nghiệp, các tổ chức không tin cậy việc trao đổi thông tin liên quan đến doanh nghiệp, tổ chức trên phần mềm của bên thứ ba, có thể tự khai thác mã nguồn và triển khai một ứng dụng nhắn tin, gọi điện video trực tuyến riêng cho cá nhân tổ chức, doanh nghiệp. Người sử dụng ứng dụng có thể nhìn thấy những người dùng khác, tạo một phòng trò chuyện với người dùng họ muốn. Một phòng trò chuyện có thể có nhiều thành viên ở trong đó, người dùng có thể gửi ảnh, video trong phòng trò chuyện. Tính năng gọi điện video trực tuyến khả dụng trong những phòng trò chuyện chỉ có 2 thành viên. Ngoài ra mỗi người dùng có một trang cá nhân cho riêng bản thân, giúp cho mọi người dùng đều có khả năng nắm rõ thông tin của nhau như chức vụ, vị trí, tuổi tác,.. Người dùng có thể cập nhật thông tin trên trang cá nhân của bản thân cũng như ảnh đại diện của họ.", "label": "human"}
{"ID": "00750001", "file_name": "Xây dựng cộng đồng thương hiệu thông qua forum cho nền tảng Magento", "content": "Thương mại điện tử (E-commerce) là hình thức kinh doanh ngày càng phát triển trên môi trường Internet. Trong kỷ nguyên kỹ thuật số ngày nay, lòng tin của khách hàng ngày càng có sức ảnh hưởng lớn tới việc kinh doanh trực tuyến, do đó việc xây dựng thương hiệu vững chắc từng ngày, trên cơ sở lòng tin của khách hàng là rất quan trọng. Xây dựng cộng đồng thương hiệu (CĐTH) là một chiến lược marketing giải quyết vấn đề trên và được dự đoán là lĩnh vực tăng trưởng và được đầu tư lớn nhất trong thập kỷ tới của ngành thương mại điện tử. Magento là một nền tảng mã nguồn mở, cung cấp các tính năng và công cụ để xây dựng và quản lý các trang web bán hàng trực tuyến hiệu quả. Đây là một trong những nền tảng thương mại điện tử phổ biến nhất trên thế giới và được tin dùng bởi các doanh nghiệp lớn. Điểm mạnh của Magento là tính linh hoạt và tùy biến cao, nó cho phép các nhà phát triển tùy chỉnh các tính năng của trang web bán hàng trực tuyến và mở rộng chức năng của nền tảng theo nhu cầu kinh doanh của từng doanh nghiệp hoặc người sử dụng. Magento được hỗ trợ bởi một cộng đồng phát triển mạnh mẽ, với hàng ngàn module và theme được phát triển bởi cộng đồng và các nhà phát triển chuyên nghiệp. Tuy nhiên, hiện nay nền tảng này lại chưa có module giúp doanh nghiệp xây dựng và phát triển cộng đồng thương hiệu trực tuyến. Nhận thức được các vấn đề trên, em lựa chọn phát triển module Community cho nền tảng Magento. Module này sẽ tích hợp vào cửa hàng trực tuyến Magento một forum, nơi mà khách hàng có thể cùng nhau đặt câu hỏi, chia sẻ về bản thân, trao đổi kinh nghiệm khi dùng thử các sản phẩm, cũng như kết nối với những khách hàng khác. Người dùng có thể tìm kiếm, đọc các bài viết trong cộng đồng. Hội viên có thể tạo bài viết, đăng ảnh hay để lại bình luận. Ngoài ra các hội viên còn có thể đánh dấu các cuộc thảo luận yêu thích và nhận thông báo khi có bài viết mới. Đặc biệt hơn, với mỗi bài đăng hay lượt tương tác các hội viên còn nhận được điểm để tạo nên thứ hạng của họ trong cộng đồng. Quản trị viên có thể tạo những mã giảm giá dựa trên thứ hạng của hội viên trong cộng đồng Trong khuân khổ ĐATN, em hi vọng sản phẩm của mình có thể thành một lựa chọn khi các doanh nghiệp thực hiện xây dựng CĐTH trực tuyến. Từ đó giúp doanh nghiệp phát triển kinh doanh trực tuyến mạnh mẽ hơn.", "label": "human"}
{"ID": "00760001", "file_name": "Giải pháp tìm đường cho AGV trong môi trường bệnh viện dựa trên đồ thị quyết định", "content": "Các thiết bị AGV (Automated Guided Vehicle) mang lại nhiều lợi ích to lớn khi được sử dụng để vận chuyển hàng hóa trong môi trường có con người. Tuy nhiên, việc người và AGV cùng di chuyển với nhau đặt ra nhiều bài toán khó cho hệ thống điều khiển trong việc định tuyến AGV. Một trong số đó là bài toán định tuyến AGV đến điểm gửi/nhận hàng trong thời gian quy định, đồng thời tránh lạm dụng chế độ khẩn cấp của AGV để giảm thiểu sự phiền toái mà chúng gây ra cho con người. Nhiều giải pháp đã được đề xuất để giải quyết vấn đề này. Một số giải pháp dựa vào việc dự đoán tình trạng giao thông để tìm các đường đi ít tắc nghẽn nhất, nhưng chúng không đảm bảo AGV đến đích đúng khoảng thời gian quy định. Một số giải pháp khác khác thì mô hình hóa sự bất ổn bằng mô hình toán học và sử dụng thuật toán heuristic để định tuyến AGV đúng thời gian quy định, nhưng chúng lại không dự đoán được biến đổi tình trạng giao thông theo thời gian. Một hướng tiếp cận triển vọng để khắc phục những hạn chế trên là xây dựng một hệ thống điều khiển trung tâm cho AGV. Hệ thống này giúp định tuyến AGV đến nơi đúng khoảng thời gian quy định (ngay cả trong môi trường biến động) và có khả năng xử lý, chọn lựa chế độ hoạt động phù hợp cho AGV. Với cách tiếp cận này, ta cần xây dựng một đồ thị quyết định để phản ánh cấu trúc liên kết giao thông và tình trạng giao thông theo thời gian thực. Đồ thị này cũng cho phép hệ thống điều khiển trung tâm quyết định AGV nào sẽ hoạt động ở chế độ khẩn cấp. Trên đồ thị này, thuật toán tìm đường đi ngắn nhất (được sửa đổi) được triển khai giúp tìm ra đường đi tốt nhất để AGV phân phối hàng hóa đúng thời gian quy định và giảm thiểu sự phiền toái gây ra cho con người. Giải pháp theo hướng này cũng đã được cài đặt và so sánh với các giải pháp định tuyến điển hình. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00770001", "file_name": "Ứng dụng NFT vào game Flappy Bird", "content": "Hiện nay, công nghệ blockchain trở thành xu hướng của toàn cầu và cơn sốt mang tên game NFT nổi lên trong giới đầu tư tiền ảo. Game NFT là dòng game được xây dựng và phát triển trên nền tảng công nghệ blockchain token hóa tài sản trong game. Mỗi game sử dụng đồng tiền điện tử riêng và chúng có thể quy đổi thành tiền thật thông qua sàn giao dịch điện tử. Thể loại game này cho phép người chơi có thu nhập thực tế dưới dạng non-fungible token (NFT). Token trong NFT game có tác dụng mua bán vật phẩm game, staking vật phẩm/token thưởng, nâng cấp trải nghiệm game, cùng nhiều tiện ích khác. Nguyên nhân quan trọng nhất làm cho game NFT phát triển là do ảnh hưởng của COVID-19, hàng triệu người thất nghiệp, và chuyển sang hình thức kiếm tiền on. Game play-to-earn đáp ứng được nhu cầu này, hình thức vừa chơi vừa kiếm tiền đang được rất nhiều người trên thế giới quan tâm. Nắm bắt xu hướng toàn cầu, đồ án tốt nghiệp này hướng tới xây dựng một ứng dụng game NFT với kịch bản là Flappy bird quen thuộc. Mục đích của đồ án nhằm nghiên cứu cách module hóa cho game NFT và nghiên cứu nền kinh tế thị trường của game. Tạo cơ sở cho việc về sau phát triển những tựa game lôi cuốn, trải nghiệm thú vị để có thể thu hút được cộng đồng game thủ toàn cầu.", "label": "human"}
{"ID": "00780001", "file_name": "Nâng cao chất lượng báo cáo khoa học dựa trên sửa lỗi chính tả", "content": "Trong thời đại mà công nghệ trở nên phổ biến, xã hội ngày càng phát triển, ở tất cả mọi lĩnh vực người ta đều hướng đến những điều chỉn chu và tốt đẹp nhất. Mà thứ cần chỉn chu nhất có lẽ chính là các văn bản, bài báo. Dù một văn bản trình bày đẹp, bố cục rõ ràng nhưng sai chính tả thì sẽ làm cho người đọc khó nắm bắt được ý trong văn bản. Đặc biệt, đối với những báo cáo khoa học hay bài báo khoa học thì việc sai chính tả khiến cho bài báo hay báo cáo đó trở nên khó hiểu và giảm bớt tính chuyên nghiệp. Vậy làm sao để mọi người có thể phát hiện và sửa những lỗi sai chính tả trong các văn bản - đặc biệt là trong các bài báo, báo cáo khoa học - một cách nhanh chóng và chính xác. Xuất phát từ vấn đề trên, nhiệm vụ của đồ án tốt nghiệp (ĐATN) này là phát triển mô đun phát hiện lỗi sai và mô đun sửa lỗi sai. Bên cạnh đó ĐATN còn phát triển và xây dựng một hệ thống web sẽ tích hợp với hệ thống Coopy của trường Công Nghệ Thông Tin và Truyền Thông thuộc trường Đại học Bách Khoa Hà Nội. Hai mô đun trên sẽ được tích hợp trong hệ thống web phát hiện và sửa lỗi chính tả giúp cho sinh viên có thể kiểm tra chính tả và sửa lỗi chính tả trên những báo cáo khoa học. Đồng thời, cải thiện lại giao diện của mô đun kiểm tra sao chép trên hệ thống Coopy của trường. Để làm được điều đó, trước tiên ĐATN tiếp cận bài toán phát hiện lỗi sai, tiếp theo ĐATN sẽ tiếp cận bài toán sửa lỗi sai. Trong quá trình làm ĐATN, em đã nghiên cứu và thực nghiệm hai mô đun: mô đun phát hiện lỗi sai sử dụng transformer và mô đun sửa lỗi sai sử dụng kết hợp giữa 3 phương pháp là mô hình N-gram, mô hình huấn luyện trước BartPho và tập luật . Trong đó mô đun phát hiện lỗi sai đạt 97.30% trên bộ dữ liệu phoBert và bộ dữ liệu được trích xuất ra từ các file đồ án, còn mô đun sửa lỗi sai đạt 93.55% trên bộ dữ liệu phoBert. Đồng thời, ĐATN sẽ phát triển hệ thống website phát hiện và chỉnh sửa lỗi chính tả sử dụng công nghệ ReactJS, Flask, Firebase và cải thiện giao diện của phần mềm kiểm tra trùng lặp trên hệ thông Coopy sử dụng ReactJS.", "label": "human"}
{"ID": "00790001", "file_name": "App đăng tin rao vặt kết nối người mua và người bán", "content": "Trong cuộc sống hiện nay, nhu cầu mua bán các mặt hàng , sản phẩm cả cũ và mới đều rất lớn. Mọi người có nhiều sản phẩm không còn dùng đến, có thể là đồ cũ cần bán nhưng lại không tìm được đối tượng mua. và cũng có nhiều trường hợp, những người mua có nhu cầu mua những sản phẩm đấy, với mức giá rẻ hơn các sản phẩm mới trên thị trường. Đặc biệt trong thời gian hiện nay, sau đại dịch COVID , khả năng tài chính của người mua còn hạn hẹp. Vì vậy, việc kết nối các nhu cầu giữa người mua và người bán là sẽ đảm bảo thoả mãn nhu cầu giữa hai bên. Hiện tại trên thị trường có rất nhiều app về đăng tin rao vặt, nhưng hiện tại chưa tập trung vào vấn đề là hướng đến người dùng là sinh viên với nhiều sản phẩm riêng biệt như giáo trình học tập, ... Để giải quyết vấn đề này, em đã đề xuất xây dựng hệ thông đăng tin rao vặt kết nối người mua và người bán. Em tập trung xây dựng app trên thiết bị di động và hệ thống server. Kết quả mong muốn của đồ án là một hệ thống với ứng dụng di động có thể giải quyết được vấn đề ở trên. Sau cùng Kết quả đạt được đó là ứng dụng đáp ứng đầy đủ các tiêu chí chức năng và phi chức năng đề ra. Đồng thời , ứng dụng có khả năng mở rộng, bảo trì trong tương lai.", "label": "human"}
{"ID": "00800001", "file_name": "Xây dựng trò chơi roguelike qua màn Simple Rogue", "content": "Thể loại game roguelike đang phát triển mạnh trong thời gian gần đây, chúng đưa cho người chơi những sự lựa chọn khác nhau khi chơi game, nội dung game được sinh ngẫu nhiên, tạo cảm giác mới lạ cho người chơi mỗi lần quay lại. Các game off thông thường ít có khả năng giữ chân người chơi hơn do nội dung cho lần chơi sau không khác so với lần chơi trước. Để kéo dài thời gian trải nghiệm của người dùng, nhà phát triển cần thiết kế nội dung dài, phức tạp, dẫn đến thời gian phát triển tăng lên đáng kể. Trong phạm vi đồ án, em lựa chọn làm game thể loại roguelike - shoot’em up - khám phá hầm ngục, giúp người chơi dễ tiếp cận với thể loại shoot’em up quen thuộc và giữ chân người chơi, khiến người chơi quay lại dựa vào các tính năng của thể loại roguelike. Bên cạnh việc phát huy những cơ chế đặc trưng của thể loại này như tính ngẫu nhiên, đòi hỏi tính toán, chiến thuật, sự may mắn,v.v., sản phẩm trò chơi trong đồ án sẽ mang đến một lối chơi hoàn toàn mới, bên cạnh việc tiêu diệt hết quái trên bản đồ, người chơi đồng thời sẽ cần tính toán để thực hiện kĩ năng thông qua việc nhặt, tích trữ và sử dụng những vật phẩm kĩ năng xuất hiện ngẫu nhiên thay vì sở hữu chúng ngay từ đầu. Ngoài ra, người chơi sẽ luôn có được sự mới mẻ khi quay lại game nhờ hệ thống đa dạng vật phẩm, kĩ năng và quái vật với những cơ chế hoàn toán khác nhau. Tuy mang tính ngẫu nhiên nhưng người chơi vẫn sẽ được lựa chọn hướng nâng cấp sức mạnh như trở nên nhanh nhẹn hay mạnh mẽ, liên tục lao vào tấn công hay đứng xa trừng phạt kẻ thù, từ đó người chơi sẽ có động lực quay lại để thử sức với một lối chơi mới hoặc tiếp tục tập luyện với lối chơi trước đó.", "label": "human"}
{"ID": "00810001", "file_name": "Xây dựng phần mềm quản lý công việc tập trung đồng bộ với các nền tảng quản lý công việc Cloud", "content": "Trong cuộc sống, công việc hay đi học, đi làm thì lịch trình của mỗi người là rất quan trọng. Để quản lý lịch trình công việc thì mỗi người có thể sử dụng các công cụ khác nhau như ghi chú, ghi chép hay sử dụng các ứng phần mềm, ứng dụng. Trong đó có thể sử dụng các nền tảng quản lý công việc Cloud như Google Calendar, Microsoft Calendar,.... Các nền tảng này giúp chúng ta dễ dàng quản lý công việc của mình. Tuy nhiên, mỗi người có thể có nhiều tài khoản khác nhau để sử dụng cho các mục đích khác nhau ví dụ như: tài khoản các nhân, tài khoản sinh viên, tài khoản nhân viên của công ty A, công ty B,..... Do đó, mỗi ngày khi phải kiểm tra, thêm sửa xóa lịch trình thì chúng ta sẽ phải mở nhiều ứng dụng, phần mềm hay nhiều cửa sổ khác nhau. Khi đó rất dễ bị bỏ sót, nhầm lẫn, khó quan sát tổng thể hay mất thời gian khi phải mở nhiều thứ khác nhau. Chính vì vậy, nhắm giúp cho người dùng thuận tiện hơn, tra cứu nhanh chóng hơn, sản phẩm của đồ án này là phát triển một Website quản lý công việc tập trung đồng bộ với các nền tảng quản lý công việc Cloud. Website giúp người dùng có thể tích hợp nhiều tài khoản hay nhiều loại tài khoản Cloud vào một tài khoản. Khi đó công việc của người dùng có thể được hiển thị trên cùng một giao diện duy nhất, giúp người sử dụng dễ dàng quan sát, tạo mới, chỉnh sửa mà vẫn đồng bộ với các tài khoản riêng. Ngoài ra, sản phẩm còn được thiết kế, phát triển đảm bảo khả năng vận hành và bảo trì, mở rộng sau này. Sinh viên thực hiện (Ký và ghi rõ họ tên)", "label": "human"}
{"ID": "00820001", "file_name": "Hệ thống quản lý và bán đồ nội thất", "content": "Việc chuyển đổi số các hoạt động thông thường đang ngày càng được mở rộng trong những năm trở lại đây. Trên thị trường đã xuất hiện các trang mua sắm trực tiếp và đã mang lại được những lợi ích to lớn trong việc quản lý lợi nhuận cũng như đưa được đến tay người tiêu dùng những mặt hàng phù hợp nhất. Tuy nhiên hiện nay vẫn còn nhiều cửa hàng theo mô hình quản lý thủ công, đặc biệt là những cửa hàng buôn bán đồ nội thất, đồ gia dụng. Việc này không những gây khó khăn trong việc quản lý cũng như quảng bá những sản phẩm rộng rãi ra ngoài thị trường, từ đó ảnh hưởng đến doanh thu và lợi nhuận của cửa hàng. Xuất phát từ thực trạng nói trên, tôi xin đề xuất xây dựng một hệ thống quản lý và bán đồ nội thất dựa trên nền web để quản lý các nghiệp vụ của một cửa hàng. Hệ thống sẽ tập trung vào các cửa hàng vừa, nhỏ. Tôi sẽ triển khai hệ thống của mình lên trên một nền tảng đám mây, từ đó giúp tăng tính an toàn và bảo mật cho dữ liệu của nhà hàng. Các công nghệ chính được sử dụng để xây dựng là các công nghệ mới, có những ưu điểm vượt trội.", "label": "human"}
{"ID": "00830001", "file_name": "Quản lý sản xuất trong doanh nghiệp", "content": "Hiện nay, làn sóng chuyển đổi số doanh nghiệp đang trở thành xu hướng toàn cầu đối với các doanh nghiệp. Nhờ ứng dụng công nghệ thông tin thay cho các công cụ quản lý truyền thống sử dụng giấy bút các doanh nghiệp có thể nâng cao năng suất lao động, chất lượng sản phẩm,... lên rất nhiều lần. Đặc biệt với các doanh nghiệp sản xuất việc ứng dụng chuyển đổi số giúp giải quyết nhiều vấn đề nan giải như quản lý lượng tồn kho, dự báo nhu cầu sản xuất, . . . Nắm bắt được nhu cầu quan trọng đó trên thị trường hiện nay đã có rất nhiều phần mềm giúp đỡ các doanh nghiệp trong việc quản lý sản xuất tiêu biểu như SmartBiz, FOSO.ERP, FaceWorks,... Các phần mềm này đã hỗ trợ giám đốc sản xuất trong việc lên kế hoạch sản xuất, hoạch định nguyên vật liệu nhưng chưa có sự giao tiếp đến hai bộ phận quan trọng khác trong quy trình sản xuất là bộ phận đơn hàng và bộ phận kho, chưa có dự báo nhu cầu tiêu thụ, các sản phẩm cần sản xuất để phục vụ nhu cầu của khách hàng nhanh chóng. Hiểu được sự quan trọng của các chức năng mà các phần mềm hiện nay chưa đáp ứng được, ĐATN đã xây dựng phần mềm “Chuyển đổi số doanh nghiệp: Quản lý sản xuất “.Với hai phương thức (i) sản xuất để tồn kho, (ii) sản xuất theo đơn đặt hàng, phần mềm cung cấp quy trình tạo kế hoạch sản xuất tối ưu với từng phương thức. Phần mềm còn kết nối với bộ phận bán hàng và bộ phận quản lý kho giúp việc quản lý sản xuất trở lên linh hoạt, tạo quy trình sản xuất hoàn thiện. Phần mềm được tích hợp vào hệ thống “Không gian làm việc số” DXClan.com của công ty Cổ phần Công nghệ An toàn thông tin và Truyền thông Việt Nam VNIST. Phần mềm tập trung xây dựng quy trình sản xuất tối ưu, gợi ý số lượng các sản phẩm cần sản xuất. Các đóng góp chính trong ĐATN là (i) Xây dựng quy trình sản xuất tối ưu , (ii) Dự báo nhu cầu tiêu thụ sản phẩm, gợi ý số lượng sản phẩm cần sản xuất cho phương thức sản xuất để tồn kho, (iii) Liên thông với bộ phận bán hàng và bộ phận kho.", "label": "human"}
{"ID": "00840001", "file_name": "Xây dựng hệ thống ký số nội bộ sử dụng công nghệ ký số từ xa", "content": "Hiện nay hình thức ký tay trong các cơ quan tổ chức đang dần được thay thế bằng việc ký số. Với sự phổ biến của các tài liệu dưới dạng điện tử, việc sử dụng ký số sẽ đảm bảo tính pháp lý tương đương với chữ ký tay đồng thời giúp các tổ chức giảm tải thời gian cho việc xử lý văn bản hành chính. Chữ ký số sẽ đem đến sự an toàn và bảo mật thông tin nhờ vào công nghệ phía sau, chống được khả năng giả mạo cao hơn so với chữ ký tay. Nhận thấy được lợi ích của việc ký số, giải pháp ký số sử dụng USB hoặc SIM đã xuất hiện. Sau khi được triển khai trong thực tế, giải pháp đã phần nào cho thấy được tác dụng của việc ký số. Tuy nhiên, việc sử dụng USB hoặc SIM cho việc ký đã bộc lộ yếu điểm bao gồm chi phí cho một thiết bị để có thể ký được khá cao và sự bất tiện khi luôn phải mang theo thiết bị bên người khi ký. Do những hạn chế của giải pháp ký số bằng USB hoặc SIM, hướng tiếp cận được lựa chọn trong đồ án tốt nghiệp là công nghệ ký số từ xa. Giải pháp này sẽ loại bỏ thiết bị như USB hoặc SIM bằng thiết bị phổ biến hơn với chúng ta như máy tính, máy tính bảng, điện thoại di động, ... Do đó, giải pháp này đã tiết kiệm được chi phí khi người dùng có thể ký được bằng các thiết bị quen thuộc sẵn có mà không cần phải mua thêm thiết bị mới để có thể ký số. Với việc sử dụng công nghệ ký số từ xa, người sử dụng sẽ có thể ký ở bất cứ đâu chỉ cần có kết nối internet. Trong đồ án tốt nghiệp này, em sẽ tiến hành phân tích và xác định các yêu cầu của một hệ thống ký số nội bộ sử dụng công nghệ ký số từ xa. Trong các phần tiếp theo, đồ án sẽ trình bày việc phân tích thiết kế để xây dựng các chức năng của hệ thống. Thông qua việc triển khai và đánh giá thử nghiệm, hệ thống đã chứng minh được tính hiệu quả trong việc ký số nội bộ làm qui trình số trong các tổ chức trở nên dễ dàng hơn.", "label": "human"}
{"ID": "00850001", "file_name": "Xây dựng trang web quản lý bán hàng chuỗi cửa hàng cà phê", "content": "Các chuỗi cửa hàng đều đối mặt với nhiều thách thức trong việc quản lý hoạt động của từng cửa hàng. Trong lĩnh vực kinh doanh cà phê, việc quản lý cửa hàng trở nên đặc biệt khó khăn do tính đa dạng và phức tạp của các loại sản phẩm cà phê, phục vụ khách hàng, giá cả, các chi phí liên quan và nhân viên. Hiện nay, các chuỗi cửa hàng cà phê thường được quản lý bằng cách sử dụng các phần mềm riêng lẻ hoặc thủ công bằng giấy viết tay rất tốn kém về thời gian và công sức và có khả năng mắc sai sót cao, gây ra nhiều khó khăn,hạn chế trong quá trình quản lý. Cuối cùng, việc quản lý và giám sát nhiều cửa hàng từ xa cũng là một thách thức đáng kể. Để giải quyết những vấn đề này, em đã chọn đề tài \"Xây dưng trang web quản lý bán hàng chuỗi cửa hàng cà phê\" giúp quản lý hoạt động của từng cửa hàng dễ dàng hơn, đồng thời cải thiện quá trình quản lý từ xa. Bằng cách sử dụng một nền tảng chung, ứng dụng giúp cải thiện tính đồng nhất và độ ổn định của toàn bộ chuỗi cửa hàng. Ngoài ra, ứng dụng còn cho phép chủ cửa hàng theo dõi và giám sát các hoạt động của từng cửa hàng một cách nhanh chóng và tiện lợi. Đóng góp chính của đồ án tốt nghiệp là xây dựng một công cụ quản lý hiệu quả cho chuỗi cửa hàng cà phê. Ứng dụng quản lý giúp cho chủ cửa hàng quản lý hoạt động kinh doanh một cách tiện lợi, tiết kiệm thời gian và công sức. Cung cấp các tính năng quản lý hoạt động của cửa hàng cà phê như quản lý đơn hàng, quản lý kho, quản lý nhân viên và báo cáo thống kê hoạt động của từng cửa hàng.", "label": "human"}
