{"ID": "00010001", "file_name": "Design and develop website for travel social network", "content": "After the COVID epidemic was overcome worldwide, people’s demand for travel increased much. This leads to the need for more information channels for people to share travel experiences or search for information related to the places they want to visit. Currently, there are many channels of tourism information, but they havenot been specialized into a website that only shares and tracks tourism informa tion. Nowadays most people can access the internet very easily. Therefore, I have researched and developed a travel social networking website that allows people to easily search for details about the hotel or tourist destination they need or follow other users with the same passion for traveling. This social networking website will be designed according to the client-server model. In which the server side will use java spring boot and design according to microservice architecture to easily maintain and scale the application when the number of users increases. Docker will be used as the environment for development and deployment. More specifically, docker will be used to build an environmentincluding a database, Kafka, Redis, and GUI tool to interact with DB, ... The client side will use the ReactJS library developed by Facebook. The client-side will also be designed so that we can easily maintain or add a new feature. Finally, we will get a system of social networking websites that are highly exten sible, easy to change, and high performance. The website serves users in finding the right place for vacations, outings with friends, or storing memories and spreading joy and positive energy to everyone.", "label": "human"}
{"ID": "00020001", "file_name": "Run length limited de Bruijn sequences for quantum communication", "content": "key distribution (Quantum key distribution) is a secure communica tion enabling two parties to produce a shared random secret key known only tothem. Current commercial deployed QKD systems have transmission range re stricted to under 1000 km because they rely on optical fiber. The alternative method, satellite QKD, is able to overcome this issue but faces a new challenge caused by noisy environments and swift relative motion between the transmitter and receiver. Therefore, a classical channel, which actually is a timing and synchronization system, is used along with the quantum channel. In such systems, Peide Zhang.et.al proposed to transmit a positioning sequence (also known as a de Bruijn se quence). To consider the timing jitter performance, a long period of no-pulsesshould be forbidden. In Peide Zhang’s method, two pulse slots are used to repre sent a single bit (on-on is 1and on-off is 0) so that one can avoid two consecutive no-pulses. However, the above scheme, called Hybrid de Bruijn (Hybrid de Bruijn) code, requires 2npulse slots to represent a de Bruijn sequence of length nand it needs to receive a sub-sequence of 2 lognpulse slots to locate its position. Observe that it is possible to use less redundant pulse slots to achieve both goals: to synchronize accurately and to avoid a long period of no-pulses, in this thesis, Run length limited de Bruijn sequences are designed in which each binary bit is represented by only one pulse slot, 1is on and 0is off. The RdB sequences are shown to be more general and efficient than the previous work. This thesis provides the first explicit formula for the maximal length of the run length limited de Bruijn sequences. Furthermore, using Lyndon words, an efficient construction of a run length limited de Bruijn sequence with the maximal length is presented. In addition, a sub-ar decoding algorithm that can locate the position of an arbitrary substring is also provided.", "label": "human"}
{"ID": "00030001", "file_name": "A social login solution for Web3 using Shamir’s secret sharing and verified DKG", "content": "The blockchain has emerged as a revolutionary technology with the potential totransform numerous industries by providing a decentralized and transparent plat form for recording transactions and data securely. The administration of identitiesand authentication remains a significant challenge within the blockchain ecosystem, despite its many benefits. In order to resolve this issue, it is necessary to create software that bridges the gap between conventional web authentication meth ods and blockchain-based systems. This bridge software would facilitate a moreuser-friendly and accessible blockchain ecosystem, ensuring that users can access blockchain-based services and applications with seamless identity verifica tion. Blockchain is renowned for its rigorous security features, and any softwareimplementation must maintain this level of security while integrating with standard web authentication protocols. A failure to adequately resolve security con cerns could undermine the trustworthiness of blockchain technology. Innovativeapproaches, such as Shamir’s Secret Sharing (SSS) and Distributed Key Generation (DKG), have considerable potential for addressing these issues. SSS is a cryp tographic technique that divides a secret into multiple portions before distributingthem to participants. This strategy ensures that no single entity has complete access to the secret, thereby enhancing security and reducing the likelihood of unau thorized access. DKG enables the collaborative generation of cryptographic keys without requiring a singular trusted party. This distributed method adds another layer of security and decentralization to the authentication procedure. I intend todevelop a social authentication solution for decentralized applications (DApps) us ing SSS and DKG techniques. This solution would allow users to authenticate using their social network accounts while assuring their privacy and security through theuse of secure and distributed authentication protocols. I will design the system ar chitecture, implement the required software components, and assess the solution’s performance and efficacy. Students (Sign and full name)", "label": "human"}
{"ID": "00040001", "file_name": "Analyze and design software to checking weld quality using image processing technology and segmentation deep learning", "content": "Locating and identifying printed circuit board (PCB) mounted components basedon machine vision is an important and challenging issue for automated PCB inspec tion and PCB recycling. Through that, we can determine product quality quickly, helping to reduce manpower as well as costs in industrial production. In this project,we propose a depth image-based PCB segmentation method to segment and iden tify components in a PCB by classification method.", "label": "human"}
{"ID": "00050001", "file_name": "Application of matrix decomposition technique in launching e-book recommendation system", "content": "E-commerce is currently developing and offering a ton of convenience to clients. Because of the variety of models available, it might be challenging for people to make a decision on. Furthermore, the phenomenon of the long tail is very common in commerce; the best-selling products make up a very small portion of the total products, while the long list behind them only contributes very little. The product might not be personalized for the user. Therefore, the recommender system is required when the user has too many options or when he is unable to define his requirements at the beginning of the shopping session in a clear and comprehensive manner. On stores are gradually implementing the recommendation system, particularly significant e-commerce platforms like Shopee, Amazon, Netflix, etc. have excellent systems. In this thesis, we propose the steps to build a website that sells books having a built-in recommendation system. The system’s front-end and back-end are built using the Ionic framework and Asp.net. Specially, we construct two recommender algorithms specifically for the system and evaluate their effectiveness.", "label": "human"}
{"ID": "00060001", "file_name": "Continual Relation Extraction with Feature Decorrelation", "content": "Continual Relation Extraction (CRE) aims to continuously train a model to learn new relations while preserving its ability on old learned relations. To handle classificationtasks, CRE models often include a softmax classifier that is trained using Cross Entropy (CE) loss. The Nearest Class Mean (NCM) classifier, however, has recently been favored over the traditional Softmax classifier with Cross-Entropy loss in Continual Learning (CL) studies because of its higher performance. One flaw in their research is that they failed to provide an explanation for why the NCM classifier performs better than the Softmax classifier when CE Loss is present. In contrast to those works, I investigate how CE loss degrades performance by impairing the transferability of the learned features. In detail, I revisit CE loss by plugging CE loss into the state-of-the-art framework CRL and note that CRL does not use CE loss. I then give a concrete investigation of the impact of CE loss on the CRE problem through experiments using spectral analysis. In light of this analysis, I propose a simple yet effective class-wise regularization that improves the transferability of the representations. With my regularization, we can take advantage of both mechanisms Supervised Contrastive Learning (SCL) from CRL and Softmax classifier. I observe that my proposed regularization boosts the transferability of the representations and outperforms state-of-the-art CRE methods by a significant margin on the FewRel and TACRED datasets.", "label": "human"}
{"ID": "00070001", "file_name": "CRYPTOCURRENCY DATA ANALYSIS AND VISUALIZATION", "content": "In my graduation thesis, I focused on analyzing and visualizing momentum datafor cryptocurrencies. The problem I addressed was how to understand and effectively leverage the dynamic changes in cryptocurrency data to achieve optimal re sults in predicting trends and price charts. Currently, analyzing and predicting trends in crypto data is a significant chal lenge due to the market’s volatility and uncertainty. There are various approaches, from technical analysis to using machine learning prediction models. However, there are still some limitations, such as price instability, unforeseeable market events’ impacts, and the complexity of crypto data. In this thesis, I opted for an approach using quantitative analysis and deep learn ing method to identify trend models and predict crypto prices. By utilizing suitable tools and algorithms, I designed reliable charts and representations of momentum data, enabling a better understanding of volatility and opportunities in the crypto market. The outcome of this research provides a novel approach to analyzing and predicting price trends in crypto data. This may assist users in making intelligent investment decisions and achieving better performance in the cryptocurrency mar ket.", "label": "human"}
{"ID": "00080001", "file_name": "Research on domain-oriented machine translation English-Vietnamese", "content": "Nowaday, neural machine translation (NMT) systems constitute state-of-the-art systems in machine translation. However, such translation models require relatively large train data and struggle to handle a specific domain text. A domain may consist of texts from a particular topic or texts written for a particular purpose. While NMT systems can be adapted for better translation quality in a target domain given a representative train corpus, this technique has adverse side effects, including brittleness against out-of-domain examples and ”catastrophic forgetting” of previous domains represented in the train data. Moreover, one translation system must cope with many possible domains in real applications, making the ”one domain one model” impractical. A promising solution is to build multi-domain NMT systems trained from many domains and adapted to multiple target domains. The rationale behind this is twofold. First, large train corpus improve the generalization of the NMT system. Secondly, texts from one domain can be valuable for adapting an NMT model to a similar domain. The scarcity of data and the hypothetical positive transfer effect are also two main reasons for building multilingual NMT systems. Maintaining multiple bilingual MT systems requires lots of hardware resources as the number of language pairs grows quadratically with the increasing number of languages. Both multi-domain and multilingual NMT systems are essential for saving resources for the MT industry and improving the quality of the MT service. In my work, this research was motivated by the idea of incorporating a domain tag for individual sentences, a technique that has demonstrated remarkable efficacy in multilingual and multidomain machine translation training. The proposed approach emphasizes data quality while preserving the integrity of the model’s architecture. This thesis endeavors to develop a multi-domain machine translation system with particular emphasis on three domains: legal, medical, and technology. The multi-domain machine translation system comprises two primary components: domain classification and neural machine translation. Prior to entering the NMT phase, sentences undergo a domain classification module, which identifies the domain of each sentence. Subsequently, a domain token is appended to the sentence before being processed by the NMT component.", "label": "human"}
{"ID": "00090001", "file_name": "Designing and developing sales staff management system", "content": "Compared to many years ago, now we have seen a lot of dizzying developments around the world. With so many great landmark inventions that made it possible for two-legged humans to walk on the ground, we can now reach the stars that no one could have imagined. What drives us to such great success? The answer is the way of management and organization. Like the closely linkedgears of a watch, we can see that even the smallest missing part can make the en tire operation of the watch stop. The same is true for every company in the world. Everyone in the company will have their positions to ensure that the large appara tus works to the company’s requirements. When everything is done, the result is using the products and services the company offers to the consumer. But that is not enough for users. Because human needs have no limits. People always crave better things and demand more from businesses. So what do companies do? What people crave has been recognized and solved by businesses long ago. Users need faster, more perfect, and companies understand that. Proof that the suc cess of every big business is the speed of service to consumers. Time waits for no one, neither do consumers. They will accept the service with the fastest servicetime. When it comes to the quickest time, that company is also the closest to win ning the race to succeed in the fiercely competitive battlefield. Therefore, we can see that speed and productivity are the keys to business success.", "label": "human"}
{"ID": "00100001", "file_name": "A Top-down action game for learning English with Unity", "content": "Technology is developing at a breakneck speed and the world is becoming more and more open. Needless to say too much about the importance of integration and learning, absorbing the quintessence and progress from other cultures. To do that,we probably all know how important a foreign language is. Learning a foreign lan guage means learning more about a culture and acquiring new knowledge. There are a lot of languages we can choose from based on our preferences and interests, but we can all agree that English is one of the best choices. Currently, English is the official language of more than 53 countries and territories, the second language of nearly 100 countries, and the common language of more than 400 million people around the world. In this era, almost all professions of commerce, health, media, tourism, etc. use English. At most meetings, forums,exchanges of work, knowledge and experiences around the world, this international language is used as a bridge. That is why in the past 10 years in Vietnam, English centers have appeared anddeveloped very strongly. Technology is also used to create programs and applica tions for learning English that are very popular and has had obvious effects. As an avid language learner and also an Information technology student who likes to play video games, I’ve always had ideas about developing a game that can help me learn English effectively. Before deciding whether to realize the above idea, I had certain research about the game industry and realized its great attraction at the present time. Therefore, I have decided that my graduation project is a game that can help users learn English with the expectation that my product will help users be both entertaining and educational.", "label": "human"}
{"ID": "00110001", "file_name": "MCLDA: Multi-level Contrastive Learning for Domain Adaptive Semantic Segmentation", "content": "Deep Learning models have been widely used in difficult tasks like autonomousdriving and machine translation. However, creating such models has proven diffi cult, both computationally and because it necessitates a large amount of annotated data. Unsupervised domain adaptation (UDA), which uses accessible unlabeled data, allows models to be modified to new data distributions. Previous domainadaptation techniques only took into account the alignment of intra-class repre sentational distributions across different domains, failing to adequately explore theinter-class structural relationship. As a result, aligned representations on the tar get domain may no longer be as easily discriminated as they were on the source domain. In this work, I propose Multi-level Contrastive Learning for Domain Adaptive Semantic Segmentation (MCLDA), a novel one-stage adaptation framework thatemphasizes the semantic concepts of individual pixels in order to encourage learn ing of class-discriminative, ultimately improving the performance of self-training methods. Specifically, the method start by creating a pixel-wise contrastive loss by taking consideration of the relationships between pixel-wise representations from both domains. In essence, groups of pixel representations from the same category should group together, whereas groups from different categories should spread out. Specifically, our method performs contrastive loss not only at feature level, also at output level. In addition, we propose a novel mixing strategy that addresses the dataset imbalance problem. The main concept is to repeatedly copy pixels from uncommon classes in source images and paste them into destination images. The experimental results on a commonly adopted benchmarks GTA5 →Cityscapes and achive 56.76 in term of mIoU. Noticeably, in some categories that often get lowIoU, such as \"fence\" and \"pole\", our method achieves 35.30 and 35.67, respec tively, which further illustrates the efficiency of our design.", "label": "human"}
{"ID": "00120001", "file_name": "Design a system to manage and support sales of technology products", "content": "In today’s modern society, the technology industry is rapidly evolving, leadingto an increase in the number and diversity of technology products. However, man aging and supporting the sales of these products still pose significant challenges. Moreover, many retail stores, especially smaller businesses, still do not have their own on sales platforms, making it challenging for them to effectively promote their products and reach a wider customer base. To address the challenges posed by the rapidly evolving technology industry and the increasing diversity of technology products, a sales support and management system is being designed and developed for the business. The primary objective ofthis system is to enhance operational efficiency and expand the store’s on pres ence. By integrating features for inventory management, customer management, order management, and post-sales support services, the system aims to streamvarious aspects of the business operations and improve customer experience. Ad ditionally, the solution involves developing a user-friendly management interface for sales staff, enabling them to efficiently monitor inventory, manage customer information, and process orders. To achieve these goals, the project aims to build a comprehensive sales management website system, utilizing Angular to handle the front-end interface. Subse quently, the back-end will be constructed using ExpressJS. Finally, MongoDB will serve as the database repository to store and manage the valuable data. After completing the design and development process, the system has success fully built the fundamental features of a sales system, encompassing functionalities related to the buyer’s shopping experience and support functions for sellers such as inventory management and order processing. Student implement ii", "label": "human"}
{"ID": "00130001", "file_name": "Violence Detection in Surveillance Camera", "content": "Violence, which causes numerous damage to society, is a major global problem. With the development of technologies, artificial intelligence algorithms have been combined with security cameras to create an end-to-end system for detecting and warning violent acts. Additionally, a majority of violent behaviors in Vietnam happen between a couple of people. Therefore, most benchmark datasets in this field, which are recorded from the crowd, sports games, or movies, are not suitable for our country’s situation. In this project, we aimed to propose an approach for detecting violent acts which could be applied in Vietnam’s environment. We developed a novel violence detection method fusing Deep Learning and optical flow on a benchmark dataset containing video of a small group of people (from 1 to 3) captured using surveillance cameras. Besides, we also extend the mentioned standard dataset to ensure its capability of evaluating the generalization of models. Experimental results show that our method outperforms in one test set and maintainsthe top 3 in accuracy in the remaining test set compared to experimented state-of the-art violence detection methods.", "label": "human"}
{"ID": "00140001", "file_name": "ARNav - Augmented Reality Indoor Navigation Mobile Application", "content": "an individual visits a large building, such as a shopping mall or a super market, for the first time, they may experience confusion in addition to excitement. While it may be considered a minor journey through a modern indoor space, indi viduals often become tired when attempting to navigate to a specific location within the building without knowing how to get there. While most buildings nowadays provide maps on their front doors, few individuals seriously remember them. Even when using the maps, it can be challenging to follow the imagined path. This is where my indoor navigation app comes in. Unlike Google Maps, it was specifically designed for indoor use and provides a solution to this issue. While some may initially view my app as simply a photo of a map on a smart phone screen, it offers much more than a traditional 2D map. By incorporatingAugmented Reality technology, the app is transformed into a ”blue bird,” provid ing dynamic 3D artifacts on users’ smartphone cameras to guide them through indoor spaces with ease. Some may ask, ”Why should I use your AR navigation app when there are al ready similar options available?” But the question is, have you ever tried using them? I have, and let me tell you, it was a nightmare for my smartphone. Most of them required me to wander around the shopping mall holding my phone, while the app gathered data by using the camera. After collecting the data, when I finally got to try the guiding feature, the app was incredibly laggy and drained the battery life quickly, not to mention the lack of accuracy. This experience is what led meto create my own navigation app, designed to be easily applied to various build ings, with high performance while utilizing AR technology and minimal energy consumption, at least less than existing apps. I came to the realization that the underlying issue with those apps was the way the system was designed. Their aim was to construct virtual environments using 3D platforms and execute computations on them, which required large amounts of computing resources that a small smartphone could barely provide. To tackle this, I adopted a different approach: I transformed the real world into data structures that a computer can easily interpret. After all the intricate processes, I only utilized the 3D platform in the final task. To be more specific, this project addresses two primary problems. The first is the Path Finding task, where I created standard graphs from the blueprints of the buildings and ran the routing algorithm on them to determine the route. Once we have the path, the second task is to convert it into ii", "label": "human"}
{"ID": "00150001", "file_name": "Vietnamese Multi-document Summarization", "content": "In the field of Vietnamese multi-document summarization, several challenges exist, such as dealing with long input sequences, generating summaries that resemble human-like quality, and the limited availability of labeled data. However, advancements in Transformer-based models, which benefit from parallel computation architecture and attention mechanisms, have partially addressed the issue of long input sequences. Moreover, these models, trained on extensive amounts of text, have demonstrated impressive performance in text generation tasks, approaching the level of human performance. Additionally, employing a pre-training strategy in a self-supervised manner has proven effective in overcoming the scarcity of labeled data. With these considerations, the objective of my thesis is to utilize a large amount of unlabeled text to pre-train a language model specifically designed for Vietnamese summarization task. Following pre-training phrase, the model is fine-tuned on a small set of text summarization samples, aiming for high performance. In terms of Vietnamese multi-document summarization, my thesis contributes by adapting a promising transformer-based model called PRIMERA  to work effectively in the Vietnamese language. Unlike the original Transformer architecture, PRIMERA employs Longformer  to handle long input sequences, which are essentially concatenations of multiple documents. Furthermore, the authors of PRIMERA introduce a novel masking strategy named Entity pyramid strategy, which identifies significant information across documents and consolidates it into a single summary. Experimental results demonstrate that my pre-trained model achieves comparable performance or sometimes higher in both zero-shot and full-finetuning evaluation scenarios. When fine-tuned using approximately 200 samples, our model achievesimpressive Rouge scores , specifically 76.7%, 78.9%, and 73.9% for Rouge1 F1, and 50.2%, 55.0%, and 46.7% for Rouge2-F1, on the VMDS, ViMS, and VLSP datasets respectively. Evaluated on VNDS, a single-document dataset, themodel also achieve comparable result with 63.0%, 33,3% and 42.7% for Rouge1 F1, Rouge2-F1 and Rouge-L-F1 respectively. Our model also achieves very good results in zero-shot evaluation. As far as I know, this is the first publicly availablelarge-scale pre-trained language model specifically designed for Vietnamese multi document summarization, showcasing its effectiveness in resource-limited languages.", "label": "human"}
{"ID": "00160001", "file_name": "E-commerce Luxury Clothes Website", "content": "In the rapidly developing economic environment, fierce competition, along with the outstanding development of science and technology, information technology, and e-commerce is one of the exceptional fields, that have the most practical contributions to the economy. Information technology and e-commerce are present in most areas of life and have become very effective support tools in management and business. Today, e-commerce brings many benefits not only for businesses but also for consumers, such as saving time and money in shopping and consuming. Selling on is no longer a strange form for consumers, it is a prevalent form of work, and this form is chosen by any business dealing in products. To meet the needs ofusers, e-commerce websites need to be built with diverse, user-friendly, and easy to-use features. This graduate thesis will research, design, develop, and build an e-commerce website using React. This study will cover factors such as features, user interface, basic website features, relevant technologies, and tools used to develop the website. The graduation thesis will give specific problems and solutions to solve the above problems.", "label": "human"}
{"ID": "00170001", "file_name": "Developing game optimisation tools and utilising in development of platformer game Pixel", "content": "today’s world, along with the development of society, the demand for en tertainment has also increased, and gaming has become an indispensable part of people’s lives. Naturally, along with opportunities come significant challenges, andthe requirement for games is to be more enjoyable, engaging, innovative, and cre ative in order to keep up with trends. This poses challenges for large game studiosand even more difficulties for indie developers. Therefore, the use of readily avail able packages is gradually becoming a trend, helping indie developers in the game development process more quickly and easily. However, existing packages often focus on only one small aspect, making them difficult to implement, or if they are easy to use, they often come with high costs,which is challenging for indie developers who typically have small budgets. There fore, this project chooses to develop small, easy-to-install and use packages that are free of charge to maximize support for indie developers. Especially, the demand for GUI Manager, Object Pool Manager, and the Goal-oriented planning package for AI game development is particularly high. Therefore, the project focuses on developing these packages which are designed as tools that can be directly integrated into Unity engines, aiming to develop a complete game with logical game mechanics, detailed game design, and an average game session. The GUI Manager is used to manage the entire UI system in the game. It of fers the advantage of having a centralized object for easy tracking, while each UI component is functionally and structurally separated, making it easy to modify, develop, and scale up. The Pool Manager is responsible for managing all the object pools in the game system, including active objects in the scene and temporary variable memory, which helps optimize the game’s performance. As for the Goal-oriented planning package (GOAP), it is an AI library that allows building characters capable of autonomous behavior based on predefined ob jectives. Finally, the project also develops a platformer game with a pixel art style, uti lizing the aforementioned packages for its development. The game is designed as a journey where players can explore new lands. During this journey, players will have to upgrade their abilities, defeat monsters, and collect valuable items.", "label": "human"}
{"ID": "00180001", "file_name": "Inventory rotation using RFID automated inventory in logistics warehouses", "content": "Logistics warehouses have become important players in the supply chain. Thefeatures that are shared include item management and time-limited storage. Managing the flow of goods into the warehouse from the processes of exporting, import ing, storing, or rotating items is the most crucial activity in warehouse, especially in automated and private warehouses. To improve the accuracy of inventory results and synchronize the management system at the logistics warehouses, automaticinventory methods must completely replace manual methods. Also, inventory rota tion is necessary because commodities engage in continual import-export activities throughout the day, resulting in disorganized arrangements that interfere with other operations and goods management. Moreover, it has become common for Amazon, Uniqlo and Zara to manage inventories and warehouses utilizing RFID. Many apps, such as Sapo, Misa, SAP provide inventory management with inven tory functions, but the most of them do not meet the needs of logistics warehouses. Because the inventory process is carried out manually, the results do not adequately reflect the number, quality, and current condition of the items, which is time and labor intensive. Also, the goods sorting function does not take into account the real storage condition to provide sorting recommendations, efficiently utilize storage space, track, or control goods. Besides, the DxClan system connects departmentsin private logistics warehouses and offers efficient warehouse management capa bilities, but it lacks the capability of automatic inventory, inventory rotation. This thesis has suggested a solution to employ RFID to automatic inventory in logistics warehouses and from the inventory results, suggests inventory rotation to bring practical benefits for businesses. I chose the topic \"Inventory rotation using RFID automated inventory in logistics warehouses\" for my graduation project. The thesis focuses on developing a built-in automatic inventory module that integratesinto the DxClan digital workspace management system with newly developed fea tures such as (1) automatic inventory of goods in the warehouse using RFID tagsand reader, (2) suggest inventory rotation based on inventory results in the ware house. Also, two components of the DxClan system’s initial functionality have been updated and modified, including (3) generating and assigning RFID codes to goods during import processing, (4) search for and track product changes before and after import-export process and rotating the warehouse. The program has been installed on the DxClan system and tested successfully using a data set, a set of hardware (a reader at 13.56 MHz and 20 RFID tags).", "label": "human"}
{"ID": "00190001", "file_name": "Mobile application for providing home services", "content": "the modern technology industry, providing home services has become an ever evolving field worldwide, including Vietnam. Currently, there are relatively fewapplications that offer home services, and most of them do not fully meet the com prehensive needs of users. Users often have to invest significant time and effort when seeking specific services, occasionally encountering unpleasant experiences due to the inability to find suitable service providers or incomplete service delivery. On the other hand, for service providers, finding opportunities as freelancers canbe quite challenging. They often resort to intermediary companies or join organi zations to offer services to customers. This not only limits their creative freedom but also affects their income and personal development. To address these issues, this thesis focused on developing an efficient homeservice application, leveraging the robust development of technology and the importance of mobile phones and the internet in daily life. The application has es tablished a convenient platform for connecting service providers and customers, ensuring convenience and optimizing the experience for both parties. The scope of the proposed solution in this thesis includes designing a user friendly interface that enables users to easily search for and select suitable home services to meet their needs. To ensure service quality and reliable feedback, a customer review and rating system was integrated into the application. The outcome of the research and testing is a stable and efficient home service application that caters to the practical demands of users. The progress made inconnecting service providers and customers has contributed significantly, enhanc ing the efficiency and utility of home service usage. This thesis holds promising benefits for both user communities and home service providers in the future.", "label": "human"}
{"ID": "00200001", "file_name": "TRACKING SYSTEM FOR ONLINE NEWS SITES IN VIETNAM", "content": "Trendz - as the name speaks for itself, consists of \"trend\" and \"Z\", is a project thatmonitors social trends, and was created by a Gen Z. It \"should\" have the capabili ties to keep track of latest social issues, attentions and analyze them to summarize and extract useful results. At its core, Trendz is built based on data science techniques and microservices architecture. Its machine learning models, though not always the State of the artones, should provide sufficient capabilities to extract and generate reasonable out puts that can be utilized by real users. The driving force behind Trendz lies in its dedication to empowering individuals and businesses alike with the knowledge necessary to make informed decisions. Content creators, marketers, and opinion leaders can harness the platform’s ca pabilities to better understand the public sentiment, enabling them to tailor theirstrategies and messages to resonate with the ever-changing interests of their audi ence. Author ii", "label": "human"}
{"ID": "00210001", "file_name": "Funny Zoo - A Casual Game Built With Unity", "content": "Mobile gaming has become a vital part of modern life. People around the worldspends hours of their daily life playing mobile games, from a student who plays co operative games with friends in the break, to a worker who is traveling to work on the train and want something to kill time. As the requirement for gaming increase, more and more games are being published everyday. Though some of the gamesare well refined with high quality and content, a large number of other games be ing published on app store are just cloned from the top games of the market, with identical gameplay, poor design, less refinement and full of ads. Those games are a huge annoyance to the players and making them to turn away with mobile gameproducts. In order to gain back the trust of the mobile game player, as well as bring ing them relaxing and enjoyable moment, this graduation thesis will aim to makea mobile casual game with carefully designed theme, high quality content and re markable game play that will satisfy even the strictest players. The product will bedeveloped using a fully featured game engine and a proper workflow so as to max imize the productivity as well as minimize the development time, but still ensure the quality of the game itself. The final products of this graduation thesis will be a complete game with easy-to-catch-up game mechanic, detailed game design and with average game session in order to be suitable for a wide range of mobile game players.", "label": "human"}
{"ID": "00220001", "file_name": "Decentralized Video Sharing Website Using Eueno and Smart Contract", "content": "the increasing reliance on digital media consumption, on video plat forms have become the primary medium for sharing and accessing information, entertainment, and diverse perspectives. However, the centralized nature of these platforms has given rise to censorship and data ownership challenges. To combatthese challenges, decentralized video sharing sites that leverages blockchain tech nology are born. By adopting a decentralized architecture, the proposed platform removes the need for a single central authority, empowering content creators and viewers alike with greater autonomy and control over the shared content. There are several decentralized sharing platforms such as dTube, BitTute, Odysee each designed to address the issue of centralized control and censorship. These platform utilize different storage method like LBRY for Odysee, IPFS for dTube and WebTorrent for BitChute. And so I intend to build a video sharing site using Eueno, another decentralized storage method. This solution would allow users toupload and watch video completely censor-free. I will design the system architec ture, implement the required components, and assess the website’s performance and efficiency.", "label": "human"}
{"ID": "00230001", "file_name": "Building Website to manage human resources following projects in IT company", "content": "During my academic journey and internship experience, I have come to realize the paramount importance of a well-structured management system in optimizing a company’s operations, particularly in the rapidly evolving field of informationtechnology. Equipped with the knowledge and skills I have acquired, I am deter mined to undertake this project to research and develop an effective IT company management system. The primary objective of this project is to create a comprehensive manage ment system that encompasses various aspects, including personnel management, project management, contract management, and more. Through in-depth research and understanding of the specific requirements within the IT industry, I aim todesign and build a system that caters specifically to the unique needs of IT compa nies. This report will provide a detailed account of the process involved in analyzing,designing, and implementing the IT company management system that I have de veloped. Additionally, I will showcase the significant functionalities and featuresof the system, highlighting the benefits that the company can reap after success ful implementation. The goal is to stream operations, enhance efficiency, and facilitate informed decision-making for the company’s success and growth. By utilizing cutting-edge technologies and following industry best practices, Iintend to create a user-friendly and intuitive platform that enables seamless man agement of various aspects of the company’s operations. The system’s adaptability and integration with existing IT infrastructure will be key to ensuring a smooth transition and user acceptance. In conclusion, my passion for improving management practices and my com mitment to the IT industry drive my determination to embark on this project. I am confident that this IT company management system will significantly contribute to the company’s success and efficiency, and I am excited to see the positive impact it will have on the organization’s overall performance.", "label": "human"}
{"ID": "00240001", "file_name": "Building a social media application for sharing image and video", "content": "Nowadays, along with the explosion and robust development of the internet,generations of computers, smartphones, and social networking sites are also grow ing. Social networks have gradually become an indispensable part of modern life. They bring many utilities in all aspects of social life such as: commerce, study, entertainment. In today’s era, images and videos are the most popular on content, as they are highly visual, interactive, and entertaining. To meet the needs of users, I want to build a social network that allows users to share their own images and videos with others, while also connecting them with people who have similar interests. The main tasks of this graduate project include: system analysis and design, and building a social networking site that allows users to share personal feelings through posts, photos, and videos and follow each other. They can also interact through messaging, commenting, on calling, video calling, etc. Users can also manage and edit their personal profiles.", "label": "human"}
{"ID": "00250001", "file_name": "Study research and create a saas-based search engine for e-commerce websites. Quế Hoài Vũ vu.qh176914@sis.hust.edu.vn Major: Information technology Specialization: Global ICT Supervisor: Master of Science Lê Tấn Hùng Signature Department: Information", "content": "In the era of industrialization and modernization, the purchase and sale of products On shopping is becoming a new culture with consumers getting used to on shopping habits. In the development of e-commerce, Shopify platform has come a long way in dominating its market. The demand for using Shopify is growing especially high during the Covid-19 pandemic. Shopify takes the lead in building a system of partners to jointly develop interfaces, applications, and support powerful commerce stores. E-commerce website provides advanced extension features to allow on transactions such as: multi-layer catalog, shopping cart, favorite page, price comparison, cross-selling, ordering, payment, marketing campaign, management Manage customers, manage collections, etc. With practical needs from using e-commerce products of companies and businesses, I realized that some necessary features need to be added. of an e-commerce product and that product can also be taken to commerce to help the store owner use the product according to the store’s needs. This is also the reason why I chose the topic: \"Designing a search page application on Shopify e-commerce platform\".", "label": "human"}
{"ID": "00260001", "file_name": "Building a software system for teaching and learning English", "content": "In today’s society, multilingualism is becoming more and more significant. Alongwith increasing your employability, learning a foreign language gives you the opportunity to communicate with others and gain knowledge of other cultures. Chil dren are therefore encouraged to acquire a foreign language from a very young age. English is the most well-known foreign language in our nation. Children are learn ing English at a younger age as English is in many countries’ educational systems. Traditional ways of learning English are important, but they are geographically and chronologically constrained, as well as it could usually get expensive. Throughout the years, technological improvements have had an impact on En glish learning. With the rising availability of smartphones and computers, as well as communications technology, learners may access English learning resources anywhere and whenever they choose. Many applications for learning English on various platforms have been created and released since then. Each product has advantages and disadvantages, but only a handful of them can give users with a comprehensive experience for learning a new language. In this thesis, we design and build a web application for users to teach and learn English. Our web application features dictionary, flashcards, lessons and exercises. In addition, the system allows administration, managing its users and contents.", "label": "human"}
{"ID": "00270001", "file_name": "E-commerce platform: A module for suppliers", "content": "In the 4.0 revolution, the considerable development of technology makes somany utilities for humans in every aspect, specifically in shopping demand. How ever, because of the distance and time, nowadays, people take more time on shopping, the on e-commerce appears. Especially in covid 19 disease, on shopping has emerged as a \"lifesaver,\" helping consumers secure their lives and jobs and helping manufacturers and distributors of goods develop production and business. Currently, Vietnam has nearly 45 million people participating in on shopping. On shopping is convenient and saves time. Consumers can freelychoose the necessary items and necessities for daily life and work without spend ing too much time everywhere that has the internet. However, on shopping also has many problems. The seller delivers poorquality, counterfeit goods. Many sellers only post pictures and prices, but the buyers wait forever without delivery, even the buyers finish trading. The risk of per sonal information being exposed when on shopping. There are some solutions for customers to prevent risks when on shopping. Firstly, customers chose the prestige e-commerce store. Secondly, the government should take action to avoid goods of prestige from on shopping. I think about creating an e-commerce site to help customers buy authentic goods with reasonable shipping fees and the shortest time shipment. To do that, it needs to make a subsystem for suppliers to manage their products and distributors. This graduation research is about a module for suppliers in my e-commerce system. I named it Soda e-commerce. This subsystem has a user-friendly experience anda user-friendly user interface to help suppliers bring their products to Soda e commerce.", "label": "human"}
